Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: The group ID which will own the device. If set to NULL everyone will be able to use the device.
kk: Құрылғыны иеленетін топ ID. Егер NULL орнатылса, барлығы құрылғыны қолдана алады.

source: The operating mode of the virtual device. Allowed values are "tun" (1) to create a layer 3 device and "tap" (2) to create an Ethernet-like layer 2 one.
kk: Виртуалды құрылғының жұмыс режимі. Рұқсат етілген мәндер: 3-деңгейлі құрылғыны жасау үшін "tun" (1) және Ethernet сияқты 2-деңгейлі құрылғыны жасау үшін "tap" (2).

source: If the property is set to TRUE, the interface will support multiple file descriptors (queues) to parallelize packet sending or receiving. Otherwise, the interface will only support a single queue.
kk: Егер қасиет TRUE мәніне орнатылса, интерфейс пакеттерді жіберуді немесе қабылдауды параллельдеу үшін бірнеше файл дескрипторларын (кезектерді) қолдайды. Әйтпесе, интерфейс тек бір кезекті қолдайды.

source: The user ID which will own the device. If set to NULL everyone will be able to use the device.
kk: Құрылғыны иеленетін пайдаланушы ID. Егер NULL орнатылса, барлығы құрылғыны қолдана алады.

source: If TRUE the interface will prepend a 4 byte header describing the physical interface to the packets.
kk: Егер TRUE болса, интерфейс пакеттерге физикалық интерфейсті сипаттайтын 4 байттық тақырыптаманы алдын ала қосады.

source: If TRUE the IFF_VNET_HDR the tunnel packets will include a virtio network header.
kk: Егер TRUE болса IFF_VNET_HDR туннель пакеттері virtio желілік тақырыптамасын қамтиды.

source: A dictionary of key/value pairs with user data. This data is ignored by NetworkManager and can be used at the users discretion. The keys only support a strict ascii format, but the values can be arbitrary UTF8 strings up to a certain length.
kk: Пайдаланушы деректері бар кілт/мән жұптарының сөздігі. Бұл деректер NetworkManager тарапынан еленбейді және пайдаланушылардың қалауы бойынша қолданылуы мүмкін. Кілттер тек қатаң ascii пішімін қолдайды, бірақ мәндер белгілі бір ұзындыққа дейінгі ерікті UTF8 жолдары болуы мүмкін.

source: For outgoing packets, a list of mappings from Linux SKB priorities to 802.1p priorities. The mapping is given in the format "from:to" where both "from" and "to" are unsigned integers, ie "7:3".
kk: Шығыс пакеттер үшін Linux SKB басымдықтарынан 802.1p басымдықтарына сәйкестендірулер тізімі. Сәйкестендіру "from:to" пішімінде беріледі, мұндағы "from" және "to" екеуі де таңбасыз бүтін сандар, яғни "7:3".

source: One or more flags which control the behavior and features of the VLAN interface. Flags include "reorder-headers" (0x1) (reordering of output packet headers), "gvrp" (0x2) (use of the GVRP protocol), and "loose-binding" (0x4) (loose binding of the interface to its controller device's operating state). "mvrp" (0x8) (use of the MVRP protocol). The default value of this property is NM_VLAN_FLAG_REORDER_HEADERS, but it used to be 0. To preserve backward compatibility, the default-value in the D-Bus API continues to be 0 and a missing property on D-Bus is still considered as 0.
kk: VLAN интерфейсінің мінез-құлқы мен мүмкіндіктерін басқаратын бір немесе бірнеше жалаушалар. Жалаушаларға мыналар кіреді: "reorder-headers" (0x1) (шығыс пакет тақырыптамаларын қайта реттеу), "gvrp" (0x2) (GVRP хаттамасын қолдану) және "loose-binding" (0x4) (интерфейстің оның контроллер құрылғысының жұмыс күйіне бос байланысуы). "mvrp" (0x8) (MVRP хаттамасын қолдану). Бұл қасиеттің әдепкі мәні NM_VLAN_FLAG_REORDER_HEADERS, бірақ ол бұрын 0 болатын. Артқа қарай үйлесімділікті сақтау үшін, D-Bus API-дегі әдепкі мән 0 болып қала береді және D-Bus-та жоқ қасиет әлі де 0 ретінде қарастырылады.

source: The VLAN identifier that the interface created by this connection should be assigned. The valid range is from 0 to 4094, without the reserved id 4095.
kk: Осы қосылым жасаған интерфейске тағайындалуы керек VLAN идентификаторы. Жарамды ауқым — 0-ден 4094-ке дейін, резервтелген 4095 ID-сіз.

source: For incoming packets, a list of mappings from 802.1p priorities to Linux SKB priorities. The mapping is given in the format "from:to" where both "from" and "to" are unsigned integers, ie "7:3".
kk: Кіріс пакеттер үшін 802.1p басымдықтарынан Linux SKB басымдықтарына сәйкестендірулер тізімі. Сәйкестендіру "from:to" пішімінде беріледі, мұндағы "from" және "to" екеуі де таңбасыз бүтін сандар, яғни "7:3".

source: If given, specifies the parent interface name or parent connection UUID from which this VLAN interface should be created. If this property is not specified, the connection must contain an "802-3-ethernet" setting with a "mac-address" property.
kk: Берілген болса, осы VLAN интерфейсі жасалуы керек негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді. Егер бұл қасиет көрсетілмесе, қосылым "mac-address" қасиеті бар "802-3-ethernet" баптауын қамтуы керек.

source: Specifies the VLAN protocol to use for encapsulation. Supported values are: '802.1Q', '802.1ad'. If not specified the default value is '802.1Q'.
kk: Инкапсуляция үшін қолданылатын VLAN хаттамасын көрсетеді. Қолдау көрсетілетін мәндер: '802.1Q', '802.1ad'. Егер көрсетілмесе, әдепкі мән '802.1Q'.

source: Dictionary of key/value pairs of VPN plugin specific data. Both keys and values must be strings.
kk: VPN плагиніне тән деректердің кілт/мән жұптарының сөздігі. Кілттер де, мәндер де жолдар болуы керек.

source: If the VPN service supports persistence, and this property is TRUE, the VPN will attempt to stay connected across link changes and outages, until explicitly disconnected.
kk: Егер VPN қызметі тұрақтылықты қолдаса және бұл қасиет TRUE болса, VPN айқын түрде ажыратылғанша, сілтеме өзгерістері мен үзілістер кезінде қосылып тұруға тырысады.

source: Dictionary of key/value pairs of VPN plugin specific secrets like passwords or private keys. Both keys and values must be strings.
kk: Парольдер немесе жеке кілттер сияқты VPN плагиніне тән құпиялардың кілт/мән жұптарының сөздігі. Кілттер де, мәндер де жолдар болуы керек.

source: D-Bus service name of the VPN plugin that this setting uses to connect to its network. i.e. org.freedesktop.NetworkManager.vpnc for the vpnc plugin.
kk: Осы баптау өз желісіне қосылу үшін қолданатын VPN плагинінің D-Bus қызмет атауы. яғни vpnc плагині үшін org.freedesktop.NetworkManager.vpnc.

source: Timeout for the VPN service to establish the connection. Some services may take quite a long time to connect. Value of 0 means a default timeout, which is 60 seconds (unless overridden by vpn.timeout in configuration file). Values greater than zero mean timeout in seconds.
kk: VPN қызметінің қосылым орнатуы үшін күту уақыты. Кейбір қызметтер қосылу үшін ұзақ уақыт алуы мүмкін. 0 мәні әдепкі күту уақытын білдіреді, ол 60 секунд (конфигурация файлында vpn.timeout арқылы қайта жазылмаса). Нөлден үлкен мәндер секундпен күту уақытын білдіреді.

source: If the VPN connection requires a user name for authentication, that name should be provided here. If the connection is available to more than one user, and the VPN requires each user to supply a different name, then leave this property empty. If this property is empty, NetworkManager will automatically supply the username of the user which requested the VPN connection.
kk: Егер VPN қосылымы аутентификация үшін пайдаланушы атын қажет етсе, сол атты осында беру керек. Егер қосылым бірнеше пайдаланушыға қолжетімді болса және VPN әр пайдаланушының басқа ат беруін талап етсе, онда бұл қасиетті бос қалдырыңыз. Егер бұл қасиет бос болса, NetworkManager VPN қосылымын сұраған пайдаланушының пайдаланушы атын автоматты түрде береді.

source: The routing table for this VRF.
kk: Осы VRF үшін бағыттау кестесі.

source: Specifies the lifetime in seconds of FDB entries learnt by the kernel.
kk: Ядро үйренген FDB жазбаларының өмір сүру ұзақтығын секундпен көрсетеді.

source: Specifies the UDP destination port to communicate to the remote VXLAN tunnel endpoint.
kk: Қашықтағы VXLAN туннель соңғы нүктесімен қосылу үшін UDP тағайындалған портын көрсетеді.

source: Specifies the VXLAN Network Identifier (or VXLAN Segment Identifier) to use.
kk: Қолданылатын VXLAN Желі Идентификаторын (немесе VXLAN Сегмент Идентификаторын) көрсетеді.

source: Specifies whether netlink LL ADDR miss notifications are generated.
kk: Netlink LL ADDR жіберіп алу хабарламалары жасалатынын көрсетеді.

source: Specifies whether netlink IP ADDR miss notifications are generated.
kk: Netlink IP ADDR жіберіп алу хабарламалары жасалатынын көрсетеді.

source: Specifies whether unknown source link layer addresses and IP addresses are entered into the VXLAN device forwarding database.
kk: Белгісіз бастапқы сілтеме деңгейінің адрестері және IP адрестері VXLAN құрылғысын қайта бағыттау дерекқорына енгізілетінін көрсетеді.

source: Specifies the maximum number of FDB entries. A value of zero means that the kernel will store unlimited entries.
kk: FDB жазбаларының максималды санын көрсетеді. Нөлдік мән ядроның шектеусіз жазбаларды сақтайтынын білдіреді.

source: If given, specifies the source IP address to use in outgoing packets.
kk: Берілген болса, шығыс пакеттерде қолданылатын бастапқы IP адресін көрсетеді.

source: If given, specifies the parent interface name or parent connection UUID.
kk: Берілген болса, негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді.

source: Specifies whether ARP proxy is turned on.
kk: ARP проксиінің қосылғанын көрсетеді.

source: Specifies the unicast destination IP address to use in outgoing packets when the destination link layer address is not known in the VXLAN device forwarding database, or the multicast IP address to join.
kk: Тағайындалған сілтеме деңгейінің адресі VXLAN құрылғысын қайта бағыттау дерекқорында белгісіз болған кезде шығыс пакеттерде қолданылатын unicast тағайындалған IP адресін немесе қосылатын мультикаст IP адресін көрсетеді.

source: Specifies whether route short circuit is turned on.
kk: Бағдардың қысқа тұйықталуы қосылғанын көрсетеді.

source: Specifies the maximum UDP source port to communicate to the remote VXLAN tunnel endpoint.
kk: Қашықтағы VXLAN туннель соңғы нүктесімен қосылу үшін максималды UDP бастапқы портын көрсетеді.

source: Specifies the minimum UDP source port to communicate to the remote VXLAN tunnel endpoint.
kk: Қашықтағы VXLAN туннель соңғы нүктесімен қосылу үшін минималды UDP бастапқы портын көрсетеді.

source: Specifies the TOS value to use in outgoing packets.
kk: Шығыс пакеттерде қолданылатын TOS мәнін көрсетеді.

source: Specifies the time-to-live value to use in outgoing packets.
kk: Шығыс пакеттерде қолданылатын time-to-live мәнін көрсетеді.

source: The P2P device that should be connected to. Currently, this is the only way to create or join a group.
kk: Қосылу керек P2P құрылғысы. Қазіргі уақытта бұл топты құрудың немесе оған қосылудың жалғыз жолы.

source: The Wi-Fi Display (WFD) Information Elements (IEs) to set. Wi-Fi Display requires a protocol specific information element to be set in certain Wi-Fi frames. These can be specified here for the purpose of establishing a connection. This setting is only useful when implementing a Wi-Fi Display client.
kk: Орнатылатын Wi-Fi Display (WFD) Ақпарат Элементтері (IEs). Wi-Fi Display белгілі бір Wi-Fi кадрларында хаттамаға тән ақпарат элементінің орнатылуын талап етеді. Бұларды қосылым орнату мақсатында осында көрсетуге болады. Бұл баптау тек Wi-Fi Display клиентін жүзеге асыру кезінде ғана пайдалы.

source: Flags indicating which mode of WPS is to be used. There's little point in changing the default setting as NetworkManager will automatically determine the best method to use.
kk: WPS-тің қай режимі қолданылатынын көрсететін жалаушалар. Әдепкі баптауды өзгертудің қажеті шамалы, өйткені NetworkManager қолдануға ең жақсы әдісті автоматты түрде анықтайды.

source: If specified, this connection will only apply to the WiMAX device whose MAC address matches. This property does not change the MAC address of the device (known as MAC spoofing).
kk: Егер көрсетілсе, бұл қосылым тек MAC адресі сәйкес келетін WiMAX құрылғысына қолданылады. Бұл қасиет құрылғының MAC адресін өзгертпейді (MAC spoofing ретінде белгілі).

source: Network Service Provider (NSP) name of the WiMAX network this connection should use.
kk: Осы қосылым қолдануы керек WiMAX желісінің Желілік Қызмет Провайдері (NSP) аты.

source: When TRUE, setup the interface to accept packets for all MAC addresses. This is enabling the kernel interface flag IFF_PROMISC. When FALSE, the interface will only accept the packets with the interface destination mac address or broadcast.
kk: TRUE болғанда, интерфейсті барлық MAC адрестері үшін пакеттерді қабылдауға орнатыңыз. Бұл IFF_PROMISC ядро интерфейс жалаушасын іске қосады. FALSE болғанда, интерфейс тек интерфейс тағайындалған mac адресі немесе тарату бар пакеттерді қабылдайды.

source: When TRUE, enforce auto-negotiation of speed and duplex mode. If "speed" and "duplex" properties are both specified, only that single mode will be advertised and accepted during the link auto-negotiation process: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabits modes, as in these cases link negotiation is mandatory. When FALSE, "speed" and "duplex" properties should be both set or link configuration will be skipped.
kk: TRUE болғанда, жылдамдық және дуплекс режимінің автокеліссөзін мәжбүрлеңіз. Егер "speed" және "duplex" қасиеттері екеуі де көрсетілсе, сілтеме автокеліссөз процесі кезінде тек сол режим ғана жарияланады және қабылданады: бұл тек BASE-T 802.3 спецификациялары үшін жұмыс істейді және гигабиттік режимдерді мәжбүрлеу үшін пайдалы, өйткені бұл жағдайларда сілтеме келіссөзі міндетті болып табылады. FALSE болғанда, "speed" және "duplex" қасиеттері екеуі де орнатылуы керек немесе сілтеме конфигурациясы өткізіліп жіберіледі.

source: If specified, request that the device use this MAC address instead. This is known as MAC cloning or spoofing. Beside explicitly specifying a MAC address, the special values "preserve", "permanent", "random" and "stable" are supported. "preserve" means not to touch the MAC address on activation. "permanent" means to use the permanent hardware address if the device has one (otherwise this is treated as "preserve"). "random" creates a random MAC address on each connect. "stable" creates a hashed MAC address based on connection.stable-id and a machine dependent key. If unspecified, the value can be overwritten via global defaults, see manual of NetworkManager.conf. If still unspecified, it defaults to "preserve" (older versions of NetworkManager may use a different default value). On D-Bus, this field is expressed as "assigned-mac-address" or the deprecated "cloned-mac-address".
kk: Егер көрсетілсе, құрылғының оның орнына осы MAC адресін қолдануын сұраңыз. Бұл MAC клондау немесе спуфинг ретінде белгілі. MAC адресін айқын көрсетуден басқа, "preserve", "permanent", "random" және "stable" арнайы мәндеріне қолдау көрсетіледі. "preserve" белсендіру кезінде MAC адресіне тиіспеуді білдіреді. "permanent" егер құрылғыда болса, тұрақты аппараттық адресті қолдануды білдіреді (әйтпесе бұл "preserve" ретінде қарастырылады). "random" әр қосылу кезінде кездейсоқ MAC адресін жасайды. "stable" connection.stable-id және машинаға тәуелді кілт негізінде хэштелген MAC адресін жасайды. Егер көрсетілмесе, мән глобалды әдепкілер арқылы қайта жазылуы мүмкін, NetworkManager.conf нұсқаулығын қараңыз. Егер әлі көрсетілмесе, ол әдепкі бойынша "preserve" болады (NetworkManager ескі нұсқалары басқа әдепкі мәнді қолдануы мүмкін). D-Bus-та бұл өріс "assigned-mac-address" немесе ескірген "cloned-mac-address" ретінде көрсетіледі.

source: When a value is set, either "half" or "full", configures the device to use the specified duplex mode. If "auto-negotiate" is "yes" the specified duplex mode will be the only one advertised during link negotiation: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabits modes, as in these cases link negotiation is mandatory. If the value is unset (the default), the link configuration will be either skipped (if "auto-negotiate" is "no", the default) or will be auto-negotiated (if "auto-negotiate" is "yes") and the local device will advertise all the supported duplex modes. Must be set together with the "speed" property if specified. Before specifying a duplex mode be sure your device supports it.
kk: Мән орнатылған кезде, "half" немесе "full", құрылғыны көрсетілген дуплекс режимін қолдануға баптайды. Егер "auto-negotiate" "yes" болса, көрсетілген дуплекс режимі сілтеме келіссөзі кезінде жарияланатын жалғыз режим болады: бұл тек BASE-T 802.3 спецификациялары үшін жұмыс істейді және гигабиттік режимдерді мәжбүрлеу үшін пайдалы, өйткені бұл жағдайларда сілтеме келіссөзі міндетті болып табылады. Егер мән орнатылмаған болса (әдепкі), сілтеме конфигурациясы не өткізіліп жіберіледі (егер "auto-negotiate" "no" болса, әдепкі) немесе автокеліссөз жүргізіледі (егер "auto-negotiate" "yes" болса) және жергілікті құрылғы барлық қолдау көрсетілетін дуплекс режимдерін жариялайды. Егер көрсетілсе, "speed" қасиетімен бірге орнатылуы керек. Дуплекс режимін көрсетпес бұрын құрылғыңыздың оны қолдайтынына көз жеткізіңіз.

source: With "cloned-mac-address" setting "random" or "stable", by default all bits of the MAC address are scrambled and a locally-administered, unicast MAC address is created. This property allows one to specify that certain bits are fixed. Note that the least significant bit of the first MAC address will always be unset to create a unicast MAC address. If the property is NULL, it is eligible to be overwritten by a default connection setting. If the value is still NULL or an empty string, the default is to create a locally-administered, unicast MAC address. If the value contains one MAC address, this address is used as mask. The set bits of the mask are to be filled with the current MAC address of the device, while the unset bits are subject to randomization. Setting "FE:FF:FF:00:00:00" means to preserve the OUI of the current MAC address and only randomize the lower 3 bytes using the "random" or "stable" algorithm. If the value contains one additional MAC address after the mask, this address is used instead of the current MAC address to fill the bits that shall not be randomized. For example, a value of "FE:FF:FF:00:00:00 68:F7:28:00:00:00" will set the OUI of the MAC address to 68:F7:28, while the lower bits are randomized. A value of "02:00:00:00:00:00 00:00:00:00:00:00" will create a fully scrambled globally-administered, burned-in MAC address. If the value contains more than one additional MAC addresses, one of them is chosen randomly. For example, "02:00:00:00:00:00 00:00:00:00:00:00 02:00:00:00:00:00" will create a fully scrambled MAC address, randomly locally or globally administered.
kk: "cloned-mac-address" баптауы "random" немесе "stable" болғанда, әдепкі бойынша MAC адресінің барлық биттері араластырылады және жергілікті басқарылатын, unicast MAC адресі жасалады. Бұл қасиет белгілі бір биттердің бекітілгенін көрсетуге мүмкіндік береді. Ескеріңіз, unicast MAC адресін жасау үшін бірінші MAC адресінің ең аз мәнді биті әрқашан орнатылмаған күйде болады. Егер қасиет NULL болса, ол әдепкі қосылым баптауымен қайта жазылуға жарамды. Егер мән әлі де NULL немесе бос жол болса, әдепкі әрекет — жергілікті басқарылатын, unicast MAC адресін жасау. Егер мән бір MAC адресін қамтыса, бұл адрес маска ретінде қолданылады. Масканың орнатылған биттері құрылғының ағымдағы MAC адресімен толтырылады, ал орнатылмаған биттер рандомизацияға ұшырайды. "FE:FF:FF:00:00:00" орнату ағымдағы MAC адресінің OUI-ін сақтауды және "random" немесе "stable" алгоритмін қолданып тек төменгі 3 байтты рандомизациялауды білдіреді. Егер мән маскадан кейін бір қосымша MAC адресін қамтыса, бұл адрес рандомизацияланбауы тиіс биттерді толтыру үшін ағымдағы MAC адресінің орнына қолданылады. Мысалы, "FE:FF:FF:00:00:00 68:F7:28:00:00:00" мәні MAC адресінің OUI-ін 68:F7:28 етіп орнатады, ал төменгі биттер рандомизацияланады. "02:00:00:00:00:00 00:00:00:00:00:00" мәні толығымен араластырылған глобалды басқарылатын, күйдірілген MAC адресін жасайды. Егер мән бірнеше қосымша MAC адрестерін қамтыса, олардың біреуі кездейсоқ таңдалады. Мысалы, "02:00:00:00:00:00 00:00:00:00:00:00 02:00:00:00:00:00" кездейсоқ жергілікті немесе глобалды басқарылатын толығымен араластырылған MAC адресін жасайды.

source: If specified, this connection will only apply to the Ethernet device whose permanent MAC address matches. This property does not change the MAC address of the device (i.e. MAC spoofing).
kk: Егер көрсетілсе, бұл қосылым тек тұрақты MAC адресі сәйкес келетін Ethernet құрылғысына қолданылады. Бұл қасиет құрылғының MAC адресін өзгертпейді (яғни, MAC spoofing).

source: If specified, this connection will never apply to the Ethernet device whose permanent MAC address matches an address in the list. Each MAC address is in the standard hex-digits-and-colons notation (00:11:22:33:44:55).
kk: Егер көрсетілсе, бұл қосылым тұрақты MAC адресі тізімдегі адреске сәйкес келетін Ethernet құрылғысына ешқашан қолданылмайды. Әр MAC адрес стандартты он алтылық цифрлар мен қос нүктелер нотациясында (00:11:22:33:44:55) болады.

source: If non-zero, only transmit packets of the specified size or smaller, breaking larger packets up into multiple Ethernet frames.
kk: Егер нөл болмаса, тек көрсетілген өлшемдегі немесе одан кіші пакеттерді жібереді, үлкен пакеттерді бірнеше Ethernet кадрларына бөледі.

source: Specific port type to use if the device supports multiple attachment methods. One of "tp" (Twisted Pair), "aui" (Attachment Unit Interface), "bnc" (Thin Ethernet) or "mii" (Media Independent Interface). If the device supports only one port type, this setting is ignored.
kk: Егер құрылғы бірнеше тіркеу әдістерін қолдаса, қолданылатын арнайы порт түрі. "tp" (Бұралған жұп), "aui" (Тіркеу Құрылғысының Интерфейсі), "bnc" (Жіңішке Ethernet) немесе "mii" (Медиа Тәуелсіз Интерфейс) біреуі. Егер құрылғы тек бір порт түрін қолдаса, бұл баптау еленбейді.

source: s390 network device type; one of "qeth", "lcs", or "ctc", representing the different types of virtual network devices available on s390 systems.
kk: s390 желілік құрылғы түрі; "qeth", "lcs" немесе "ctc" біреуі, s390 жүйелерінде қолжетімді виртуалды желілік құрылғылардың әртүрлі түрлерін білдіреді.

source: Dictionary of key/value pairs of s390-specific device options. Both keys and values must be strings. Allowed keys include "portno", "layer2", "portname", "protocol", among others. Key names must contain only alphanumeric characters (ie, [a-zA-Z0-9]). Currently, NetworkManager itself does nothing with this information. However, s390utils ships a udev rule which parses this information and applies it to the interface.
kk: s390-ға тән құрылғы опцияларының кілт/мән жұптарының сөздігі. Кілттер де, мәндер де жолдар болуы керек. Рұқсат етілген кілттерге "portno", "layer2", "portname", "protocol" және басқалары кіреді. Кілт атаулары тек әріптік-сандық таңбалардан (яғни, [a-zA-Z0-9]) тұруы керек. Қазіргі уақытта NetworkManager бұл ақпаратпен ештеңе істемейді. Алайда, s390utils бұл ақпаратты талдайтын және оны интерфейске қолданатын udev ережесін ұсынады.
