Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Usage: nmcli connection show { ARGUMENTS | help } ARGUMENTS := [--active] [--order <order spec>] List in-memory and on-disk connection profiles, some of which may also be active if a device is using that connection profile. Without a parameter, all profiles are listed. When --active option is specified, only the active profiles are shown. --order allows custom connection ordering (see manual page). ARGUMENTS := [--active] [id | uuid | path | apath] <ID> ... Show details for specified connections. By default, both static configuration and active connection data are displayed. It is possible to filter the output using global '--fields' option. Refer to the manual page for more information. When --active option is specified, only the active profiles are taken into account. Use global --show-secrets option to reveal associated secrets as well.
kk: Қолданылуы: nmcli connection show { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [--active] [--order <тәртіп спецификациясы>] Жадтағы және дискідегі қосылым профильдерін тізімдейді, егер құрылғы сол қосылым профилін қолданып тұрса, олардың кейбіреулері белсенді болуы мүмкін. Параметрсіз, барлық профильдер тізімделеді. --active опциясы көрсетілген кезде, тек белсенді профильдер көрсетіледі. --order пайдаланушылық қосылым тәртібіне мүмкіндік береді (нұсқаулықты қараңыз). АРГУМЕНТТЕР := [--active] [id | uuid | path | apath] <ID> ... Көрсетілген қосылымдар үшін мәліметтерді көрсету. Әдепкі бойынша, статикалық конфигурация және белсенді қосылым деректері көрсетіледі. Шығысты глобалды '--fields' опциясын қолданып сүзгілеуге болады. Толығырақ ақпарат алу үшін нұсқаулықты қараңыз. --active опциясы көрсетілген кезде, тек белсенді профильдер есепке алынады. Қосылымды құпияларды ашу үшін глобалды --show-secrets опциясын қолданыңыз.

source: Usage: nmcli connection up { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> [ifname <ifname>] [ap <BSSID>] [nsp <name>] [passwd-file <file with passwords>] Activate a connection on a device. The profile to activate is identified by its name, UUID or D-Bus path. ARGUMENTS := ifname <ifname> [ap <BSSID>] [nsp <name>] [passwd-file <file with passwords>] Activate a device with a connection. The connection profile is selected automatically by NetworkManager. ifname - specifies the device to active the connection on ap - specifies AP to connect to (only valid for Wi-Fi) nsp - specifies NSP to connect to (only valid for WiMAX) passwd-file - file with password(s) required to activate the connection
kk: Қолданылуы: nmcli connection up { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID> [ifname <интерфейс аты>] [ap <BSSID>] [nsp <аты>] [passwd-file <парольдер бар файл>] Құрылғыда қосылымды белсендіру. Белсендірілетін профиль оның аты, UUID немесе D-Bus жолы арқылы анықталады. АРГУМЕНТТЕР := ifname <интерфейс аты> [ap <BSSID>] [nsp <аты>] [passwd-file <парольдер бар файл>] Құрылғыда қосылымды белсендіру. Қосылым профилі NetworkManager тарапынан автоматты түрде таңдалады. ifname - қосылымды белсендіретін құрылғыны көрсетеді ap - қосылатын AP көрсетеді (тек Wi-Fi үшін жарамды) nsp - қосылатын NSP көрсетеді (тек WiMAX үшін жарамды) passwd-file - қосылымды белсендіру үшін қажетті пароль(дер) бар файл

source: Usage: nmcli connection down { ARGUMENTS | help } ARGUMENTS := [id | uuid | path | apath] <ID> ... Deactivate a connection from a device (without preventing the device from further auto-activation). The profile to deactivate is identified by its name, UUID or D-Bus path.
kk: Қолданылуы: nmcli connection down { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path | apath] <ID> ... Қосылымды құрылғыдан сөндіру (құрылғының әрі қарай автоматты белсендірілуіне жол бермей). Сөндірілетін профиль оның аты, UUID немесе D-Bus жолы арқылы анықталады.

source: Usage: nmcli connection add { ARGUMENTS | help } ARGUMENTS := COMMON_OPTIONS TYPE_SPECIFIC_OPTIONS PORT_OPTIONS IP_OPTIONS [-- ([+|-]<setting>.<property> <value>)+] COMMON_OPTIONS: type <type> [ifname <interface name> | "*"] [con-name <connection name>] [autoconnect yes|no] [save yes|no] [controller <controller (ifname, or connection UUID or name)>] [port-type <controller connection type>] TYPE_SPECIFIC_OPTIONS: ethernet: [mac <MAC address>] [cloned-mac <cloned MAC address>] [mtu <MTU>] wifi: ssid <SSID> [mac <MAC address>] [cloned-mac <cloned MAC address>] [mtu <MTU>] [mode infrastructure|ap|adhoc] wimax: [mac <MAC address>] [nsp <NSP>] pppoe: username <PPPoE username> [password <PPPoE password>] [service <PPPoE service name>] [mtu <MTU>] [mac <MAC address>] gsm: apn <APN> [user <username>] [password <password>] cdma: [user <username>] [password <password>] infiniband: [mac <MAC address>] [mtu <MTU>] [transport-mode datagram | connected] [parent <ifname>] [p-key <IPoIB P_Key>] bluetooth: [addr <bluetooth address>] [bt-type panu|nap|dun-gsm|dun-cdma] vlan: dev <parent device (connection UUID, ifname, or MAC)> id <VLAN ID> [flags <VLAN flags>] [ingress <ingress priority mapping>] [egress <egress priority mapping>] [mtu <MTU>] bond: [mode balance-rr (0) | active-backup (1) | balance-xor (2) | broadcast (3) | 802.3ad (4) | balance-tlb (5) | balance-alb (6)] [primary <ifname>] [miimon <num>] [downdelay <num>] [updelay <num>] [arp-interval <num>] [arp-ip-target <num>] [lacp-rate slow (0) | fast (1)] bond-slave: controller <controller (ifname, or connection UUID or name)> [queue-id <0-65535>] team: [config <file>|<raw JSON data>] team-slave: controller <controller (ifname, or connection UUID or name)> [config <file>|<raw JSON data>] bridge: [stp yes|no] [priority <num>] [forward-delay <2-30>] [hello-time <1-10>] [max-age <6-40>] [ageing-time <0-1000000>] [multicast-snooping yes|no] [mac <MAC address>] bridge-slave: controller <controller (ifname, or connection UUID or name)> [priority <0-63>] [path-cost <1-65535>] [hairpin yes|no] vpn: vpn-type vpnc|openvpn|pptp|openconnect|openswan|libreswan|ssh|l2tp|iodine|... [user <username>] olpc-mesh: ssid <SSID> [channel <1-13>] [dhcp-anycast <MAC address>] adsl: username <username> protocol pppoa|pppoe|ipoatm [password <password>] [encapsulation vcmux|llc] tun: mode tun|tap [owner <UID>] [group <GID>] [pi yes|no] [vnet-hdr yes|no] [multi-queue yes|no] ip-tunnel: mode ipip|gre|sit|isatap|vti|ip6ip6|ipip6|ip6gre|vti6 remote <remote endpoint IP> [local <local endpoint IP>] [dev <parent device (ifname or connection UUID)>] macsec: dev <parent device (connection UUID, ifname, or MAC)> mode <psk|eap> [cak <key> ckn <key>] [encrypt yes|no] [port 1-65534] macvlan: dev <parent device (connection UUID, ifname, or MAC)> mode vepa|bridge|private|passthru|source [tap yes|no] vxlan: id <VXLAN ID> [remote <IP of multicast group or remote address>] [local <source IP>] [dev <parent device (ifname or connection UUID)>] [source-port-min <0-65535>] [source-port-max <0-65535>] [destination-port <0-65535>] wpan: [short-addr <0x0000-0xffff>] [pan-id <0x0000-0xffff>] [page <default|0-31>] [channel <default|0-26>] [mac <MAC address>] 6lowpan: dev <parent device (connection UUID, ifname, or MAC)> dummy: PORT_OPTIONS: bridge: [priority <0-63>] [path-cost <1-65535>] [hairpin yes|no] team: [config <file>|<raw JSON data>] bond: [queue-id <0-65535>] IP_OPTIONS: [ip4 <IPv4 address>] [gw4 <IPv4 gateway>] [ip6 <IPv6 address>] [gw6 <IPv6 gateway>]
kk: Қолданылуы: nmcli connection add { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := ОРТАҚ_ОПЦИЯЛАР ТҮРГЕ_ТӘН_ОПЦИЯЛАР ПОРТ_ОПЦИЯЛАРЫ IP_ОПЦИЯЛАРЫ [-- ([+|-]<баптау>.<қасиет> <мән>)+] ОРТАҚ_ОПЦИЯЛАР: type <түрі> [ifname <интерфейс аты> | "*"] [con-name <қосылым аты>] [autoconnect yes|no] [save yes|no] [controller <контроллер (интерфейс аты, немесе қосылым UUID немесе аты)>] [port-type <контроллер қосылым түрі>] ТҮРГЕ_ТӘН_ОПЦИЯЛАР: ethernet: [mac <MAC адрес>] [cloned-mac <клондалған MAC адрес>] [mtu <MTU>] wifi: ssid <SSID> [mac <MAC адрес>] [cloned-mac <клондалған MAC адрес>] [mtu <MTU>] [mode infrastructure|ap|adhoc] wimax: [mac <MAC адрес>] [nsp <NSP>] pppoe: username <PPPoE пайдаланушы аты> [password <PPPoE паролі>] [service <PPPoE қызмет аты>] [mtu <MTU>] [mac <MAC адрес>] gsm: apn <APN> [user <пайдаланушы аты>] [password <пароль>] cdma: [user <пайдаланушы аты>] [password <пароль>] infiniband: [mac <MAC адрес>] [mtu <MTU>] [transport-mode datagram | connected] [parent <интерфейс аты>] [p-key <IPoIB P_Key>] bluetooth: [addr <bluetooth адресі>] [bt-type panu|nap|dun-gsm|dun-cdma] vlan: dev <негізгі құрылғы (қосылым UUID, интерфейс аты, немесе MAC)> id <VLAN ID> [flags <VLAN жалаушалары>] [ingress <кіріс басымдық сәйкестендіруі>] [egress <шығыс басымдық сәйкестендіруі>] [mtu <MTU>] bond: [mode balance-rr (0) | active-backup (1) | balance-xor (2) | broadcast (3) | 802.3ad (4) | balance-tlb (5) | balance-alb (6)] [primary <интерфейс аты>] [miimon <сан>] [downdelay <сан>] [updelay <сан>] [arp-interval <сан>] [arp-ip-target <сан>] [lacp-rate slow (0) | fast (1)] bond-slave: controller <контроллер (интерфейс аты, немесе қосылым UUID немесе аты)> [queue-id <0-65535>] team: [config <файл>|<шикі JSON деректері>] team-slave: controller <контроллер (интерфейс аты, немесе қосылым UUID немесе аты)> [config <файл>|<шикі JSON деректері>] bridge: [stp yes|no] [priority <сан>] [forward-delay <2-30>] [hello-time <1-10>] [max-age <6-40>] [ageing-time <0-1000000>] [multicast-snooping yes|no] [mac <MAC адрес>] bridge-slave: controller <контроллер (интерфейс аты, немесе қосылым UUID немесе аты)> [priority <0-63>] [path-cost <1-65535>] [hairpin yes|no] vpn: vpn-type vpnc|openvpn|pptp|openconnect|openswan|libreswan|ssh|l2tp|iodine|... [user <пайдаланушы аты>] olpc-mesh: ssid <SSID> [channel <1-13>] [dhcp-anycast <MAC адрес>] adsl: username <пайдаланушы аты> protocol pppoa|pppoe|ipoatm [password <пароль>] [encapsulation vcmux|llc] tun: mode tun|tap [owner <UID>] [group <GID>] [pi yes|no] [vnet-hdr yes|no] [multi-queue yes|no] ip-tunnel: mode ipip|gre|sit|isatap|vti|ip6ip6|ipip6|ip6gre|vti6 remote <қашықтағы соңғы нүкте IP> [local <жергілікті соңғы нүкте IP>] [dev <негізгі құрылғы (интерфейс аты немесе қосылым UUID)>] macsec: dev <негізгі құрылғы (қосылым UUID, интерфейс аты, немесе MAC)> mode <psk|eap> [cak <кілт> ckn <кілт>] [encrypt yes|no] [port 1-65534] macvlan: dev <негізгі құрылғы (қосылым UUID, интерфейс аты, немесе MAC)> mode vepa|bridge|private|passthru|source [tap yes|no] vxlan: id <VXLAN ID> [remote <мультикаст тобының IP немесе қашықтағы адрес>] [local <бастапқы IP>] [dev <негізгі құрылғы (интерфейс аты немесе қосылым UUID)>] [source-port-min <0-65535>] [source-port-max <0-65535>] [destination-port <0-65535>] wpan: [short-addr <0x0000-0xffff>] [pan-id <0x0000-0xffff>] [page <default|0-31>] [channel <default|0-26>] [mac <MAC адрес>] 6lowpan: dev <негізгі құрылғы (қосылым UUID, интерфейс аты, немесе MAC)> dummy: ПОРТ_ОПЦИЯЛАРЫ: bridge: [priority <0-63>] [path-cost <1-65535>] [hairpin yes|no] team: [config <файл>|<шикі JSON деректері>] bond: [queue-id <0-65535>] IP_ОПЦИЯЛАРЫ: [ip4 <IPv4 адрес>] [gw4 <IPv4 шлюз>] [ip6 <IPv6 адрес>] [gw6 <IPv6 шлюз>]

source: Usage: nmcli connection modify { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> ([+|-]<setting>.<property> <value>)+ Modify one or more properties of the connection profile. The profile is identified by its name, UUID or D-Bus path. For multi-valued properties you can use optional '+' or '-' prefix to the property name. The '+' sign allows appending items instead of overwriting the whole value. The '-' sign allows removing selected items instead of the whole value. ARGUMENTS := remove <setting> Remove a setting from the connection profile. Examples: nmcli con mod home-wifi wifi.ssid rakosnicek nmcli con mod em1-1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli con mod em1-1 +ipv4.dns 8.8.4.4 nmcli con mod em1-1 -ipv4.dns 1 nmcli con mod em1-1 -ipv6.addr "abbe::cafe/56" nmcli con mod bond0 +bond.options mii=500 nmcli con mod bond0 -bond.options downdelay nmcli con mod em1-1 remove sriov
kk: Қолданылуы: nmcli connection modify { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID> ([+|-]<баптау>.<қасиет> <мән>)+ Қосылым профилінің бір немесе бірнеше қасиеттерін өзгерту. Профиль оның аты, UUID немесе D-Bus жолы арқылы анықталады. Көп мәнді қасиеттер үшін қасиет атына міндетті емес '+' немесе '-' префиксін қолдана аласыз. '+' белгісі бүкіл мәнді қайта жазудың орнына элементтерді қосуға мүмкіндік береді. '-' белгісі бүкіл мәннің орнына таңдалған элементтерді өшіруге мүмкіндік береді. АРГУМЕНТТЕР := remove <баптау> Қосылым профилінен баптауды өшіру. Мысалдар: nmcli con mod home-wifi wifi.ssid rakosnicek nmcli con mod em1-1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli con mod em1-1 +ipv4.dns 8.8.4.4 nmcli con mod em1-1 -ipv4.dns 1 nmcli con mod em1-1 -ipv6.addr "abbe::cafe/56" nmcli con mod bond0 +bond.options mii=500 nmcli con mod bond0 -bond.options downdelay nmcli con mod em1-1 remove sriov

source: Usage: nmcli connection clone { ARGUMENTS | help } ARGUMENTS := [--temporary] [id | uuid | path] <ID> <new name> Clone an existing connection profile. The newly created connection will be the exact copy of the <ID>, except the uuid property (will be generated) and id (provided as <new name> argument).
kk: Қолданылуы: nmcli connection clone { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [--temporary] [id | uuid | path] <ID> <жаңа аты> Бар қосылым профилін клондау. Жаңадан жасалған қосылым <ID> дәл көшірмесі болады, тек uuid қасиеті (жасалады) және id (<жаңа аты> аргументі ретінде беріледі) қоспағанда.

source: Usage: nmcli connection edit { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> Edit an existing connection profile in an interactive editor. The profile is identified by its name, UUID or D-Bus path ARGUMENTS := [type <new connection type>] [con-name <new connection name>] Add a new connection profile in an interactive editor.
kk: Қолданылуы: nmcli connection edit { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID> Бар қосылым профилін интерактивті редакторда түзету. Профиль оның аты, UUID немесе D-Bus жолы арқылы анықталады АРГУМЕНТТЕР := [type <жаңа қосылым түрі>] [con-name <жаңа қосылым аты>] Интерактивті редакторда жаңа қосылым профилін қосу.

source: Usage: nmcli connection delete { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID>, ... Delete connection profiles. The profiles are identified by their name, UUID or D-Bus path.
kk: Қолданылуы: nmcli connection delete { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID>, ... Қосылым профильдерін өшіру. Профильдер олардың аты, UUID немесе D-Bus жолы арқылы анықталады.

source: Usage: nmcli connection monitor { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> ... Monitor connection profile activity. This command prints a line whenever the specified connection changes. Monitors all connection profiles in case none is specified.
kk: Қолданылуы: nmcli connection monitor { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID> ... Қосылым профилінің белсенділігін бақылау. Бұл команда көрсетілген қосылым өзгерген сайын жолды басып шығарады. Ешқайсысы көрсетілмеген жағдайда барлық қосылым профильдерін бақылайды.

source: Usage: nmcli connection reload { help } Reload all connection files from disk.
kk: Қолданылуы: nmcli connection reload { help } Дискіден барлық қосылым файлдарын қайта жүктеу.

source: Usage: nmcli connection load { ARGUMENTS | help } ARGUMENTS := <filename> [<filename>...] Load/reload one or more connection files from disk. Use this after manually editing a connection file to ensure that NetworkManager is aware of its latest state.
kk: Қолданылуы: nmcli connection load { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := <файл аты> [<файл аты>...] Дискіден бір немесе бірнеше қосылым файлдарын жүктеу/қайта жүктеу. NetworkManager соңғы күйінен хабардар болуын қамтамасыз ету үшін қосылым файлын қолмен түзеткеннен кейін мұны қолданыңыз.

source: Usage: nmcli connection import { ARGUMENTS | help } ARGUMENTS := [--temporary] type <type> file <file to import> Import an external/foreign configuration as a NetworkManager connection profile. The type of the input file is specified by type option. Only VPN configurations are supported at the moment. The configuration is imported by NetworkManager VPN plugins.
kk: Қолданылуы: nmcli connection import { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [--temporary] type <түрі> file <импортталатын файл> Сыртқы/бөтен конфигурацияны NetworkManager қосылым профилі ретінде импорттау. Кіріс файлының түрі type опциясы арқылы көрсетіледі. Қазіргі уақытта тек VPN конфигурацияларына қолдау көрсетіледі. Конфигурация NetworkManager VPN плагиндерімен импортталады.

source: Usage: nmcli connection export { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> [<output file>] Export a connection. Only VPN connections are supported at the moment. The data are directed to standard output or to a file if a name is given.
kk: Қолданылуы: nmcli connection export { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [id | uuid | path] <ID> [<шығыс файл>] Қосылымды экспорттау. Қазіргі уақытта тек VPN қосылымдарына қолдау көрсетіледі. Деректер стандартты шығысқа немесе егер аты берілсе файлға бағытталады.

source: Usage: nmcli connection migrate { ARGUMENTS | help } ARGUMENTS := [--plugin <plugin>] [id | uuid | path] <ID>, ... Migrate connection profiles to a different settings plugin, such as "keyfile" (default) or "ifcfg-rh".
kk: Қолданылуы: nmcli connection migrate { АРГУМЕНТТЕР | help } АРГУМЕНТТЕР := [--plugin <плагин>] [id | uuid | path] <ID>, ... Қосылым профильдерін "keyfile" (әдепкі) немесе "ifcfg-rh" сияқты басқа баптаулар плагиніне көшіру.

source: Error updating secrets for %s: %s
kk: %s үшін құпияларды жаңарту қатесі: %s

source: Connection profile details
kk: Қосылым профилінің мәліметтері

source: Error: 'connection show': %s
kk: Қате: 'connection show': %s

source: Active connection details
kk: Белсенді қосылым мәліметтері

source: NAME
kk: АТЫ

source: invalid field '%s'; allowed fields: %s and %s, or %s,%s
kk: жарамсыз өріс '%s'; рұқсат етілген өрістер: %s және %s, немесе %s,%s

source: '%s' has to be alone
kk: '%s' жалғыз болуы керек

source: incorrect string '%s' of '--order' option
kk: '--order' опциясының дұрыс емес жолы '%s'

source: incorrect item '%s' in '--order' option
kk: '--order' опциясындағы дұрыс емес элемент '%s'

source: No connection specified
kk: Ешқандай қосылым көрсетілмеген

source: %s argument is missing
kk: %s аргументі жетіспейді

source: unknown connection '%s'
kk: белгісіз қосылым '%s'

source: '--order' argument is missing
kk: '--order' аргументі жетіспейді

source: NetworkManager active profiles
kk: NetworkManager белсенді профильдері

source: NetworkManager connection profiles
kk: NetworkManager қосылым профильдері

source: Error: %s argument is missing.
kk: Қате: %s аргументі жетіспейді.

source: Error: %s - no such connection profile.
kk: Қате: %s - ондай қосылым профилі жоқ.

source: Error: %s.
kk: Қате: %s.

source: no active connection on device '%s'
kk: '%s' құрылғысында белсенді қосылым жоқ

source: no active connection or device
kk: белсенді қосылым немесе құрылғы жоқ

source: device '%s' not compatible with connection '%s':
kk: '%s' құрылғысы '%s' қосылымымен үйлесімді емес:

source: device '%s' not compatible with connection '%s'
kk: '%s' құрылғысы '%s' қосылымымен үйлесімді емес

source: device '%s' not found for connection '%s'
kk: '%s' құрылғысы '%s' қосылымы үшін табылмады

source: no device found for connection '%s'
kk: '%s' қосылымы үшін құрылғы табылмады

source: Hint: use '%s' to get more details.
kk: Кеңес: толығырақ мәлімет алу үшін '%s' қолданыңыз.

source: Connection successfully activated (%s) (D-Bus active path: %s)
kk: Қосылым сәтті белсендірілді (%s) (D-Bus белсенді жолы: %s)

source: Connection successfully activated (D-Bus active path: %s)
kk: Қосылым сәтті белсендірілді (D-Bus белсенді жолы: %s)

source: Error: Connection activation failed: %s
kk: Қате: Қосылымды белсендіру сәтсіз аяқталды: %s

source: Error: Timeout expired (%d seconds)
kk: Қате: Күту уақыты өтті (%d секунд)

source: unknown device '%s'.
kk: белгісіз құрылғы '%s'.

source: neither a valid connection nor device given
kk: жарамды қосылым та, құрылғы да берілмеген

source: invalid passwd-file '%s' at line %zd: %s
kk: жарамсыз passwd-file '%s', %zd жолында: %s

source: invalid passwd-file '%s': %s
kk: жарамсыз passwd-file '%s': %s

source: Error: invalid extra argument '%s'.
kk: Қате: жарамсыз қосымша аргумент '%s'.

source: preparing
kk: дайындалуда

source: Connection '%s' (%s) successfully deleted.
kk: '%s' (%s) қосылымы сәтті өшірілді.

source: Connection '%s' successfully deactivated (D-Bus active path: %s)
kk: '%s' қосылымы сәтті сөндірілді (D-Bus белсенді жолы: %s)

source: Error: No connection specified.
kk: Қате: Ешқандай қосылым көрсетілмеген.

source: Error: '%s' is not an active connection.
kk: Қате: '%s' белсенді қосылым емес.

source: Error: not all active connections found.
kk: Қате: барлық белсенді қосылымдар табылмады.

source: Error: no active connection provided.
kk: Қате: белсенді қосылым берілмеген.

source: Connection '%s' deactivation failed: %s
kk: '%s' қосылымын сөндіру сәтсіз аяқталды: %s

source: Warning: controller '%s' doesn't refer to any existing profile of type '%s'.
kk: Ескерту: '%s' контроллері '%s' түріндегі ешқандай бар профильге сілтемейді.

source: Error: invalid property '%s': %s.
kk: Қате: жарамсыз қасиет '%s': %s.

source: Error: failed to modify %s.%s: %s.
kk: Қате: %s.%s өзгерту сәтсіз аяқталды: %s.

source: Error: failed to remove a value from %s.%s: %s.
kk: Қате: %s.%s ішінен мәнді өшіру сәтсіз аяқталды: %s.

source: Error: invalid port type; %s.
kk: Қате: порт түрі жарамсыз; %s.

source: Error: invalid connection type; %s.
kk: Қате: қосылым түрі жарамсыз; %s.

source: Error: bad connection type: %s
kk: Қате: қосылым түрі жарамсыз: %s

source: Error: controller is required
kk: Қате: контроллер қажет

source: Error: '%s' is not a valid monitoring mode; use '%s' or '%s'.
kk: Қате: '%s' - жарамды бақылау режимі емес; '%s' немесе '%s' қолданыңыз.

source: Error: 'bt-type': '%s' not valid; use [%s, %s, %s (%s), %s].
kk: Қате: 'bt-type': '%s' жарамсыз; [%s, %s, %s (%s), %s] қолданыңыз.

source: Error: setting '%s' is mandatory and cannot be removed.
kk: Қате: '%s' баптауы міндетті және оны өшіруге болмайды.

source: Error: value for '%s' is missing.
kk: Қате: '%s' үшін мән жетіспейді.

source: Error: missing setting.
kk: Қате: баптау жетіспейді.

source: Error: invalid setting argument '%s'.
kk: Қате: баптау аргументі жарамсыз '%s'.

source: port connections cannot have IP configuration
kk: порт қосылымдарында IP конфигурациясы бола алмайды

source: Error: invalid or not allowed setting '%s': %s.
kk: Қате: жарамсыз немесе рұқсат етілмеген баптау '%s': %s.

source: Error: '%s' is ambiguous (%s.%s or %s.%s).
kk: Қате: '%s' екіұшты (%s.%s немесе %s.%s).

source: Error: invalid <setting>.<property> '%s'.
kk: Қате: жарамсыз <setting>.<property> '%s'.

source: Warning: %s.
kk: Ескерту: %s.

source: Warning: There is another connection with the name '%1$s'. Reference the connection by its uuid '%2$s'
kk: Ескерту: '%1$s' атымен басқа %3$u қосылым бар. Қосылымға сілтеме жасау үшін оның '%2$s' uuid-ын қолданыңыз

source: Error: Failed to add '%s' connection: %s
kk: Қате: '%s' қосылымын қосу сәтсіз аяқталды: %s

source: Connection '%s' (%s) successfully added.
kk: '%s' (%s) қосылымы сәтті қосылды.

source: You can specify this option more than once. Press <Enter> when you're done.
kk: Бұл опцияны бірнеше рет көрсетуге болады. Аяқтаған кезде <Enter> басыңыз.

source: There are %d optional settings for %s.
kk: %d қосымша баптау (%s үшін) бар.

source: Do you want to provide them? %s
kk: Оларды ұсынғыңыз келе ме? %s

source: Error: argument '--' can only be passed once
kk: Қате: '--' аргументін тек бір рет өткізуге болады
