Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Contains the path to the "phase 2" CA certificate if used by the EAP method specified in the 802-1x.phase2-auth or 802-1x.phase2-autheap properties. This property can be unset even if the EAP method supports CA certificates, but this allows man-in-the-middle attacks and is NOT recommended. Note that enabling 802-1x.system-ca-certs will override this setting to use the built-in path, if the built-in path is not a directory.
kk: Егер 802-1x.phase2-auth немесе 802-1x.phase2-autheap қасиеттерінде көрсетілген EAP әдісі қолданса, "2-кезең" CA сертификатына жолды қамтиды. Бұл қасиет EAP әдісі CA сертификаттарын қолдаса да орнатылмауы мүмкін, бірақ бұл man-in-the-middle шабуылдарына жол береді және ұсынылмайды. Ескеріңіз, 802-1x.system-ca-certs іске қосу, егер кірістірілген жол бума болмаса, кірістірілген жолды қолдану үшін осы баптауды қайта жазады.

source: The password used to access the "phase2" CA certificate stored in "phase2-ca-cert" property. Only makes sense if the certificate is stored on a PKCS#11 token that requires a login.
kk: "phase2-ca-cert" қасиетінде сақталған "phase2" CA сертификатына қол жеткізу үшін қолданылатын пароль. Тек сертификат кіруді қажет ететін PKCS#11 токенінде сақталған жағдайда ғана мағынасы бар.

source: Flags indicating how to handle the "phase2-ca-cert-password" property.
kk: "phase2-ca-cert-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: UTF-8 encoded path to a directory containing PEM or DER formatted certificates to be added to the verification chain in addition to the certificate specified in the "phase2-ca-cert" property. If NMSetting8021x:system-ca-certs is enabled and the built-in CA path is an existing directory, then this setting is ignored.
kk: "phase2-ca-cert" қасиетінде көрсетілген сертификатқа қосымша тексеру тізбегіне қосылатын PEM немесе DER пішімделген сертификаттары бар бумаға UTF-8 кодталған жол. Егер NMSetting8021x:system-ca-certs іске қосылған болса және кірістірілген CA жолы бар бума болса, онда бұл баптау еленбейді.

source: Contains the path to the "phase 2" client certificate if used by the EAP method specified in the 802-1x.phase2-auth or 802-1x.phase2-autheap properties.
kk: Егер 802-1x.phase2-auth немесе 802-1x.phase2-autheap қасиеттерінде көрсетілген EAP әдісі қолданса, "2-кезең" клиенттік сертификатқа жолды қамтиды.

source: The password used to access the "phase2" client certificate stored in "phase2-client-cert" property. Only makes sense if the certificate is stored on a PKCS#11 token that requires a login.
kk: "phase2-client-cert" қасиетінде сақталған "phase2" клиенттік сертификатына қол жеткізу үшін қолданылатын пароль. Тек сертификат кіруді қажет ететін PKCS#11 токенінде сақталған жағдайда ғана мағынасы бар.

source: Flags indicating how to handle the "phase2-client-cert-password" property.
kk: "phase2-client-cert-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Constraint for server domain name. If set, this list of FQDNs is used as a match requirement for dNSName element(s) of the certificate presented by the authentication server during the inner "phase 2" authentication. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using the same comparison. Multiple valid FQDNs can be passed as a ";" delimited list.
kk: Сервер домен атауының шектеуі. Егер орнатылса, бұл FQDN тізімі ішкі "2-кезең" аутентификациясы кезінде аутентификация сервері ұсынған сертификаттың dNSName элемент(тер)і үшін сәйкестік талабы ретінде қолданылады. Егер сәйкес dNSName табылса, бұл шектеу орындалады. Егер dNSName мәндері жоқ болса, бұл шектеу сол салыстыру арқылы SubjectName CN-ге қарсы сәйкестендіріледі. Бірнеше жарамды FQDN-дерді ";" арқылы бөлінген тізім ретінде беруге болады.

source: Constraint for server domain name. If set, this FQDN is used as a suffix match requirement for dNSName element(s) of the certificate presented by the authentication server during the inner "phase 2" authentication. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using same suffix match comparison. Since version 1.24, multiple valid FQDNs can be passed as a ";" delimited list.
kk: Сервер домен атауының шектеуі. Егер орнатылса, бұл FQDN ішкі "2-кезең" аутентификациясы кезінде аутентификация сервері ұсынған сертификаттың dNSName элемент(тер)і үшін суффикс сәйкестік талабы ретінде қолданылады. Егер сәйкес dNSName табылса, бұл шектеу орындалады. Егер dNSName мәндері жоқ болса, бұл шектеу бірдей суффикс сәйкестігін салыстыру арқылы SubjectName CN-ге қарсы сәйкестендіріледі. 1.24 нұсқасынан бастап, бірнеше жарамды FQDN-дерді ";" арқылы бөлінген тізім ретінде беруге болады.

source: The path to the "phase 2" inner private key when the 802-1x.phase2-auth or 802-1x.phase2-autheap property is set to "tls".
kk: 802-1x.phase2-auth немесе 802-1x.phase2-autheap қасиеті "tls" мәніне орнатылған кезде "2-кезең" ішкі жеке кілтіне жол.

source: The password used to decrypt the "phase 2" private key specified in the 802-1x.phase2-private-key property. This is normally used by secret agents, not directly by users.
kk: 802-1x.phase2-private-key қасиетінде көрсетілген "2-кезең" жеке кілтінің шифрын ашу үшін қолданылатын пароль. Бұл әдетте пайдаланушылармен тікелей емес, құпия агенттермен қолданылады.

source: Flags indicating how to handle the "phase2-private-key-password" property.
kk: "phase2-private-key-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Substring to be matched against the subject of the certificate presented by the authentication server during the inner "phase 2" authentication. When unset, no verification of the authentication server certificate's subject is performed. This property provides little security, if any, and should not be used.
kk: Ішкі "2-кезең" аутентификациясы кезінде аутентификация сервері ұсынған сертификаттың тақырыбына қарсы сәйкестендірілетін ішкі жол. Көрсетілмеген кезде, аутентификация серверінің сертификат тақырыбы тексерілмейді. Бұл қасиет қауіпсіздікті аз қамтамасыз етеді және қолданылмауы керек.

source: PIN used for EAP authentication methods.
kk: EAP аутентификация әдістері үшін қолданылатын PIN коды.

source: Flags indicating how to handle the "pin" property.
kk: "pin" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: The path to the private key when the 802-1.eap property is set to "tls".
kk: 802-1.eap қасиеті "tls" мәніне орнатылған кезде жеке кілтке жол.

source: The password used to decrypt the private key specified in the 802-1x.private-key property. This is normally used by secret agents, not directly by users.
kk: 802-1x.private-key қасиетінде көрсетілген жеке кілттің шифрын ашу үшін қолданылатын пароль. Бұл әдетте пайдаланушылармен тікелей емес, құпия агенттермен қолданылады.

source: Flags indicating how to handle the "private-key-password" property.
kk: "private-key-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Substring to be matched against the subject of the certificate presented by the authentication server. When unset, no verification of the authentication server certificate's subject is performed. This property provides little security, if any, and should not be used.
kk: Аутентификация сервері ұсынған сертификаттың тақырыбына қарсы сәйкестендірілетін ішкі жол. Көрсетілмеген кезде, аутентификация серверінің сертификат тақырыбы тексерілмейді. Бұл қасиет қауіпсіздікті аз қамтамасыз етеді және қолданылмауы керек.

source: When TRUE, overrides the "ca-path" and "phase2-ca-path" properties using the system CA directory specified at configure time with the --system-ca-path switch. The certificates in this directory are added to the verification chain in addition to any certificates specified by the "ca-cert" and "phase2-ca-cert" properties. If the path provided with --system-ca-path is rather a file name (bundle of trusted CA certificates), it overrides "ca-cert" and "phase2-ca-cert" properties instead (sets ca_cert/ca_cert2 options for wpa_supplicant).
kk: TRUE болған кезде, --system-ca-path кілтімен конфигурациялау кезінде көрсетілген жүйелік CA бумасын қолданып, "ca-path" және "phase2-ca-path" қасиеттерін қайта жазады. Бұл бумадағы сертификаттар "ca-cert" және "phase2-ca-cert" қасиеттерімен көрсетілген кез келген сертификаттарға қосымша тексеру тізбегіне қосылады. Егер --system-ca-path арқылы берілген жол файл атауы (сенімді CA сертификаттарының жинағы) болса, ол оның орнына "ca-cert" және "phase2-ca-cert" қасиеттерін қайта жазады (wpa_supplicant үшін ca_cert/ca_cert2 опцияларын орнатады).

source: Encapsulation of ADSL connection. Can be "vcmux" or "llc".
kk: ADSL қосылымының инкапсуляциясы. "vcmux" немесе "llc" болуы мүмкін.

source: Password used to authenticate with the ADSL service.
kk: ADSL қызметімен аутентификациялау үшін қолданылатын пароль.

source: ADSL connection protocol. Can be "pppoa", "pppoe" or "ipoatm".
kk: ADSL қосылым хаттамасы. "pppoa", "pppoe" немесе "ipoatm" болуы мүмкін.

source: Username used to authenticate with the ADSL service.
kk: ADSL қызметімен аутентификациялау үшін қолданылатын пайдаланушы аты.

source: VCI of ADSL connection
kk: ADSL қосылымының VCI

source: VPI of ADSL connection
kk: ADSL қосылымының VPI

source: The Bluetooth address of the device.
kk: Құрылғының Bluetooth адресі.

source: Either "dun" for Dial-Up Networking connections or "panu" for Personal Area Networking connections to devices supporting the NAP profile.
kk: Dial-Up Networking қосылымдары үшін "dun" немесе NAP профилін қолдайтын құрылғыларға Personal Area Networking қосылымдары үшін "panu".

source: Dictionary of key/value pairs of bonding options. Both keys and values must be strings. Option names must contain only alphanumeric characters (ie, [a-zA-Z0-9]).
kk: Bonding опцияларының кілт/мән жұптарының сөздігі. Кілттер де, мәндер де жолдар болуы керек. Опция атаулары тек әріптік-сандық таңбалардан (яғни, [a-zA-Z0-9]) тұруы керек.

source: The Ethernet MAC address aging time, in seconds.
kk: Ethernet MAC адресінің ескіру уақыты (секундпен).

source: The Spanning Tree Protocol (STP) forwarding delay, in seconds.
kk: Spanning Tree Protocol (STP) қайта бағыттау кідірісі (секундпен).

source: If specified, The MAC address of the multicast group this bridge uses for STP. The address must be a link-local address in standard Ethernet MAC address format, ie an address of the form 01:80:C2:00:00:0X, with X in [0, 4..F]. If not specified the default value is 01:80:C2:00:00:00.
kk: Көрсетілсе, осы көпір STP үшін қолданатын мультикаст тобының MAC адресі. Адрес стандартты Ethernet MAC адресі пішіміндегі сілтеме-жергілікті адрес болуы керек, яғни 01:80:C2:00:00:0X пішіміндегі адрес, мұндағы X [0, 4..F] аралығында. Егер көрсетілмесе, әдепкі мән 01:80:C2:00:00:00 болады.

source: A mask of group addresses to forward. Usually, group addresses in the range from 01:80:C2:00:00:00 to 01:80:C2:00:00:0F are not forwarded according to standards. This property is a mask of 16 bits, each corresponding to a group address in that range that must be forwarded. The mask can't have bits 0, 1 or 2 set because they are used for STP, MAC pause frames and LACP.
kk: Қайта бағытталатын топтық адрестер маскасы. Әдетте, 01:80:C2:00:00:00-ден 01:80:C2:00:00:0F дейінгі ауқымдағы топтық адрестер стандарттарға сәйкес қайта бағытталмайды. Бұл қасиет — 16 биттік маска, әрқайсысы қайта бағытталуы тиіс сол ауқымдағы топтық адреске сәйкес келеді. Маскада 0, 1 немесе 2 биттері орнатыла алмайды, өйткені олар STP, MAC аялдату кадрлары және LACP үшін қолданылады.

source: The Spanning Tree Protocol (STP) hello time, in seconds.
kk: Spanning Tree Protocol (STP) сәлемдесу уақыты (секундпен).

source: If specified, the MAC address of bridge. When creating a new bridge, this MAC address will be set. If this field is left unspecified, the "ethernet.cloned-mac-address" is referred instead to generate the initial MAC address. Note that setting "ethernet.cloned-mac-address" anyway overwrites the MAC address of the bridge later while activating the bridge.
kk: Көрсетілсе, көпірдің MAC адресі. Жаңа көпір жасау кезінде бұл MAC адрес орнатылады. Егер бұл өріс көрсетілмесе, бастапқы MAC адресін жасау үшін оның орнына "ethernet.cloned-mac-address" қолданылады. Ескеріңіз, "ethernet.cloned-mac-address" орнату бәрібір көпірді белсендіру кезінде кейінірек көпірдің MAC адресін қайта жазады.

source: The Spanning Tree Protocol (STP) maximum message age, in seconds.
kk: Spanning Tree Protocol (STP) хабарламаның максималды жасы (секундпен).

source: Set maximum size of multicast hash table (value must be a power of 2).
kk: Мультикаст хэш кестесінің максималды өлшемін орнатыңыз (мән 2 дәрежесі болуы керек).

source: Set the number of queries the bridge will send before stopping forwarding a multicast group after a "leave" message has been received.
kk: "leave" хабарламасы алынғаннан кейін мультикаст тобын қайта бағыттауды тоқтатпас бұрын көпір жіберетін сұраулар санын орнатыңыз.

source: Set interval (in deciseconds) between queries to find remaining members of a group, after a "leave" message is received.
kk: "leave" хабарламасы алынғаннан кейін топтың қалған мүшелерін табу үшін сұраулар арасындағы аралықты (децисекундпен) орнатыңыз.

source: Set delay (in deciseconds) after which the bridge will leave a group, if no membership reports for this group are received.
kk: Егер бұл топ үшін мүшелік есептері алынбаса, көпір топтан шығатын кідірісті (децисекундпен) орнатыңыз.

source: Enable or disable sending of multicast queries by the bridge. If not specified the option is disabled.
kk: Көпір арқылы мультикаст сұрауларын жіберуді іске қосыңыз немесе сөндіріңіз. Егер көрсетілмесе, опция сөндірулі.

source: If no queries are seen after this delay (in deciseconds) has passed, the bridge will start to send its own queries.
kk: Егер осы кідіріс (децисекундпен) өткеннен кейін сұраулар байқалмаса, көпір өз сұрауларын жібере бастайды.

source: Interval (in deciseconds) between queries sent by the bridge after the end of the startup phase.
kk: Іске қосу фазасы аяқталғаннан кейін көпір жіберетін сұраулар арасындағы аралық (децисекундпен).

source: Set the Max Response Time/Max Response Delay (in deciseconds) for IGMP/MLD queries sent by the bridge.
kk: Көпір жіберген IGMP/MLD сұраулары үшін Максималды жауап уақытын/Максималды жауап кідірісін (децисекундпен) орнатыңыз.

source: If enabled the bridge's own IP address is used as the source address for IGMP queries otherwise the default of 0.0.0.0 is used.
kk: Егер іске қосылса, көпірдің өз IP адресі IGMP сұраулары үшін бастапқы адрес ретінде қолданылады, әйтпесе әдепкі 0.0.0.0 қолданылады.

source: Sets bridge's multicast router. Multicast-snooping must be enabled for this option to work. Supported values are: 'auto', 'disabled', 'enabled' to which kernel assigns the numbers 1, 0, and 2, respectively. If not specified the default value is 'auto' (1).
kk: Көпірдің мультикаст маршрутизаторын орнатады. Бұл опция жұмыс істеуі үшін Multicast-snooping іске қосылған болуы керек. Қолдау көрсетілетін мәндер: 'auto', 'disabled', 'enabled', оларға ядро сәйкесінше 1, 0 және 2 сандарын тағайындайды. Егер көрсетілмесе, әдепкі мән 'auto' (1).

source: Controls whether IGMP snooping is enabled for this bridge. Note that if snooping was automatically disabled due to hash collisions, the system may refuse to enable the feature until the collisions are resolved.
kk: Осы көпір үшін IGMP snooping іске қосылғанын басқарады. Ескеріңіз, егер snooping хэш қақтығыстарына байланысты автоматты түрде сөндірілсе, жүйе қақтығыстар шешілгенше мүмкіндікті іске қосудан бас тартуы мүмкін.

source: Set the number of IGMP queries to send during startup phase.
kk: Іске қосу фазасында жіберілетін IGMP сұрауларының санын орнатыңыз.

source: Sets the time (in deciseconds) between queries sent out at startup to determine membership information.
kk: Мүшелік ақпаратын анықтау үшін іске қосу кезінде жіберілетін сұраулар арасындағы уақытты (децисекундпен) орнатады.

source: Sets the Spanning Tree Protocol (STP) priority for this bridge. Lower values are "better"; the lowest priority bridge will be elected the root bridge.
kk: Осы көпір үшін Spanning Tree Protocol (STP) басымдығын орнатады. Төменгі мәндер "жақсырақ"; ең төменгі басымдыққа ие көпір түбірлік көпір болып сайланады.

source: Controls whether Spanning Tree Protocol (STP) is enabled for this bridge.
kk: Осы көпір үшін Spanning Tree Protocol (STP) іске қосылғанын басқарады.

source: The default PVID for the ports of the bridge, that is the VLAN id assigned to incoming untagged frames.
kk: Көпір порттары үшін әдепкі PVID, яғни кіріс белгіленбеген кадрларға тағайындалған VLAN id.

source: Control whether VLAN filtering is enabled on the bridge.
kk: Көпірде VLAN сүзгілеу іске қосылғанын басқарады.

source: If specified, the protocol used for VLAN filtering. Supported values are: '802.1Q', '802.1ad'. If not specified the default value is '802.1Q'.
kk: Көрсетілсе, VLAN сүзгілеу үшін қолданылатын хаттама. Қолдау көрсетілетін мәндер: '802.1Q', '802.1ad'. Егер көрсетілмесе, әдепкі мән '802.1Q'.

source: Controls whether per-VLAN stats accounting is enabled.
kk: Әр VLAN статистикасын есепке алу іске қосылғанын басқарады.

source: Array of bridge VLAN objects. In addition to the VLANs specified here, the bridge will also have the default-pvid VLAN configured by the bridge.vlan-default-pvid property. In nmcli the VLAN list can be specified with the following syntax: $vid [pvid] [untagged] [, $vid [pvid] [untagged]]... where $vid is either a single id between 1 and 4094 or a range, represented as a couple of ids separated by a dash.
kk: Көпір VLAN объектілерінің массиві. Мұнда көрсетілген VLAN-дарға қоса, көпірде bridge.vlan-default-pvid қасиетімен бапталған default-pvid VLAN болады. nmcli-де VLAN тізімін келесі синтаксиспен көрсетуге болады: $vid [pvid] [untagged] [, $vid [pvid] [untagged]]... мұндағы $vid 1 мен 4094 арасындағы жалғыз id немесе сызықшамен бөлінген id жұбы ретінде көрсетілген ауқым.

source: Enables or disables "hairpin mode" for the port, which allows frames to be sent back out through the port the frame was received on.
kk: Порт үшін "hairpin режимін" іске қосады немесе сөндіреді, бұл кадрлардың кадр қабылданған порт арқылы қайта жіберілуіне мүмкіндік береді.

source: The Spanning Tree Protocol (STP) port cost for destinations via this port.
kk: Осы порт арқылы тағайындалған жерлерге арналған Spanning Tree Protocol (STP) порт құны.

source: The Spanning Tree Protocol (STP) priority of this bridge port.
kk: Осы көпір портының Spanning Tree Protocol (STP) басымдығы.

source: Array of bridge VLAN objects. In addition to the VLANs specified here, the port will also have the default-pvid VLAN configured on the bridge by the bridge.vlan-default-pvid property. In nmcli the VLAN list can be specified with the following syntax: $vid [pvid] [untagged] [, $vid [pvid] [untagged]]... where $vid is either a single id between 1 and 4094 or a range, represented as a couple of ids separated by a dash.
kk: Көпір VLAN объектілерінің массиві. Мұнда көрсетілген VLAN-дарға қоса, портта bridge.vlan-default-pvid қасиеті арқылы көпірде бапталған default-pvid VLAN болады. nmcli-де VLAN тізімін келесі синтаксиспен көрсетуге болады: $vid [pvid] [untagged] [, $vid [pvid] [untagged]]... мұндағы $vid 1 мен 4094 арасындағы жалғыз id немесе сызықшамен бөлінген id жұбы ретінде көрсетілген ауқым.

source: If non-zero, only transmit packets of the specified size or smaller, breaking larger packets up into multiple frames.
kk: Егер нөл болмаса, тек көрсетілген өлшемдегі немесе одан кіші пакеттерді жібереді, үлкен пакеттерді бірнеше кадрларға бөледі.

source: The number to dial to establish the connection to the CDMA-based mobile broadband network, if any. If not specified, the default number (#777) is used when required.
kk: CDMA негізіндегі мобильді кең жолақты желіге қосылу үшін терілетін нөмір, егер бар болса. Егер көрсетілмесе, қажет болған жағдайда әдепкі нөмір (#777) қолданылады.

source: The password used to authenticate with the network, if required. Many providers do not require a password, or accept any password. But if a password is required, it is specified here.
kk: Қажет болса, желімен аутентификациялау үшін қолданылатын пароль. Көптеген провайдерлер парольді талап етпейді немесе кез келген парольді қабылдайды. Бірақ егер пароль қажет болса, ол мұнда көрсетіледі.

source: The username used to authenticate with the network, if required. Many providers do not require a username, or accept any username. But if a username is required, it is specified here.
kk: Қажет болса, желімен аутентификациялау үшін қолданылатын пайдаланушы аты. Көптеген провайдерлер пайдаланушы атын талап етпейді немесе кез келген пайдаланушы атын қабылдайды. Бірақ егер пайдаланушы аты қажет болса, ол мұнда көрсетіледі.

source: Specifies the NMSettingDcbFlags for the DCB FCoE application. Flags may be any combination of "enable" (0x1), "advertise" (0x2), and "willing" (0x4).
kk: DCB FCoE қолданбасы үшін NMSettingDcbFlags көрсетеді. Жалаушалар "enable" (0x1), "advertise" (0x2) және "willing" (0x4) кез келген комбинациясы болуы мүмкін.

source: The FCoE controller mode; either "fabric" or "vn2vn". Since 1.34, NULL is the default and means "fabric". Before 1.34, NULL was rejected as invalid and the default was "fabric".
kk: FCoE контроллер режимі; "fabric" немесе "vn2vn". 1.34 нұсқасынан бастап, NULL әдепкі болып табылады және "fabric" дегенді білдіреді. 1.34 нұсқасына дейін NULL жарамсыз деп қабылданбайтын және әдепкі мән "fabric" болатын.

source: The highest User Priority (0 - 7) which FCoE frames should use, or -1 for default priority. Only used when the "app-fcoe-flags" property includes the "enable" (0x1) flag.
kk: FCoE кадрлары қолдануы керек ең жоғары Пайдаланушы Басымдығы (0 - 7) немесе әдепкі басымдық үшін -1. Тек "app-fcoe-flags" қасиеті "enable" (0x1) жалаушасын қамтыған кезде ғана қолданылады.

source: Specifies the NMSettingDcbFlags for the DCB FIP application. Flags may be any combination of "enable" (0x1), "advertise" (0x2), and "willing" (0x4).
kk: DCB FIP қолданбасы үшін NMSettingDcbFlags көрсетеді. Жалаушалар "enable" (0x1), "advertise" (0x2) және "willing" (0x4) кез келген комбинациясы болуы мүмкін.

source: The highest User Priority (0 - 7) which FIP frames should use, or -1 for default priority. Only used when the "app-fip-flags" property includes the "enable" (0x1) flag.
kk: FIP кадрлары қолдануы керек ең жоғары Пайдаланушы Басымдығы (0 - 7) немесе әдепкі басымдық үшін -1. Тек "app-fip-flags" қасиеті "enable" (0x1) жалаушасын қамтыған кезде ғана қолданылады.

source: Specifies the NMSettingDcbFlags for the DCB iSCSI application. Flags may be any combination of "enable" (0x1), "advertise" (0x2), and "willing" (0x4).
kk: DCB iSCSI қолданбасы үшін NMSettingDcbFlags көрсетеді. Жалаушалар "enable" (0x1), "advertise" (0x2) және "willing" (0x4) кез келген комбинациясы болуы мүмкін.

source: The highest User Priority (0 - 7) which iSCSI frames should use, or -1 for default priority. Only used when the "app-iscsi-flags" property includes the "enable" (0x1) flag.
kk: iSCSI кадрлары қолдануы керек ең жоғары Пайдаланушы Басымдығы (0 - 7) немесе әдепкі басымдық үшін -1. Тек "app-iscsi-flags" қасиеті "enable" (0x1) жалаушасын қамтыған кезде ғана қолданылады.
