Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: List of DNS search domains. Domains starting with a tilde ('~') are considered 'routing' domains and are used only to decide the interface over which a query must be forwarded; they are not used to complete unqualified host names. When using a DNS plugin that supports Conditional Forwarding or Split DNS, then the search domains specify which name servers to query. This makes the behavior different from running with plain /etc/resolv.conf. For more information see also the dns-priority setting. When set on a profile that also enabled DHCP, the DNS search list received automatically (option 119 for DHCPv4 and option 24 for DHCPv6) gets merged with the manual list. This can be prevented by setting "ignore-auto-dns". Note that if no DNS searches are configured, the fallback will be derived from the domain from DHCP (option 15).
kk: DNS іздеу домендерінің тізімі. Тильдамен ('~') басталатын домендер 'бағыттау' домендері болып саналады және тек сұрау қай интерфейс арқылы қайта бағытталуы керектігін шешу үшін қолданылады; олар білікті емес хост аттарын толықтыру үшін қолданылмайды. Шартты Қайта Бағыттауды немесе Бөлінген DNS қолдайтын DNS плагинін қолданған кезде, іздеу домендері қай атау серверлерін сұрау керектігін көрсетеді. Бұл мінез-құлықты қарапайым /etc/resolv.conf іске қосудан өзгеше етеді. Толығырақ ақпарат алу үшін dns-priority баптауын қараңыз. DHCP қосылған профильде орнатылған кезде, автоматты түрде алынған DNS іздеу тізімі (DHCPv4 үшін 119 опция және DHCPv6 үшін 24 опция) қолмен енгізілген тізіммен біріктіріледі. Мұны "ignore-auto-dns" орнату арқылы болдырмауға болады. Ескеріңіз, егер DNS іздеулері бапталмаған болса, резервтік нұсқа DHCP (15 опция) доменінен алынады.

source: Whether to configure sysctl interface-specific forwarding. When enabled, the interface will act as a router to forward the packet from one interface to another. When set to "default" (-1), the value from global configuration is used; if no global default is defined, "auto" (2) will be used. The "forwarding" property is ignored when "method" is set to "shared", because forwarding is always enabled in this case. The accepted values are: "default" (-1): use global default. "no" (0): disabled. "yes" (1): enabled. "auto" (2): enable if any shared connection is active, use kernel default otherwise.
kk: sysctl интерфейске тән қайта бағыттауды баптау керек пе. Іске қосылған кезде, интерфейс пакетті бір интерфейстен екіншісіне қайта бағыттау үшін маршрутизатор ретінде әрекет етеді. "default" (-1) мәніне орнатылған кезде, глобалды конфигурациядан алынған мән қолданылады; егер глобалды әдепкі анықталмаса, "auto" (2) қолданылады. "method" "shared" мәніне орнатылған кезде "forwarding" қасиеті еленбейді, өйткені бұл жағдайда қайта бағыттау әрқашан іске қосылады. Қабылданған мәндер: "default" (-1): глобалды әдепкіні қолдану. "no" (0): сөндірулі. "yes" (1): іске қосулы. "auto" (2): кез келген ортақ қосылым белсенді болса іске қосу, әйтпесе ядро әдепкісін қолдану.

source: The gateway associated with this configuration. This is only meaningful if addresses are also set on the device. Setting the gateway causes NetworkManager to configure a standard default route with the gateway as next hop. This is ignored if "never-default" is set. An alternative is to configure the default route explicitly with a manual route and /0 as prefix length. Note that the gateway usually conflicts with routing that NetworkManager configures for WireGuard interfaces, so usually it should not be set in that case. See "ip4-auto-default-route".
kk: Осы конфигурациямен байланысты шлюз. Бұл тек құрылғыда адрестер орнатылған жағдайда ғана мағыналы болады. Шлюзді орнату NetworkManager-дің келесі қадам ретінде шлюзбен стандартты әдепкі бағдарды баптауына себеп болады. Егер "never-default" орнатылса, бұл еленбейді. Балама ретінде қолмен бағдар және префикс ұзындығы ретінде /0 бар әдепкі бағдарды айқын түрде баптауға болады. Ескеріңіз, шлюз әдетте NetworkManager WireGuard интерфейстері үшін баптайтын бағыттаумен қайшы келеді, сондықтан әдетте ол жағдайда оны орнатпау керек. "ip4-auto-default-route" қараңыз.

source: When "method" is set to "auto" and this property to TRUE, automatically configured name servers and search domains are ignored and only name servers and search domains specified in the "dns" and "dns-search" properties, if any, are used.
kk: "method" "auto" мәніне орнатылған кезде және бұл қасиет TRUE болғанда, автоматты түрде бапталған атау серверлері мен іздеу домендері еленбейді және тек "dns" және "dns-search" қасиеттерінде көрсетілген атау серверлері мен іздеу домендері (егер бар болса) қолданылады.

source: When "method" is set to "auto" and this property to TRUE, automatically configured routes are ignored and only routes specified in the "routes" property, if any, are used.
kk: "method" "auto" мәніне орнатылған кезде және бұл қасиет TRUE болғанда, автоматты түрде бапталған бағдарлар еленбейді және тек "routes" қасиетінде көрсетілген бағдарлар (егер бар болса) қолданылады.

source: Enable and disable the IPv4 link-local configuration independently of the ipv4.method configuration. This allows a link-local address (169.254.x.y/16) to be obtained in addition to other addresses, such as those manually configured or obtained from a DHCP server. When set to "auto", the value is dependent on "ipv4.method". When set to "default", it honors the global connection default, before falling back to "auto". Note that if "ipv4.method" is "disabled", then link local addressing is always disabled too. The default is "default". Since 1.52, when set to "fallback", a link-local address is obtained if no other IPv4 address is set.
kk: IPv4 link-local конфигурациясын ipv4.method конфигурациясына қарамастан іске қосыңыз және сөндіріңіз. Бұл қолмен бапталған немесе DHCP серверінен алынған адрестер сияқты басқа адрестерге қоса сілтеме-жергілікті адресті (169.254.x.y/16) алуға мүмкіндік береді. "auto" мәніне орнатылған кезде, мән "ipv4.method"-қа тәуелді болады. "default" мәніне орнатылған кезде, ол "auto"-ға ауыспас бұрын глобалды қосылым әдепкісін ескереді. Ескеріңіз, егер "ipv4.method" "disabled" болса, сілтеме жергілікті адрестеу де әрқашан сөндірулі болады. Әдепкі мән "default". 1.52 нұсқасынан бастап, "fallback" мәніне орнатылған кезде, егер басқа IPv4 адресі орнатылмаса, сілтеме-жергілікті адрес алынады.

source: If TRUE, allow overall network configuration to proceed even if the configuration specified by this property times out. Note that at least one IP configuration must succeed or overall network configuration will still fail. For example, in IPv6-only networks, setting this property to TRUE on the NMSettingIP4Config allows the overall network configuration to succeed if IPv4 configuration fails but IPv6 configuration completes successfully.
kk: Егер TRUE болса, осы қасиетпен көрсетілген конфигурация күту уақыты аяқталса да, жалпы желі конфигурациясының жалғасуына рұқсат етіңіз. Ескеріңіз, кем дегенде бір IP конфигурациясы сәтті болуы керек немесе жалпы желі конфигурациясы сәтсіз аяқталады. Мысалы, тек IPv6 желілерінде NMSettingIP4Config-те осы қасиетті TRUE мәніне орнату, егер IPv4 конфигурациясы сәтсіз болса, бірақ IPv6 конфигурациясы сәтті аяқталса, жалпы желі конфигурациясының сәтті болуына мүмкіндік береді.

source: The IPv4 connection method.
kk: IPv4 қосылым әдісі.

source: If TRUE, this connection will never be the default connection for this IP type, meaning it will never be assigned the default route by NetworkManager.
kk: Егер TRUE болса, бұл қосылым ешқашан осы IP түрі үшін әдепкі қосылым болмайды, яғни оған NetworkManager ешқашан әдепкі бағдарды тағайындамайды.

source: Connections will default to keep the autogenerated priority 0 local rule unless this setting is set to TRUE.
kk: Бұл баптау TRUE мәніне орнатылмаса, қосылымдар әдепкі бойынша автоматты түрде жасалған 0 басымдығындағы жергілікті ережені сақтайды.

source: The minimum time interval in milliseconds for which dynamic IP configuration should be tried before the connection succeeds. This property is useful for example if both IPv4 and IPv6 are enabled and are allowed to fail. Normally the connection succeeds as soon as one of the two address families completes; by setting a required timeout for e.g. IPv4, one can ensure that even if IP6 succeeds earlier than IPv4, NetworkManager waits some time for IPv4 before the connection becomes active. Note that if "may-fail" is FALSE for the same address family, this property has no effect as NetworkManager needs to wait for the full DHCP timeout. A zero value means that no required timeout is present, -1 means the default value (either configuration ipvx.required-timeout override or zero).
kk: Қосылым сәтті деп есептелмес бұрын динамикалық IP конфигурациясы сыналуы керек минималды уақыт аралығы (миллисекундпен). Бұл қасиет, мысалы, IPv4 және IPv6 екеуі де іске қосылған және сәтсіз болуына рұқсат етілген жағдайда пайдалы. Әдетте екі адрес отбасының біреуі аяқталған бойда қосылым сәтті болады; мысалы, IPv4 үшін қажетті күту уақытын орнату арқылы IP6 IPv4-тен ертерек сәтті болса да, қосылым белсенді болмас бұрын NetworkManager-дің IPv4-ті біраз уақыт күтуін қамтамасыз етуге болады. Ескеріңіз, егер сол адрес отбасы үшін "may-fail" FALSE болса, бұл қасиеттің әсері болмайды, өйткені NetworkManager толық DHCP күту уақытын күтуі керек. Нөлдік мән қажетті күту уақыты жоқ екенін білдіреді, -1 әдепкі мәнді білдіреді (ipvx.required-timeout конфигурациясын қайта жазу немесе нөл).

source: The default metric for routes that don't explicitly specify a metric. The default value -1 means that the metric is chosen automatically based on the device type. The metric applies to dynamic routes, manual (static) routes that don't have an explicit metric setting, address prefix routes, and the default route. Note that for IPv6, the kernel accepts zero (0) but coerces it to 1024 (user default). Hence, setting this property to zero effectively mean setting it to 1024. For IPv4, zero is a regular value for the metric.
kk: Метриканы айқын көрсетпейтін бағдарлар үшін әдепкі метрика. -1 әдепкі мәні метриканың құрылғы түріне қарай автоматты түрде таңдалатынын білдіреді. Метрика динамикалық бағдарларға, айқын метрика баптауы жоқ қолмен (статикалық) бағдарларға, адрес префиксі бағдарларына және әдепкі бағдарға қолданылады. Ескеріңіз, IPv6 үшін ядро нөлді (0) қабылдайды, бірақ оны 1024-ке (пайдаланушы әдепкісі) мәжбүрлейді. Сондықтан, бұл қасиетті нөлге орнату іс жүзінде оны 1024-ке орнатуды білдіреді. IPv4 үшін нөл — метрика үшін қалыпты мән.

source: Enable policy routing (source routing) and set the routing table used when adding routes. This affects all routes, including device-routes, IPv4LL, DHCP, SLAAC, default-routes and static routes. But note that static routes can individually overwrite the setting by explicitly specifying a non-zero routing table. If the table setting is left at zero, it is eligible to be overwritten via global configuration. If the property is zero even after applying the global configuration value, policy routing is disabled for the address family of this connection. Policy routing disabled means that NetworkManager will add all routes to the main table (except static routes that explicitly configure a different table). Additionally, NetworkManager will not delete any extraneous routes from tables except the main table. This is to preserve backward compatibility for users who manage routing tables outside of NetworkManager.
kk: Саясат бағыттауын (бастапқы бағыттау) іске қосыңыз және бағдарларды қосу кезінде қолданылатын бағыттау кестесін орнатыңыз. Бұл барлық бағдарларға әсер етеді, соның ішінде құрылғы-бағдарлары, IPv4LL, DHCP, SLAAC, әдепкі бағдарлар және статикалық бағдарлар. Бірақ ескеріңіз, статикалық бағдарлар нөлдік емес бағыттау кестесін айқын көрсету арқылы баптауды жеке қайта жаза алады. Егер кесте баптауы нөлде қалса, ол глобалды конфигурация мәні арқылы қайта жазылуға жарамды. Егер қасиет глобалды конфигурация мәнін қолданғаннан кейін де нөл болса, осы қосылымның адрес отбасы үшін саясат бағыттауы сөндіріледі. Саясат бағыттауы сөндірілген дегеніміз, NetworkManager барлық бағдарларды негізгі кестеге қосады (басқа кестені айқын баптайтын статикалық бағдарларды қоспағанда). Сонымен қатар, NetworkManager негізгі кестеден басқа кестелерден ешқандай артық бағдарларды өшірмейді. Бұл NetworkManager-ден тыс бағыттау кестелерін басқаратын пайдаланушылар үшін артқа қарай үйлесімділікті сақтау үшін жасалады.

source: Whether to add routes for DNS servers. When enabled, NetworkManager adds a route for each DNS server that is associated with this connection either statically (defined in the connection profile) or dynamically (for example, retrieved via DHCP). The route guarantees that the DNS server is reached via this interface. When set to "default" (-1), the value from global configuration is used; if no global default is defined, this feature is disabled.
kk: DNS серверлері үшін бағдарларды қосу керек пе. Іске қосылған кезде, NetworkManager осы қосылыммен статикалық түрде (қосылым профилінде анықталған) немесе динамикалық түрде (мысалы, DHCP арқылы алынған) байланыстырылған әрбір DNS сервері үшін бағдар қосады. Бағдар DNS серверіне осы интерфейс арқылы қол жеткізілетініне кепілдік береді. "default" (-1) мәніне орнатылған кезде, глобалды конфигурациядан алынған мән қолданылады; егер глобалды әдепкі анықталмаса, бұл мүмкіндік сөндіріледі.

source: A list of IPv4 destination addresses, prefix length, optional IPv4 next hop addresses, optional route metric, optional attribute. The valid syntax is: "ip[/prefix] [next-hop] [metric] [attribute=val]...[,ip[/prefix]...]". For example "192.0.2.0/24 10.1.1.1 77, 198.51.100.0/24".
kk: IPv4 тағайындалған адрестерінің, префикс ұзындығының, міндетті емес IPv4 келесі секіру адрестерінің, міндетті емес бағдар метрикасының, міндетті емес атрибуттың тізімі. Жарамды синтаксис: "ip[/префикс] [келесі-секіру] [метрика] [атрибут=мән]...[,ip[/префикс]...]". Мысалы "192.0.2.0/24 10.1.1.1 77, 198.51.100.0/24".

source: A comma separated list of routing rules for policy routing.
kk: Саясат бағыттауы үшін үтірмен бөлінген бағыттау ережелерінің тізімі.

source: This option allows you to specify a custom DHCP lease time for the shared connection method in seconds. The value should be either a number between 120 and 31536000 (one year) If this option is not specified, 3600 (one hour) is used. Special values are 0 for default value of 1 hour and 2147483647 (MAXINT32) for infinite lease time.
kk: Бұл опция ортақ қосылым әдісі үшін арнайы DHCP жалға алу уақытын (секундпен) көрсетуге мүмкіндік береді. Мән 120 мен 31536000 (бір жыл) арасындағы сан болуы керек. Егер бұл опция көрсетілмесе, 3600 (бір сағат) қолданылады. Арнайы мәндер: әдепкі 1 сағаттық мән үшін 0 және шексіз жалға алу уақыты үшін 2147483647 (MAXINT32).

source: This option allows you to specify a custom DHCP range for the shared connection method. The value is expected to be in `<START_ADDRESS>,<END_ADDRESS>` format. The range should be part of network set by ipv4.address option and it should not contain network address or broadcast address. If this option is not specified, the DHCP range will be automatically determined based on the interface address. The range will be selected to be adjacent to the interface address, either before or after it, with the larger possible range being preferred. The range will be adjusted to fill the available address space, except for networks with a prefix length greater than 24, which will be treated as if they have a prefix length of 24.
kk: Бұл опция ортақ қосылым әдісі үшін арнайы DHCP ауқымын көрсетуге мүмкіндік береді. Мән `<БАСТАПҚЫ_АДРЕС>,<СОҢҒЫ_АДРЕС>` пішімінде күтіледі. Ауқым ipv4.address опциясымен орнатылған желінің бөлігі болуы керек және ол желілік адресті немесе тарату адресін қамтымауы керек. Егер бұл опция көрсетілмесе, DHCP ауқымы интерфейс адресіне негізделіп автоматты түрде анықталады. Ауқым интерфейс адресіне жақын, оның алдында немесе артында таңдалады, үлкенірек мүмкін ауқымға артықшылық беріледі. Ауқым қолжетімді адрес кеңістігін толтыру үшін реттеледі, префикс ұзындығы 24-тен үлкен желілерді қоспағанда, олар префикс ұзындығы 24 сияқты өңделеді.

source: Configure method for creating the IPv6 interface identifier of addresses with RFC4862 IPv6 Stateless Address Autoconfiguration and Link Local addresses. The permitted values are: "eui64" (0), "stable-privacy" (1), "default" (3) or "default-or-eui64" (2). If the property is set to "eui64", the addresses will be generated using the interface token derived from hardware address. This makes the host part of the address to stay constant, making it possible to track the host's presence when it changes networks. The address changes when the interface hardware is replaced. If a duplicate address is detected, there is also no fallback to generate another address. When configured, the "ipv6.token" is used instead of the MAC address to generate addresses for stateless autoconfiguration. If the property is set to "stable-privacy", the interface identifier is generated as specified by RFC7217. This works by hashing a host specific key (see NetworkManager(8) manual), the interface name, the connection's "connection.stable-id" property and the address prefix. This improves privacy by making it harder to use the address to track the host's presence and the address is stable when the network interface hardware is replaced. The special values "default" and "default-or-eui64" will fallback to the global connection default as documented in the NetworkManager.conf(5) manual. If the global default is not specified, the fallback value is "stable-privacy" or "eui64", respectively. If not specified, when creating a new profile the default is "default". Note that this setting is distinct from the Privacy Extensions as configured by "ip6-privacy" property and it does not affect the temporary addresses configured with this option.
kk: RFC4862 IPv6 Күйсіз Адрес Автоконфигурациясы және Сілтеме Жергілікті адрестері бар адрестердің IPv6 интерфейс идентификаторын жасау әдісін баптаңыз. Рұқсат етілген мәндер: "eui64" (0), "stable-privacy" (1), "default" (3) немесе "default-or-eui64" (2). Егер қасиет "eui64" мәніне орнатылса, адрестер аппараттық адрестен алынған интерфейс токені арқылы жасалады. Бұл адрестің хост бөлігін тұрақты етеді, бұл хост желілерін өзгерткен кезде оның қатысуын бақылауға мүмкіндік береді. Интерфейс аппараттық құралы ауыстырылған кезде адрес өзгереді. Егер қайталанатын адрес анықталса, басқа адрес жасау үшін резервтік нұсқа жоқ. Бапталған кезде, күйсіз автоконфигурация үшін адрестерді жасауға MAC адресінің орнына "ipv6.token" қолданылады. Егер қасиет "stable-privacy" мәніне орнатылса, интерфейс идентификаторы RFC7217-де көрсетілгендей жасалады. Бұл хостқа тән кілтті (NetworkManager(8) нұсқаулығын қараңыз), интерфейс атын, қосылымның "connection.stable-id" қасиетін және адрес префиксін хэштеу арқылы жұмыс істейді. Бұл адресті хосттың қатысуын бақылау үшін қолдануды қиындату арқылы жекелікті жақсартады және желілік интерфейс аппараттық құралы ауыстырылған кезде адрес тұрақты болады. "default" және "default-or-eui64" арнайы мәндері NetworkManager.conf(5) нұсқаулығында құжатталғандай глобалды қосылым әдепкісіне ауысады. Егер глобалды әдепкі көрсетілмесе, резервтік мән сәйкесінше "stable-privacy" немесе "eui64" болады. Егер көрсетілмесе, жаңа профиль жасау кезінде әдепкі мән "default" болады. Ескеріңіз, бұл баптау "ip6-privacy" қасиетімен бапталған Жекелік Кеңейтімдерінен өзгеше және ол осы опциямен бапталған уақытша адрестерге әсер етпейді.

source: A list of IPv6 addresses and their prefix length. Multiple addresses can be separated by comma. For example "2001:db8:85a3::8a2e:370:7334/64, 2001:db8:85a3::5/64". The addresses are listed in decreasing priority, meaning the first address will be the primary address. This can make a difference with IPv6 source address selection (RFC 6724, section 5).
kk: IPv6 адрестерінің және олардың префикс ұзындығының тізімі. Бірнеше адрестерді үтірмен бөлуге болады. Мысалы "2001:db8:85a3::8a2e:370:7334/64, 2001:db8:85a3::5/64". Адрестер кему басымдығымен тізімделген, яғни бірінші адрес негізгі адрес болады. Бұл IPv6 бастапқы адресін таңдауда айырмашылық жасауы мүмкін (RFC 6724, 5-бөлім).

source: A string containing the DHCPv6 Unique Identifier (DUID) used by the dhcp client to identify itself to DHCPv6 servers (RFC 3315). The DUID is carried in the Client Identifier option. If the property is a hex string ('aa:bb:cc') it is interpreted as a binary DUID and filled as an opaque value in the Client Identifier option. The special value "lease" will retrieve the DUID previously used from the lease file belonging to the connection. If no DUID is found and "dhclient" is the configured dhcp client, the DUID is searched in the system-wide dhclient lease file. If still no DUID is found, or another dhcp client is used, a global and permanent DUID-UUID (RFC 6355) will be generated based on the machine-id. The special values "llt" and "ll" will generate a DUID of type LLT or LL (see RFC 3315) based on the current MAC address of the device. In order to try providing a stable DUID-LLT, the time field will contain a constant timestamp that is used globally (for all profiles) and persisted to disk. The special values "stable-llt", "stable-ll" and "stable-uuid" will generate a DUID of the corresponding type, derived from the connection's stable-id and a per-host unique key. You may want to include the "${DEVICE}" or "${MAC}" specifier in the stable-id, in case this profile gets activated on multiple devices. So, the link-layer address of "stable-ll" and "stable-llt" will be a generated address derived from the stable id. The DUID-LLT time value in the "stable-llt" option will be picked among a static timespan of three years (the upper bound of the interval is the same constant timestamp used in "llt"). When the property is unset, the global value provided for "ipv6.dhcp-duid" is used. If no global value is provided, the default "lease" value is assumed.
kk: DHCPv6 серверлеріне (RFC 3315) өзін сәйкестендіру үшін dhcp клиенті қолданатын DHCPv6 Бірегей Идентификаторын (DUID) қамтитын жол. DUID Client Identifier опциясында тасымалданады. Егер қасиет он алтылық жол ('aa:bb:cc') болса, ол екілік DUID ретінде түсіндіріледі және Client Identifier опциясында мөлдір емес мән ретінде толтырылады. "lease" арнайы мәні қосылымға тиесілі жалға алу файлынан бұрын қолданылған DUID-ті алады. Егер DUID табылмаса және бапталған dhcp клиенті "dhclient" болса, DUID жүйелік dhclient жалға алу файлынан ізделеді. Егер әлі DUID табылмаса немесе басқа dhcp клиенті қолданылса, machine-id негізінде глобалды және тұрақты DUID-UUID (RFC 6355) жасалады. "llt" және "ll" арнайы мәндері құрылғының ағымдағы MAC адресі негізінде LLT немесе LL түріндегі (RFC 3315 қараңыз) DUID жасайды. Тұрақты DUID-LLT қамтамасыз етуге тырысу үшін, уақыт өрісі глобалды (барлық профильдер үшін) қолданылатын және дискіде сақталатын тұрақты уақыт белгісін қамтиды. "stable-llt", "stable-ll" және "stable-uuid" арнайы мәндері қосылымның stable-id және әр хосттың бірегей кілтінен алынған сәйкес түрдегі DUID жасайды. Егер бұл профиль бірнеше құрылғыларда белсендірілсе, stable-id ішіне "${DEVICE}" немесе "${MAC}" спецификаторын қосқыңыз келуі мүмкін. Осылайша, "stable-ll" және "stable-llt" сілтеме-деңгейінің адресі stable-id-ден алынған жасалған адрес болады. "stable-llt" опциясындағы DUID-LLT уақыт мәні үш жылдық статикалық уақыт аралығынан таңдалады (аралықтың жоғарғы шегі "llt"-де қолданылатын сол тұрақты уақыт белгісі). Қасиет орнатылмаған кезде, "ipv6.dhcp-duid" үшін берілген глобалды мән қолданылады. Егер глобалды мән берілмесе, әдепкі "lease" мәні қабылданады.
