Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Enable or disable system networking
kk: Жүйелік желіні іске қосу немесе сөндіру

source: System policy prevents enabling or disabling system networking
kk: Жүйе саясаты жүйелік желіні іске қосуға немесе сөндіруге рұқсат етпейді

source: Reload NetworkManager configuration
kk: NetworkManager баптауларын қайта жүктеу

source: System policy prevents reloading NetworkManager
kk: Жүйе саясаты NetworkManager-ді қайта жүктеуге рұқсат етпейді

source: Put NetworkManager to sleep or wake it up (should only be used by system power management)
kk: NetworkManager-ді ұйықтату немесе ояту (тек жүйенің қуатты басқару жүйесі қолдануы керек)

source: System policy prevents putting NetworkManager to sleep or waking it up
kk: Жүйе саясаты NetworkManager-ді ұйықтатуға немесе оятуға рұқсат етпейді

source: Enable or disable Wi-Fi devices
kk: Wi-Fi құрылғыларын іске қосу немесе сөндіру

source: System policy prevents enabling or disabling Wi-Fi devices
kk: Жүйе саясаты Wi-Fi құрылғыларын іске қосуға немесе сөндіруге рұқсат етпейді

source: Enable or disable mobile broadband devices
kk: Мобильді кең жолақты құрылғыларды іске қосу немесе сөндіру

source: System policy prevents enabling or disabling mobile broadband devices
kk: Жүйе саясаты мобильді кең жолақты құрылғыларды іске қосуға немесе сөндіруге рұқсат етпейді

source: Enable or disable WiMAX mobile broadband devices
kk: WiMAX мобильді кең жолақты құрылғыларын іске қосу немесе сөндіру

source: System policy prevents enabling or disabling WiMAX mobile broadband devices
kk: Жүйе саясаты WiMAX мобильді кең жолақты құрылғыларын іске қосуға немесе сөндіруге рұқсат етпейді

source: Allow control of network connections
kk: Желілік қосылымдарды басқаруға рұқсат ету

source: System policy prevents control of network connections
kk: Жүйе саясаты желілік қосылымдарды басқаруға рұқсат етпейді

source: Allow control of Wi-Fi scans
kk: Wi-Fi сканерлеуді басқаруға рұқсат ету

source: System policy prevents Wi-Fi scans
kk: Жүйе саясаты Wi-Fi сканерлеуге рұқсат етпейді

source: Connection sharing via a protected Wi-Fi network
kk: Қорғалған Wi-Fi желісі арқылы қосылыммен бөлісу

source: System policy prevents sharing connections via a protected Wi-Fi network
kk: Жүйе саясаты қорғалған Wi-Fi желісі арқылы қосылыммен бөлісуге рұқсат етпейді

source: Connection sharing via an open Wi-Fi network
kk: Ашық Wi-Fi желісі арқылы қосылыммен бөлісу

source: System policy prevents sharing connections via an open Wi-Fi network
kk: Жүйе саясаты ашық Wi-Fi желісі арқылы қосылыммен бөлісуге рұқсат етпейді

source: Modify personal network connections
kk: Жеке желілік қосылымдарды өзгерту

source: System policy prevents modification of personal network settings
kk: Жүйе саясаты жеке желілік баптауларды өзгертуге рұқсат етпейді

source: Modify network connections for all users
kk: Барлық пайдаланушылар үшін желілік қосылымдарды өзгерту

source: System policy prevents modification of network settings for all users
kk: Жүйе саясаты барлық пайдаланушылар үшін желілік баптауларды өзгертуге рұқсат етпейді

source: Modify persistent system hostname
kk: Жүйенің тұрақты хост атын өзгерту

source: System policy prevents modification of the persistent system hostname
kk: Жүйе саясаты жүйенің тұрақты хост атын өзгертуге рұқсат етпейді

source: Modify persistent global DNS configuration
kk: Тұрақты глобалды DNS баптауларын өзгерту

source: System policy prevents modification of the persistent global DNS configuration
kk: Жүйе саясаты тұрақты глобалды DNS баптауларын өзгертуге рұқсат етпейді

source: Perform a checkpoint or rollback of interfaces configuration
kk: Интерфейстер баптауларының бақылау нүктесін жасау немесе қайтару

source: System policy prevents the creation of a checkpoint or its rollback
kk: Жүйе саясаты бақылау нүктесін жасауға немесе оны қайтаруға рұқсат етпейді

source: Enable or disable device statistics
kk: Құрылғы статистикасын іске қосу немесе сөндіру

source: System policy prevents enabling or disabling device statistics
kk: Жүйе саясаты құрылғы статистикасын іске қосуға немесе сөндіруге рұқсат етпейді

source: Enable or disable connectivity checking
kk: Қосылымды тексеруді іске қосу немесе сөндіру

source: System policy prevents enabling or disabling connectivity checking
kk: Жүйе саясаты қосылымды тексеруді іске қосуға немесе сөндіруге рұқсат етпейді

source: ADSL connection
kk: ADSL қосылымы

source: %s Network
kk: %s желісі

source: NAP requested, but Bluetooth device does not support NAP
kk: NAP сұралды, бірақ Bluetooth құрылғысы NAP қолдамайды

source: NAP connection
kk: NAP қосылымы

source: PAN requested, but Bluetooth device does not support NAP
kk: PAN сұралды, бірақ Bluetooth құрылғысы NAP қолдамайды

source: PAN connections cannot specify GSM, CDMA, or serial settings
kk: PAN қосылымдары GSM, CDMA немесе сериялық баптауларды көрсете алмайды

source: PAN connection
kk: PAN қосылымы

source: DUN requested, but Bluetooth device does not support DUN
kk: DUN сұралды, бірақ Bluetooth құрылғысы DUN қолдамайды

source: DUN connection must include a GSM or CDMA setting
kk: DUN қосылымында GSM немесе CDMA баптауы болуы тиіс

source: GSM connection
kk: GSM қосылымы

source: CDMA connection
kk: CDMA қосылымы

source: Unknown/unhandled Bluetooth connection type
kk: Белгісіз/өңделмеген Bluetooth қосылым түрі

source: connection does not match device
kk: қосылым құрылғыға сәйкес келмейді

source: 6LOWPAN connection
kk: 6LOWPAN қосылымы

source: Bond connection
kk: Bond қосылымы

source: Bridge connection
kk: Bridge қосылымы

source: Dummy connection
kk: Dummy қосылымы

source: Wired connection %d
kk: Сымды қосылым %d

source: Veth connection
kk: Veth қосылымы

source: PPPoE connection
kk: PPPoE қосылымы

source: Wired connection
kk: Сымды қосылым

source: InfiniBand connection
kk: InfiniBand қосылымы

source: IP tunnel connection
kk: IP туннель қосылымы

source: Loopback connection
kk: Loopback қосылымы

source: MACVLAN connection
kk: MACVLAN қосылымы

source: TUN connection
kk: TUN қосылымы

source: VLAN connection
kk: VLAN қосылымы

source: VRF connection
kk: VRF қосылымы

source: VXLAN connection
kk: VXLAN қосылымы

source: WPAN connection
kk: WPAN қосылымы

source: Team connection
kk: Team қосылымы

source: %s is incompatible with static WEP keys
kk: %s статикалық WEP кілттерімен үйлесімсіз

source: LEAP authentication requires a LEAP username
kk: LEAP аутентификациясы LEAP пайдаланушы атын талап етеді

source: LEAP username requires 'leap' authentication
kk: LEAP пайдаланушы аты 'leap' аутентификациясын талап етеді

source: LEAP authentication requires IEEE 802.1x key management
kk: LEAP аутентификациясы IEEE 802.1x кілттерін басқаруды талап етеді

source: LEAP authentication is incompatible with Ad-Hoc mode
kk: LEAP аутентификациясы Ad-Hoc режимімен үйлесімсіз

source: LEAP authentication is incompatible with 802.1x setting
kk: LEAP аутентификациясы 802.1x баптауымен үйлесімсіз

source: a connection using '%s' authentication cannot use WPA key management
kk: '%s' аутентификациясын қолданатын қосылым WPA кілттерін басқаруды қолдана алмайды

source: a connection using '%s' authentication cannot specify WPA protocols
kk: '%s' аутентификациясын қолданатын қосылым WPA хаттамаларын көрсете алмайды

source: a connection using '%s' authentication cannot specify WPA ciphers
kk: '%s' аутентификациясын қолданатын қосылым WPA шифрларын көрсете алмайды

source: a connection using '%s' authentication cannot specify a WPA password
kk: '%s' аутентификациясын қолданатын қосылым WPA паролін көрсете алмайды

source: Dynamic WEP requires an 802.1x setting
kk: Динамикалық WEP 802.1x баптауын талап етеді

source: Dynamic WEP requires 'open' authentication
kk: Динамикалық WEP 'open' аутентификациясын талап етеді

source: Dynamic WEP requires 'ieee8021x' key management
kk: Динамикалық WEP 'ieee8021x' кілттерін басқаруды талап етеді

source: WPA-PSK authentication is incompatible with 802.1x
kk: WPA-PSK аутентификациясы 802.1x-пен үйлесімсіз

source: WPA-PSK requires 'open' authentication
kk: WPA-PSK 'open' аутентификациясын талап етеді

source: Access point does not support PSK but setting requires it
kk: Қатынау нүктесі PSK қолдамайды, бірақ баптау оны талап етеді

source: WPA Ad-Hoc authentication requires 'rsn' protocol
kk: WPA Ad-Hoc аутентификациясы 'rsn' хаттамасын талап етеді

source: WPA Ad-Hoc authentication requires 'ccmp' pairwise cipher
kk: WPA Ad-Hoc аутентификациясы 'ccmp' жұптық шифрын талап етеді

source: WPA Ad-Hoc requires 'ccmp' group cipher
kk: WPA Ad-Hoc 'ccmp' топтық шифрын талап етеді

source: WPA-EAP authentication requires an 802.1x setting
kk: WPA-EAP аутентификациясы 802.1x баптауын талап етеді

source: WPA-EAP requires 'open' authentication
kk: WPA-EAP 'open' аутентификациясын талап етеді

source: 802.1x setting requires 'wpa-eap' key management
kk: 802.1x баптауы 'wpa-eap' кілттерін басқаруды талап етеді

source: Access point does not support 802.1x but setting requires it
kk: Қатынау нүктесі 802.1x қолдамайды, бірақ баптау оны талап етеді

source: Ad-Hoc mode requires 'none' or 'wpa-psk' key management
kk: Ad-Hoc режимі 'none' немесе 'wpa-psk' кілттерін басқаруды талап етеді

source: Ad-Hoc mode is incompatible with 802.1x security
kk: Ad-Hoc режимі 802.1x қауіпсіздігімен үйлесімсіз

source: Ad-Hoc mode is incompatible with LEAP security
kk: Ad-Hoc режимі LEAP қауіпсіздігімен үйлесімсіз

source: Ad-Hoc mode requires 'open' authentication
kk: Ad-Hoc режимі 'open' аутентификациясын талап етеді

source: connection does not match access point
kk: қосылым қатынау нүктесіне сәйкес келмейді

source: connection does not match mesh point
kk: қосылым mesh нүктесіне сәйкес келмейді

source: Access point is unencrypted but setting specifies security
kk: Қатынау нүктесі шифрланбаған, бірақ баптау қауіпсіздікті көрсетеді

source: WPA authentication is incompatible with non-EAP (original) LEAP or Dynamic WEP
kk: WPA аутентификациясы EAP емес (түпнұсқа) LEAP немесе Динамикалық WEP-пен үйлесімсіз

source: WPA authentication is incompatible with Shared Key authentication
kk: WPA аутентификациясы Shared Key аутентификациясымен үйлесімсіз

source: Failed to determine AP security information
kk: AP қауіпсіздік ақпаратын анықтау сәтсіз аяқталды

source: # Created by NetworkManager
kk: # NetworkManager тарапынан жасалған

source: # Merged from %s
kk: # %s ішінен біріктірілген

source: Writing to %s failed: %s
kk: %s ішіне жазу сәтсіз: %s

source: Cannot create '%s': %s
kk: '%s' жасау мүмкін емес: %s

source: %s is already running (pid %lld)
kk: %s қазірдің өзінде орындалуда (pid %lld)

source: %s. Please use --help to see a list of valid options.
kk: %s. Жарамды опциялар тізімін көру үшін --help қолданыңыз.

source: Failed to read configuration: %s
kk: Баптауды оқу сәтсіз: %s

source: Print NetworkManager version and exit
kk: NetworkManager нұсқасын шығару және шығу

source: Don't become a daemon
kk: Қызмет (daemon) ретінде жүрмеу

source: Log level: one of [%s]
kk: Журнал деңгейі: [%s] біреуі

source: Log domains separated by ',': any combination of [%s]
kk: ',' арқылы бөлінген журнал домендері: [%s] кез келген комбинациясы

source: Make all warnings fatal
kk: Барлық ескертулерді фаталды ету

source: Specify the location of a PID file
kk: PID файлының орналасуын көрсету

source: Print NetworkManager configuration and exit
kk: NetworkManager баптауын шығару және шығу

source: NetworkManager monitors all network connections and automatically chooses the best connection to use. It also allows the user to specify wireless access points which wireless cards in the computer should associate with.
kk: NetworkManager барлық желілік қосылымдарды бақылайды және автоматты түрде қолдану үшін ең жақсы қосылымды таңдайды. Сонымен қатар ол пайдаланушыға компьютердегі сымсыз карталар қосылатын сымсыз қатынау нүктелерін көрсетуге мүмкіндік береді.

source: Could not daemonize: %s [error %u]
kk: Қызмет (daemon) ретінде іске қосу мүмкін емес: %s [қате %u]

source: '%s' is not valid
kk: '%s' жарамды емес

source: Bad '%s' option:
kk: Жарамсыз '%s' опциясы:

source: Config file location
kk: Конфигурация файлының орны

source: Config directory location
kk: Конфигурация бумасының орны

source: System config directory location
kk: Жүйелік конфигурация бумасының орны

source: Internal config file location
kk: Ішкі конфигурация файлының орны

source: State file location
kk: Күй файлының орны

source: State file for no-auto-default devices
kk: no-auto-default құрылғыларына арналған күй файлы

source: List of plugins separated by ','
kk: ',' арқылы бөлінген плагиндер тізімі

source: Quit after initial configuration
kk: Бастапқы баптаудан кейін шығу

source: Don't become a daemon, and log to stderr
kk: Қызмет (daemon) болмау және stderr-ге жазу

source: An http(s) address for checking internet connectivity
kk: Интернет қосылымын тексеруге арналған http(s) адресі

source: The interval between connectivity checks (in seconds)
kk: Қосылымды тексерулер арасындағы интервал (секундпен)

source: The expected start of the response
kk: Жауаптың күтілетін басы

source: NetworkManager options
kk: NetworkManager опциялары

source: Show NetworkManager options
kk: NetworkManager опцияларын көрсету

source: VPN connection
kk: VPN қосылымы

source: invalid json
kk: жарамсыз json

source: request succeeded with %s but object is in an unsuitable state
kk: сұраным %s нәтижесімен сәтті аяқталды, бірақ объект сәйкес келмейтін күйде

source: operation succeeded but object %s does not exist
kk: операция сәтті аяқталды, бірақ %s объектісі жоқ

source: Invalid peer starting at %s:%zu: %s
kk: %s:%zu орнында басталған жарамсыз торап: %s

source: The name of the WireGuard config must be a valid interface name followed by ".conf"
kk: WireGuard конфигурациясының аты ".conf" жалғауы бар жарамды интерфейс аты болуы керек

source: unrecognized line at %s:%zu
kk: %s:%zu орнында танылмаған жол

source: invalid value for '%s' at %s:%zu
kk: '%s' үшін %s:%zu орнындағы жарамсыз мән

source: invalid secret '%s' at %s:%zu
kk: жарамсыз '%s' құпиясы, %s:%zu орнында

source: Failed to create WireGuard connection: %s
kk: WireGuard қосылымын жасау сәтсіз: %s

source: The connection was not an ADSL connection.
kk: Қосылым ADSL қосылымы болмады.

source: The connection was not a bond connection.
kk: Қосылым bond қосылымы болмады.

source: The connection was not a bridge connection.
kk: Қосылым bridge қосылымы болмады.

source: The connection was not a Bluetooth connection.
kk: Қосылым Bluetooth қосылымы болмады.

source: The connection is of Bluetooth NAP type.
kk: Қосылым Bluetooth NAP түрінде.

source: Invalid device Bluetooth address.
kk: Жарамсыз құрылғы Bluetooth адресі.

source: The Bluetooth addresses of the device and the connection didn't match.
kk: Құрылғы мен қосылымның Bluetooth адрестері сәйкес келмеді.

source: The device is lacking Bluetooth capabilities required by the connection.
kk: Құрылғыда қосылым талап ететін Bluetooth мүмкіндіктері жоқ.

source: The connection was not a dummy connection.
kk: Қосылым dummy қосылымы болмады.

source: The connection did not specify an interface name.
kk: Қосылым интерфейс атын көрсетпеді.

source: The connection was not an Ethernet or PPPoE connection.
kk: Қосылым Ethernet немесе PPPoE қосылымы болмады.

source: The connection and device differ in S390 subchannels.
kk: Қосылым мен құрылғы S390 ішкі арналары бойынша ерекшеленеді.

source: Invalid device MAC address %s.
kk: Жарамсыз құрылғы MAC адресі %s.

source: The MACs of the device and the connection do not match.
kk: Құрылғы мен қосылымның MAC адрестері сәйкес келмейді.

source: Invalid MAC in the blacklist: %s.
kk: Қара тізімдегі жарамсыз MAC: %s.

source: Device MAC (%s) is blacklisted by the connection.
kk: Құрылғы MAC (%s) қосылым тарапынан қара тізімге салынған.

source: The connection was not a generic connection.
kk: Қосылым жалпы (generic) қосылым болмады.

source: The connection was not an InfiniBand connection.
kk: Қосылым InfiniBand қосылымы болмады.

source: Invalid device MAC address.
kk: Жарамсыз құрылғы MAC адресі.

source: The MACs of the device and the connection didn't match.
kk: Құрылғы мен қосылымның MAC адрестері сәйкес келмеді.

source: The connection was not an IP tunnel connection.
kk: Қосылым IP туннель қосылымы болмады.

source: The connection was not a loopback connection.
kk: Қосылым loopback қосылымы болмады.

source: The connection was not a MAC-VLAN connection.
kk: Қосылым MAC-VLAN қосылымы болмады.

source: The connection was not a modem connection.
kk: Қосылым модем қосылымы болмады.

source: The connection was not a valid modem connection.
kk: Қосылым жарамды модем қосылымы болмады.

source: The device is lacking capabilities required by the connection.
kk: Құрылғыда қосылым талап ететін мүмкіндіктер жоқ.

source: The connection was not an OLPC Mesh connection.
kk: Қосылым OLPC Mesh қосылымы болмады.

source: The connection was not a ovs_bridge connection.
kk: Қосылым ovs_bridge қосылымы болмады.

source: The connection was not a ovs_interface connection.
kk: Қосылым ovs_interface қосылымы болмады.

source: The connection was not a ovs_port connection.
kk: Қосылым ovs_port қосылымы болмады.

source: The connection was not a team connection.
kk: Қосылым team қосылымы болмады.

source: The connection was not a tun connection.
kk: Қосылым tun қосылымы болмады.

source: The mode of the device and the connection didn't match
kk: Құрылғы мен қосылымның режимі сәйкес келмеді

source: The connection was not a VLAN connection.
kk: Қосылым VLAN қосылымы болмады.

source: The VLAN identifiers of the device and the connection didn't match.
kk: Құрылғы мен қосылымның VLAN идентификаторлары сәйкес келмеді.

source: The hardware address of the device and the connection didn't match.
kk: Құрылғы мен қосылымның аппараттық адресі сәйкес келмеді.

source: The connection was not a VRF connection.
kk: Қосылым VRF қосылымы болмады.

source: The VRF table of the device and the connection didn't match.
kk: Құрылғы мен қосылымның VRF кестесі сәйкес келмеді.

source: The connection was not a VXLAN connection.
kk: Қосылым VXLAN қосылымы болмады.

source: The VXLAN identifiers of the device and the connection didn't match.
kk: Құрылғы мен қосылымның VXLAN идентификаторлары сәйкес келмеді.

source: The connection was not a Wi-Fi P2P connection.
kk: Қосылым Wi-Fi P2P қосылымы болмады.

source: The connection was not a Wi-Fi connection.
kk: Қосылым Wi-Fi қосылымы болмады.

source: The device is lacking WPA capabilities required by the connection.
kk: Құрылғыда қосылым талап ететін WPA мүмкіндіктері жоқ.

source: The device is lacking WPA2/RSN capabilities required by the connection.
kk: Құрылғыда қосылым талап ететін WPA2/RSN мүмкіндіктері жоқ.

source: The connection was not a wpan connection.
kk: Қосылым wpan қосылымы болмады.

source: Open vSwitch Interface
kk: Open vSwitch интерфейсі

source: Open vSwitch Port
kk: Open vSwitch порты

source: Mobile Broadband
kk: Мобильді кең жолақты

source: Unknown
kk: Белгісіз

source: Wired
kk: Сымды

source: The connection was not valid: %s
kk: Қосылым жарамсыз болды: %s

source: The interface names of the device and the connection didn't match
kk: Құрылғы мен қосылымның интерфейс аттары сәйкес келмеді

source: registration failed
kk: тіркеу сәтсіз аяқталды

source: No service name specified
kk: Қызмет аты көрсетілмеген

source: '%s' is not valid: properties should be specified as 'key=value'
kk: '%s' жарамсыз: қасиеттер 'кілт=мән' түрінде көрсетілуі керек

source: '%s' is not a valid key
kk: '%s' — жарамды кілт емес

source: duplicate key '%s'
kk: қайталанатын кілт '%s'

source: number for '%s' is out of range
kk: '%s' үшін сан ауқымнан тыс

source: value for '%s' must be a number
kk: '%s' үшін мән сан болуы керек

source: value for '%s' must be a boolean
kk: '%s' үшін мән логикалық (boolean) болуы керек

source: missing 'name' attribute
kk: 'name' атрибуты жетіспейді

source: invalid 'name' "%s"
kk: жарамсыз 'name' "%s"

source: attribute '%s' is invalid for "%s"
kk: '%s' атрибуты "%s" үшін жарамсыз

source: property cannot be an empty string
kk: қасиет бос жол бола алмайды

source: property cannot be longer than 255 bytes
kk: қасиет 255 байттан ұзын бола алмайды

source: property cannot contain any nul bytes
kk: қасиетте ешқандай nul байттары болмауы керек

source: invalid DSCP value; allowed values are: 'CS0', 'CS4', 'CS6'
kk: жарамсыз DSCP мәні; рұқсат етілген мәндер: 'CS0', 'CS4', 'CS6'

source: NULL DHCP range; it should be provided as <START_IP>,<END_IP>.
kk: NULL DHCP ауқымы; ол <START_IP>,<END_IP> ретінде берілуі керек.

source: Non-NULL range and NULL addresses detected.
kk: NULL емес ауқым және NULL адрестер анықталды.

source: Invalid DHCP range; it should be provided as <START_IP>,<END_IP>.
kk: Жарамсыз DHCP ауқымы; ол <START_IP>,<END_IP> ретінде берілуі керек.

source: Start IP has invalid length.
kk: Бастапқы IP ұзындығы жарамсыз.

source: Start IP is invalid.
kk: Бастапқы IP жарамсыз.

source: End IP is invalid.
kk: Соңғы IP жарамсыз.

source: Start IP should be lower than the end IP.
kk: Бастапқы IP соңғы IP-ден кіші болуы керек.

source: Requested range is not in any network configured on the interface.
kk: Сұралған ауқым интерфейсте бапталған ешбір желіде жоқ.

source: Invalid DHCP lease time value; it should be either default or a positive number between %u and %u or %s.
kk: Жарамсыз DHCP жалға алу уақытының мәні; ол әдепкі немесе %u және %u арасындағы оң сан немесе %s болуы керек.

source: the string is empty
kk: жол бос

source: the DNS-over-TLS server name is empty
kk: DNS-over-TLS сервер аты бос

source: "%s" is not a valid IP address or a supported URI
kk: "%s" — жарамды IP адресі немесе қолдау көрсетілетін URI емес

source: unterminated square bracket
kk: аяқталмаған тік жақша

source: the interface name is too long
kk: интерфейс аты тым ұзын

source: "%s" is not a valid port number
kk: "%s" — жарамды порт нөмірі емес

source: IPv6 addresses must be enclosed in square brackets
kk: IPv6 адрестері тік жақшаға алынуы керек

source: "%s" is not a valid IP address
kk: "%s" — жарамды IP адресі емес

source: the server name is only supported for DNS-over-TLS
kk: сервер аты тек DNS-over-TLS үшін қолдау көрсетіледі

source: the scope-id is only supported for IPv6 link-local addresses
kk: scope-id тек IPv6 link-local адрестері үшін қолдау көрсетіледі

source: missing key
kk: кілт жетіспейді

source: key is too long
kk: кілт тым ұзын

source: key must be UTF8
kk: кілт UTF8 болуы керек

source: key contains invalid characters
kk: кілтте жарамсыз таңбалар бар

source: value is missing
kk: мән жетіспейді

source: value is too large
kk: мән тым үлкен

source: value is not valid UTF8
kk: мән жарамды UTF8 емес

source: wrong type; should be a list of strings.
kk: қате түр; жолдар тізімі болуы керек.

source: unknown setting name
kk: белгісіз баптау аты

source: duplicate setting name
kk: қайталанатын баптау аты

source: has an invalid UUID
kk: жарамсыз UUID бар

source: has a UUID that requires normalization
kk: қалыпқа келтіруді талап ететін UUID бар

source: has duplicate UUIDs
kk: қайталанатын UUID-тер бар

source: setting not found
kk: баптау табылмады

source: setting is required for non-port connections
kk: баптау порт емес қосылымдар үшін қажет

source: setting not allowed in port connection
kk: порт қосылымында баптауға рұқсат етілмейді

source: Unexpected failure to normalize the connection
kk: Қосылымды қалыпқа келтіруде күтпеген қате

source: Unexpected failure to verify the connection
kk: Қосылымды тексеруде күтпеген қате

source: unexpected uuid %s instead of %s
kk: %s орнына күтпеген uuid %s

source: property is missing
kk: қасиет жетіспейді

source: Value cannot be interpreted as a list of numbers.
kk: Мәнді сандар тізімі ретінде түсіндіру мүмкін емес.

source: value is not an integer in range [%lld, %lld]
kk: мән [%lld, %lld] ауқымындағы бүтін сан емес
