Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: The rx queue size (number of rx descriptors) for DPDK ports. Must be zero or a power of 2 between 1 and 4096, and supported by the hardware. Defaults to zero which means to leave the parameter in OVS unspecified and effectively configures 2048 descriptors.
kk: DPDK порттары үшін rx кезек өлшемі (rx дескрипторларының саны). Нөл немесе 1 мен 4096 арасындағы 2 дәрежесі болуы керек және аппараттық құрал қолдауы керек. Әдепкі нөлге тең, бұл OVS-те параметрді көрсетілмеген күйде қалдыруды білдіреді және іс жүзінде 2048 дескрипторды баптайды.

source: The tx queue size (number of tx descriptors) for DPDK ports. Must be zero or a power of 2 between 1 and 4096, and supported by the hardware. Defaults to zero which means to leave the parameter in OVS unspecified and effectively configures 2048 descriptors.
kk: DPDK порттары үшін tx кезек өлшемі (tx дескрипторларының саны). Нөл немесе 1 мен 4096 арасындағы 2 дәрежесі болуы керек және аппараттық құрал қолдауы керек. Әдепкі нөлге тең, бұл OVS-те параметрді көрсетілмеген күйде қалдыруды білдіреді және іс жүзінде 2048 дескрипторды баптайды.

source: Open vSwitch openflow port number. Defaults to zero which means that port number will not be specified and it will be chosen randomly by ovs. OpenFlow ports are the network interfaces for passing packets between OpenFlow processing and the rest of the network. OpenFlow switches connect logically to each other via their OpenFlow ports.
kk: Open vSwitch openflow порт нөмірі. Әдепкі нөлге тең, бұл порт нөмірі көрсетілмейтінін және оны ovs кездейсоқ таңдайтынын білдіреді. OpenFlow порттары — OpenFlow өңдеуі мен желінің қалған бөлігі арасында пакеттерді өткізуге арналған желілік интерфейстер. OpenFlow қосқыштары бір-бірімен OpenFlow порттары арқылы логикалық түрде қосылады.

source: The interface type. Either "internal", "system", "patch", "dpdk", or empty.
kk: Интерфейс түрі. "internal", "system", "patch", "dpdk" немесе бос.

source: Specifies the name of the interface for the other side of the patch. The patch on the other side must also set this interface as peer.
kk: Патчтың екінші жағы үшін интерфейс атын көрсетеді. Екінші жағындағы патч та бұл интерфейсті серіктес ретінде орнатуы керек.

source: The time port must be inactive in order to be considered down.
kk: Порт төмен деп есептелуі үшін белсенді емес болуы керек уақыт.

source: Bonding mode. One of "active-backup", "balance-slb", or "balance-tcp".
kk: Bonding режимі. "active-backup", "balance-slb" немесе "balance-tcp" біреуі.

source: The time port must be active before it starts forwarding traffic.
kk: Порт трафикті бағыттауды бастамас бұрын белсенді болуы керек уақыт.

source: LACP mode. One of "active", "off", or "passive".
kk: LACP режимі. "active", "off" немесе "passive" біреуі.

source: The VLAN tag in the range 0-4095.
kk: 0-4095 ауқымындағы VLAN тегі.

source: A list of VLAN ranges that this port trunks. The property is valid only for ports with mode "trunk", "native-tagged", or "native-untagged port". If it is empty, the port trunks all VLANs.
kk: Осы порт біріктіретін VLAN ауқымдарының тізімі. Қасиет тек "trunk", "native-tagged" немесе "native-untagged port" режимдері бар порттар үшін жарамды. Егер ол бос болса, порт барлық VLAN-дарды біріктіреді.

source: The VLAN mode. One of "access", "native-tagged", "native-untagged", "trunk", "dot1q-tunnel" or unset.
kk: VLAN режимі. "access", "native-tagged", "native-untagged", "trunk", "dot1q-tunnel" біреуі немесе орнатылмаған.

source: If non-zero, instruct pppd to set the serial port to the specified baudrate. This value should normally be left as 0 to automatically choose the speed.
kk: Егер нөл болмаса, pppd-ға сериялық портты көрсетілген бод жылдамдығына орнатуды нұсқаңыз. Жылдамдықты автоматты түрде таңдау үшін бұл мән әдетте 0 күйінде қалуы керек.

source: If TRUE, specify that pppd should set the serial port to use hardware flow control with RTS and CTS signals. This value should normally be set to FALSE.
kk: Егер TRUE болса, pppd-ға сериялық портты RTS және CTS сигналдарымен аппараттық ағынды басқаруды қолдануға орнату керектігін көрсетіңіз. Бұл мән әдетте FALSE болып орнатылуы керек.

source: If non-zero, instruct pppd to presume the connection to the peer has failed if the specified number of LCP echo-requests go unanswered by the peer. The "lcp-echo-interval" property must also be set to a non-zero value if this property is used.
kk: Егер нөл болмаса, егер LCP echo-сұрауларының көрсетілген санына серіктес жауап бермесе, pppd-ға серіктеспен қосылым сәтсіз болды деп болжауды нұсқаңыз. Егер бұл қасиет қолданылса, "lcp-echo-interval" қасиеті де нөлдік емес мәнге орнатылуы керек.

source: If non-zero, instruct pppd to send an LCP echo-request frame to the peer every n seconds (where n is the specified value). Note that some PPP peers will respond to echo requests and some will not, and it is not possible to autodetect this.
kk: Егер нөл болмаса, pppd-ға әр n секунд сайын (мұндағы n — көрсетілген мән) серіктеске LCP echo-сұрау кадрын жіберуді нұсқаңыз. Ескеріңіз, кейбір PPP серіктестері echo сұрауларына жауап береді, ал кейбіреулері жауап бермейді және мұны автоанықтау мүмкін емес.

source: If TRUE, stateful MPPE is used. See pppd documentation for more information on stateful MPPE.
kk: Егер TRUE болса, күйлі MPPE қолданылады. Күйлі MPPE туралы қосымша ақпарат алу үшін pppd құжаттамасын қараңыз.

source: If non-zero, instruct pppd to request that the peer send packets no larger than the specified size. If non-zero, the MRU should be between 128 and 16384.
kk: Егер нөл болмаса, pppd-ға серіктестің көрсетілген өлшемнен үлкен емес пакеттерді жіберуін сұрауды нұсқаңыз. Егер нөл болмаса, MRU 128 бен 16384 арасында болуы керек.

source: If non-zero, instruct pppd to send packets no larger than the specified size.
kk: Егер нөл болмаса, pppd-ға көрсетілген өлшемнен үлкен емес пакеттерді жіберуді нұсқаңыз.

source: If TRUE, Van Jacobsen TCP header compression will not be requested.
kk: Егер TRUE болса, Van Jacobsen TCP тақырыптамасын сығу сұралмайды.

source: If TRUE, do not require the other side (usually the PPP server) to authenticate itself to the client. If FALSE, require authentication from the remote side. In almost all cases, this should be TRUE.
kk: Егер TRUE болса, екінші жақтың (әдетте PPP сервері) клиентке өзін аутентификациялауын талап етпеңіз. Егер FALSE болса, қашықтағы жақтан аутентификацияны талап етіңіз. Барлық жағдайларда дерлік бұл TRUE болуы керек.

source: If TRUE, BSD compression will not be requested.
kk: Егер TRUE болса, BSD сығу сұралмайды.

source: If TRUE, "deflate" compression will not be requested.
kk: Егер TRUE болса, "deflate" сығу сұралмайды.

source: If TRUE, the CHAP authentication method will not be used.
kk: Егер TRUE болса, CHAP аутентификация әдісі қолданылмайды.

source: If TRUE, the EAP authentication method will not be used.
kk: Егер TRUE болса, EAP аутентификация әдісі қолданылмайды.

source: If TRUE, the MSCHAP authentication method will not be used.
kk: Егер TRUE болса, MSCHAP аутентификация әдісі қолданылмайды.

source: If TRUE, the MSCHAPv2 authentication method will not be used.
kk: Егер TRUE болса, MSCHAPv2 аутентификация әдісі қолданылмайды.

source: If TRUE, the PAP authentication method will not be used.
kk: Егер TRUE болса, PAP аутентификация әдісі қолданылмайды.

source: If TRUE, MPPE (Microsoft Point-to-Point Encryption) will be required for the PPP session. If either 64-bit or 128-bit MPPE is not available the session will fail. Note that MPPE is not used on mobile broadband connections.
kk: Егер TRUE болса, PPP сессиясы үшін MPPE (Microsoft Point-to-Point Encryption) талап етіледі. Егер 64 биттік немесе 128 биттік MPPE қолжетімді болмаса, сессия сәтсіз аяқталады. Ескеріңіз, MPPE мобильді кең жолақты қосылымдарда қолданылмайды.

source: If TRUE, 128-bit MPPE (Microsoft Point-to-Point Encryption) will be required for the PPP session, and the "require-mppe" property must also be set to TRUE. If 128-bit MPPE is not available the session will fail.
kk: Егер TRUE болса, PPP сессиясы үшін 128 биттік MPPE (Microsoft Point-to-Point Encryption) талап етіледі және "require-mppe" қасиеті де TRUE мәніне орнатылуы керек. Егер 128 биттік MPPE қолжетімді болмаса, сессия сәтсіз аяқталады.

source: If given, specifies the parent interface name on which this PPPoE connection should be created. If this property is not specified, the connection is activated on the interface specified in "interface-name" of NMSettingConnection.
kk: Берілген болса, осы PPPoE қосылымы жасалуы керек негізгі интерфейс атын көрсетеді. Егер бұл қасиет көрсетілмесе, қосылым NMSettingConnection "interface-name" ішінде көрсетілген интерфейсте белсендіріледі.

source: Password used to authenticate with the PPPoE service.
kk: PPPoE қызметімен аутентификациялау үшін қолданылатын пароль.

source: If specified, instruct PPPoE to only initiate sessions with access concentrators that provide the specified service. For most providers, this should be left blank. It is only required if there are multiple access concentrators or a specific service is known to be required.
kk: Көрсетілсе, PPPoE-ге тек көрсетілген қызметті ұсынатын қатынау концентраторларымен сессияларды бастауды нұсқаңыз. Көптеген провайдерлер үшін бұл бос қалуы керек. Бұл тек бірнеше қатынау концентраторлары болса немесе белгілі бір қызмет талап етілетіні белгілі болса ғана қажет.

source: Username used to authenticate with the PPPoE service.
kk: PPPoE қызметімен аутентификациялау үшін қолданылатын пайдаланушы аты.

source: Whether the proxy configuration is for browser only.
kk: Прокси конфигурациясы тек браузер үшін бе.

source: Method for proxy configuration, Default is "none" (0)
kk: Прокси конфигурациясының әдісі, Әдепкі "none" (0)

source: The PAC script. In the profile this must be an UTF-8 encoded javascript code that defines a FindProxyForURL() function. When setting the property in nmcli, a filename is accepted too. In that case, nmcli will read the content of the file and set the script. The prefixes "file://" and "js://" are supported to explicitly differentiate between the two.
kk: PAC скрипті. Профильде бұл FindProxyForURL() функциясын анықтайтын UTF-8 кодталған javascript коды болуы керек. nmcli-де қасиетті орнату кезінде файл аты да қабылданады. Ол жағдайда, nmcli файл мазмұнын оқып, скриптті орнатады. "file://" және "js://" префикстеріне екеуін айқын ажырату үшін қолдау көрсетіледі.

source: PAC URL for obtaining PAC file.
kk: PAC файлын алуға арналған PAC URL.

source: Speed to use for communication over the serial port. Note that this value usually has no effect for mobile broadband modems as they generally ignore speed settings and use the highest available speed.
kk: Сериялық порт арқылы қосылым үшін қолданылатын жылдамдық. Ескеріңіз, бұл мән әдетте мобильді кең жолақты модемдер үшін әсер етпейді, өйткені олар әдетте жылдамдық баптауларын елемейді және ең жоғары қолжетімді жылдамдықты қолданады.

source: Byte-width of the serial communication. The 8 in "8n1" for example.
kk: Сериялық қосылымның байт ені. Мысалы, "8n1" ішіндегі 8.

source: Parity setting of the serial port.
kk: Сериялық порттың жұптылық баптауы.

source: Time to delay between each byte sent to the modem, in microseconds.
kk: Модемге жіберілген әр байт арасындағы кідіріс уақыты, микросекундпен.

source: Number of stop bits for communication on the serial port. Either 1 or 2. The 1 in "8n1" for example.
kk: Сериялық порттағы қосылым үшін тоқтату биттерінің саны. 1 немесе 2. Мысалы, "8n1" ішіндегі 1.

source: Whether to autoprobe virtual functions by a compatible driver. If set to "true" (1), the kernel will try to bind VFs to a compatible driver and if this succeeds a new network interface will be instantiated for each VF. If set to "false" (0), VFs will not be claimed and no network interfaces will be created for them. When set to "default" (-1), the global default is used; in case the global default is unspecified it is assumed to be "true" (1).
kk: Үйлесімді драйвер арқылы виртуалды функцияларды автотексеру керек пе. Егер "true" (1) мәніне орнатылса, ядро VF-терді үйлесімді драйверге байланыстыруға тырысады және бұл сәтті болса, әр VF үшін жаңа желілік интерфейс жасалады. Егер "false" (0) мәніне орнатылса, VF-тер талап етілмейді және олар үшін ешқандай желілік интерфейс жасалмайды. "default" (-1) мәніне орнатылған кезде, глобалды әдепкі қолданылады; глобалды әдепкі көрсетілмеген жағдайда, ол "true" (1) деп есептеледі.

source: Select the eswitch encapsulation support. Currently it's only supported for PCI PF devices, and only if the eswitch device is managed from the same PCI address than the PF. If set to "preserve" (-1) (default) the eswitch encap-mode won't be modified by NetworkManager.
kk: eswitch инкапсуляция қолдауын таңдаңыз. Қазіргі уақытта оған тек PCI PF құрылғылары үшін және eswitch құрылғысы PF сияқты бірдей PCI адресінен басқарылған жағдайда ғана қолдау көрсетіледі. Егер "preserve" (-1) (әдепкі) орнатылса, eswitch encap-mode NetworkManager арқылы өзгертілмейді.

source: Select the eswitch inline-mode of the device. Some HWs need the VF driver to put part of the packet headers on the TX descriptor so the e-switch can do proper matching and steering. Currently it's only supported for PCI PF devices, and only if the eswitch device is managed from the same PCI address than the PF. If set to "preserve" (-1) (default) the eswitch inline-mode won't be modified by NetworkManager.
kk: Құрылғының eswitch inline-mode таңдаңыз. Кейбір HW-лерге e-switch дұрыс сәйкестендіруді және басқаруды орындай алуы үшін VF драйверінің TX дескрипторына пакет тақырыптамаларының бөлігін қоюы қажет. Қазіргі уақытта оған тек PCI PF құрылғылары үшін және eswitch құрылғысы PF сияқты бірдей PCI адресінен басқарылған жағдайда ғана қолдау көрсетіледі. Егер "preserve" (-1) (әдепкі) орнатылса, eswitch inline-mode NetworkManager арқылы өзгертілмейді.

source: Select the eswitch mode of the device. Currently it's only supported for PCI PF devices, and only if the eswitch device is managed from the same PCI address than the PF. If set to "preserve" (-1) (default) the eswitch mode won't be modified by NetworkManager.
kk: Құрылғының eswitch режимін таңдаңыз. Қазіргі уақытта оған тек PCI PF құрылғылары үшін және eswitch құрылғысы PF сияқты бірдей PCI адресінен басқарылған жағдайда ғана қолдау көрсетіледі. Егер "preserve" (-1) (әдепкі) орнатылса, eswitch режимі NetworkManager арқылы өзгертілмейді.

source: This controls whether NetworkManager preserves the SR-IOV parameters set on the device when the connection is deactivated, or whether it resets them to their default value. The SR-IOV parameters are those specified in this setting (the "sriov" setting), like the number of VFs to create, the eswitch configuration, etc. If set to "no" (0), NetworkManager resets the SR-IOV parameters when the connection is deactivated. When set to "yes" (1), NetworkManager preserves those parameters on the device. If the value is "default" (-1), NetworkManager looks up a global default value in the configuration; in case no such value is defined, it uses "no" (0) as fallback.
kk: Бұл NetworkManager қосылым сөндірілген кезде құрылғыда орнатылған SR-IOV параметрлерін сақтайтынын немесе оларды әдепкі мәніне қайтаратынын басқарады. SR-IOV параметрлері — бұл осы баптауда ("sriov" баптауы) көрсетілгендер, мысалы жасалатын VF саны, eswitch конфигурациясы, т.б. Егер "no" (0) мәніне орнатылса, NetworkManager қосылым сөндірілген кезде SR-IOV параметрлерін қайтарады. "yes" (1) мәніне орнатылған кезде, NetworkManager сол параметрлерді құрылғыда сақтайды. Егер мән "default" (-1) болса, NetworkManager конфигурацияда глобалды әдепкі мәнді іздейді; егер ондай мән анықталмаса, резервтік нұсқа ретінде "no" (0) қолданады.

source: The total number of virtual functions to create. Note that when the sriov setting is present NetworkManager enforces the number of virtual functions on the interface (also when it is zero) during activation and resets it upon deactivation. To prevent any changes to SR-IOV parameters don't add a sriov setting to the connection.
kk: Жасалатын виртуалды функциялардың жалпы саны. Ескеріңіз, sriov баптауы бар болған кезде, NetworkManager белсендіру кезінде интерфейстегі виртуалды функциялардың санын мәжбүрлейді (ол нөл болған кезде де) және сөндіру кезінде оны қайтарады. SR-IOV параметрлеріне кез келген өзгерістерді болдырмау үшін қосылымға sriov баптауын қоспаңыз.

source: Array of virtual function descriptors. Each VF descriptor is a dictionary mapping attribute names to GVariant values. The 'index' entry is mandatory for each VF. When represented as string a VF is in the form: "INDEX [ATTR=VALUE[ ATTR=VALUE]...]". for example: "2 mac=00:11:22:33:44:55 spoof-check=true". Multiple VFs can be specified using a comma as separator. Currently, the following attributes are supported: mac, spoof-check, trust, min-tx-rate, max-tx-rate, vlans. The "vlans" attribute is represented as a semicolon-separated list of VLAN descriptors, where each descriptor has the form "ID[.PRIORITY[.PROTO]]". PROTO can be either 'q' for 802.1Q (the default) or 'ad' for 802.1ad.
kk: Виртуалды функция дескрипторларының массиві. Әр VF дескрипторы атрибут атауларын GVariant мәндеріне сәйкестендіретін сөздік болып табылады. 'index' жазбасы әр VF үшін міндетті. Жол ретінде көрсетілген кезде VF келесі пішімде болады: "ИНДЕКС [АТРИБУТ=МӘН[ АТРИБУТ=МӘН]...]". мысалы: "2 mac=00:11:22:33:44:55 spoof-check=true". Бірнеше VF-терді бөлуші ретінде үтірді қолдану арқылы көрсетуге болады. Қазіргі уақытта қолдау көрсетілетін атрибуттар: mac, spoof-check, trust, min-tx-rate, max-tx-rate, vlans. "vlans" атрибуты нүктелі үтірмен бөлінген VLAN дескрипторларының тізімі ретінде көрсетіледі, мұндағы әр дескриптор "ID[.БАСЫМДЫҚ[.ХАТТАМА]]" пішімінде болады. ХАТТАМА 802.1Q (әдепкі) үшін 'q' немесе 802.1ad үшін 'ad' болуы мүмкін.

source: Array of TC queueing disciplines. When the "tc" setting is present, qdiscs from this property are applied upon activation. If the property is empty, all qdiscs are removed and the device will only have the default qdisc assigned by kernel according to the "net.core.default_qdisc" sysctl. If the "tc" setting is not present, NetworkManager doesn't touch the qdiscs present on the interface.
kk: TC кезек тәртіптерінің массиві. "tc" баптауы бар болған кезде, осы қасиеттегі qdiscs белсендіру кезінде қолданылады. Егер қасиет бос болса, барлық qdiscs өшіріледі және құрылғыда тек "net.core.default_qdisc" sysctl-ге сәйкес ядро тағайындаған әдепкі qdisc болады. Егер "tc" баптауы жоқ болса, NetworkManager интерфейстегі qdiscs-ке тиіспейді.

source: Array of TC traffic filters. When the "tc" setting is present, filters from this property are applied upon activation. If the property is empty, NetworkManager removes all the filters. If the "tc" setting is not present, NetworkManager doesn't touch the filters present on the interface.
kk: TC трафик сүзгілерінің массиві. "tc" баптауы бар болған кезде, осы қасиеттегі сүзгілер белсендіру кезінде қолданылады. Егер қасиет бос болса, NetworkManager барлық сүзгілерді өшіреді. Егер "tc" баптауы жоқ болса, NetworkManager интерфейстегі сүзгілерге тиіспейді.

source: The JSON configuration for the team network interface. The property should contain raw JSON configuration data suitable for teamd, because the value is passed directly to teamd. If not specified, the default configuration is used. See man teamd.conf for the format details.
kk: team желілік интерфейсіне арналған JSON конфигурациясы. Қасиет teamd үшін жарамды шикі JSON конфигурация деректерін қамтуы керек, өйткені мән тікелей teamd-ге беріледі. Егер көрсетілмесе, әдепкі конфигурация қолданылады. Пішім мәліметтері үшін man teamd.conf қараңыз.

source: Link watchers configuration for the connection: each link watcher is defined by a dictionary, whose keys depend upon the selected link watcher. Available link watchers are 'ethtool', 'nsna_ping' and 'arp_ping' and it is specified in the dictionary with the key 'name'. Available keys are: ethtool: 'delay-up', 'delay-down', 'init-wait'; nsna_ping: 'init-wait', 'interval', 'missed-max', 'target-host'; arp_ping: all the ones in nsna_ping and 'source-host', 'validate-active', 'validate-inactive', 'send-always'. See teamd.conf man for more details.
kk: Қосылым үшін сілтеме бақылаушыларының конфигурациясы: әр сілтеме бақылаушысы сөздік арқылы анықталады, оның кілттері таңдалған сілтеме бақылаушысына байланысты. Қолжетімді сілтеме бақылаушылары 'ethtool', 'nsna_ping' және 'arp_ping' және ол сөздікте 'name' кілтімен көрсетіледі. Қолжетімді кілттер: ethtool: 'delay-up', 'delay-down', 'init-wait'; nsna_ping: 'init-wait', 'interval', 'missed-max', 'target-host'; arp_ping: nsna_ping ішіндегі барлығы және 'source-host', 'validate-active', 'validate-inactive', 'send-always'. Толығырақ ақпарат алу үшін teamd.conf man қараңыз.

source: Corresponds to the teamd mcast_rejoin.count.
kk: teamd mcast_rejoin.count сәйкес келеді.

source: Corresponds to the teamd mcast_rejoin.interval.
kk: teamd mcast_rejoin.interval сәйкес келеді.

source: Corresponds to the teamd notify_peers.count.
kk: teamd notify_peers.count сәйкес келеді.

source: Corresponds to the teamd notify_peers.interval.
kk: teamd notify_peers.interval сәйкес келеді.

source: Corresponds to the teamd runner.name. Permitted values are: "roundrobin", "broadcast", "activebackup", "loadbalance", "lacp", "random".
kk: teamd runner.name сәйкес келеді. Рұқсат етілген мәндер: "roundrobin", "broadcast", "activebackup", "loadbalance", "lacp", "random".

source: Corresponds to the teamd runner.active.
kk: teamd runner.active сәйкес келеді.

source: Corresponds to the teamd runner.agg_select_policy.
kk: teamd runner.agg_select_policy сәйкес келеді.

source: Corresponds to the teamd runner.fast_rate.
kk: teamd runner.fast_rate сәйкес келеді.

source: Corresponds to the teamd runner.hwaddr_policy.
kk: teamd runner.hwaddr_policy сәйкес келеді.

source: Corresponds to the teamd runner.min_ports.
kk: teamd runner.min_ports сәйкес келеді.

source: Corresponds to the teamd runner.sys_prio.
kk: teamd runner.sys_prio сәйкес келеді.

source: Corresponds to the teamd runner.tx_balancer.name.
kk: teamd runner.tx_balancer.name сәйкес келеді.

source: Corresponds to the teamd runner.tx_balancer.interval.
kk: teamd runner.tx_balancer.interval сәйкес келеді.

source: Corresponds to the teamd runner.tx_hash.
kk: teamd runner.tx_hash сәйкес келеді.

source: The JSON configuration for the team port. The property should contain raw JSON configuration data suitable for teamd, because the value is passed directly to teamd. If not specified, the default configuration is used. See man teamd.conf for the format details.
kk: team портына арналған JSON конфигурациясы. Қасиет teamd үшін жарамды шикі JSON конфигурация деректерін қамтуы керек, өйткені мән тікелей teamd-ге беріледі. Егер көрсетілмесе, әдепкі конфигурация қолданылады. Пішім мәліметтері үшін man teamd.conf қараңыз.

source: Corresponds to the teamd ports.PORTIFNAME.lacp_key.
kk: teamd ports.PORTIFNAME.lacp_key сәйкес келеді.

source: Corresponds to the teamd ports.PORTIFNAME.lacp_prio.
kk: teamd ports.PORTIFNAME.lacp_prio сәйкес келеді.

source: Corresponds to the teamd ports.PORTIFNAME.prio.
kk: teamd ports.PORTIFNAME.prio сәйкес келеді.

source: Corresponds to the teamd ports.PORTIFNAME.queue_id. When set to -1 means the parameter is skipped from the json config.
kk: teamd ports.PORTIFNAME.queue_id сәйкес келеді. -1 мәніне орнатылған кезде параметр json конфигурациясынан өткізіп жіберілетінін білдіреді.

source: Corresponds to the teamd ports.PORTIFNAME.sticky.
kk: teamd ports.PORTIFNAME.sticky сәйкес келеді.
