Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Error: value for '%s' argument is required.
kk: Қате: '%s' аргументі үшін мән қажет.

source: Error: 'save': %s.
kk: Қате: 'save': %s.

source: Error: '%s' argument is required.
kk: Қате: '%s' аргументі қажет.

source: ['%s' setting values]
kk: ['%s' баптау мәндері]

source: ---[ Main menu ]--- goto [<setting> | <prop>] :: go to a setting or property remove <setting>[.<prop>] | <prop> :: remove setting or reset property value set [<setting>.<prop> <value>] :: set property value describe [<setting>.<prop>] :: describe property print [all | <setting>[.<prop>]] :: print the connection verify [all | fix] :: verify the connection save [persistent|temporary] :: save the connection activate [<ifname>] [/<ap>|<nsp>] :: activate the connection back :: go one level up (back) help/? [<command>] :: print this help nmcli <conf-option> <value> :: nmcli configuration quit :: exit nmcli
kk: ---[ Басты мәзір ]--- goto [<setting> | <prop>] :: баптауға немесе қасиетке өту remove <setting>[.<prop>] | <prop> :: баптауды өшіру не қасиет мәнін тастау set [<setting>.<prop> <value>] :: қасиет мәнін орнату describe [<setting>.<prop>] :: қасиетті сипаттау print [all | <setting>[.<prop>]] :: қосылымды шығару verify [all | fix] :: қосылымды тексеру save [persistent|temporary] :: қосылымды сақтау activate [<ifname>] [/<ap>|<nsp>] :: қосылымды белсендіру back :: бір деңгейге жоғары өту (артқа) help/? [<command>] :: осы көмекті шығару nmcli <conf-option> <value> :: nmcli баптауы quit :: nmcli-дан шығу

source: goto <setting>[.<prop>] | <prop> :: enter setting/property for editing This command enters into a setting or property for editing it. Examples: nmcli> goto connection nmcli connection> goto secondaries nmcli> goto ipv4.addresses
kk: goto <setting>[.<prop>] | <prop> :: түзету үшін баптауға/қасиетке кіру Бұл команда оны түзету үшін баптауға немесе қасиетке кіреді. Мысалдар: nmcli> goto connection nmcli connection> goto secondaries nmcli> goto ipv4.addresses

source: remove <setting>[.<prop>] :: remove setting or reset property value This command removes an entire setting from the connection, or if a property is given, resets that property to the default value. Examples: nmcli> remove wifi-sec nmcli> remove eth.mtu
kk: remove <setting>[.<prop>] :: баптауды өшіру немесе қасиет мәнін тастау Бұл команда қосылымнан толық баптауды өшіреді, немесе егер қасиет берілсе, сол қасиетті бастапқы мәніне қайтарады. Мысалдар: nmcli> remove wifi-sec nmcli> remove eth.mtu

source: set [<setting>.<prop> <value>] :: set property value This command sets property value. Example: nmcli> set con.id My connection
kk: set [<setting>.<prop> <value>] :: қасиет мәнін орнату Бұл команда қасиет мәнін орнатады. Мысал: nmcli> set con.id My connection

source: add [<setting>.<prop> <value>] :: add property value This command appends property value. Example: nmcli> add ipv4.addresses 192.168.1.1/24
kk: add [<setting>.<prop> <value>] :: қасиет мәнін қосу Бұл команда қасиет мәнін соңына жалғайды. Мысал: nmcli> add ipv4.addresses 192.168.1.1/24

source: describe [<setting>.<prop>] :: describe property Shows property description. You can consult nm-settings(5) manual page to see all NM settings and properties.
kk: describe [<setting>.<prop>] :: қасиетті сипаттау Қасиет сипаттамасын көрсетеді. Барлық NM баптаулары мен қасиеттерін көру үшін nm-settings(5) нұсқаулық бетін қарай аласыз.

source: print [all] :: print setting or connection values Shows current property or the whole connection. Example: nmcli ipv4> print all
kk: print [all] :: баптау немесе қосылым мәндерін шығару Ағымдағы қасиетті немесе толық қосылымды көрсетеді. Мысал: nmcli ipv4> print all

source: verify [all | fix] :: verify setting or connection validity Verifies whether the setting or connection is valid and can be saved later. It indicates invalid values on error. Some errors may be fixed automatically by 'fix' option. Examples: nmcli> verify nmcli> verify fix nmcli bond> verify
kk: verify [all | fix] :: баптау немесе қосылым жарамдылығын тексеру Баптау немесе қосылымның жарамды екенін және кейін сақталуы мүмкін екенін тексереді. Ол қате кезінде жарамсыз мәндерді көрсетеді. Кейбір қателер 'fix' опциясы арқылы автоматты түрде түзетілуі мүмкін. Мысалдар: nmcli> verify nmcli> verify fix nmcli bond> verify

source: save [persistent|temporary] :: save the connection Sends the connection profile to NetworkManager that either will save it persistently, or will only keep it in memory. 'save' without an argument means 'save persistent'. Note that once you save the profile persistently those settings are saved across reboot or restart. Subsequent changes can also be temporary or persistent, but any temporary changes will not persist across reboot or restart. If you want to fully remove the persistent connection, the connection profile must be deleted.
kk: save [persistent|temporary] :: қосылымды сақтау Қосылым профилін NetworkManager-ге жібереді, ол оны тұрақты түрде сақтайды немесе тек жадыда қалдырады. Аргументсіз 'save' командасы 'save persistent' (тұрақты сақтау) дегенді білдіреді. Профильді тұрақты сақтағаннан кейін, сол баптаулар қайта іске қосу немесе қайта жүктеу кезінде сақталатынын ескеріңіз. Кейінгі өзгерістер де уақытша немесе тұрақты болуы мүмкін, бірақ кез келген уақытша өзгерістер қайта жүктеу кезінде сақталмайды. Егер тұрақты қосылымды толығымен өшіргіңіз келсе, қосылым профилін өшіру қажет.

source: activate [<ifname>] [/<ap>|<nsp>] :: activate the connection Activates the connection. Available options: <ifname> - device the connection will be activated on /<ap>|<nsp> - AP (Wi-Fi) or NSP (WiMAX) (prepend with / when <ifname> is not specified)
kk: activate [<ifname>] [/<ap>|<nsp>] :: қосылымды белсендіру Қосылымды белсендіреді. Қолжетімді опциялар: <ifname> - қосылым белсендірілетін құрылғы /<ap>|<nsp> - AP (Wi-Fi) немесе NSP (WiMAX) (<ifname> көрсетілмеген жағдайда алдына / қойыңыз)

source: back :: go to upper menu level
kk: back :: жоғарғы мәзір деңгейіне өту

source: help/? [<command>] :: help for the nmcli commands
kk: help/? [<command>] :: nmcli командалары үшін көмек

source: nmcli [<conf-option> <value>] :: nmcli configuration Configures nmcli. The following options are available: status-line yes | no [default: no] save-confirmation yes | no [default: yes] show-secrets yes | no [default: no] prompt-color <color> | <0-8> [default: 0] %s Examples: nmcli> nmcli status-line yes nmcli> nmcli save-confirmation no nmcli> nmcli prompt-color 3
kk: nmcli [<conf-option> <value>] :: nmcli конфигурациясы nmcli-ді баптайды. Келесі опциялар қолжетімді: status-line yes | no [бастапқы: no] save-confirmation yes | no [бастапқы: yes] show-secrets yes | no [бастапқы: no] prompt-color <color> | <0-8> [бастапқы: 0] %s Мысалдар: nmcli> nmcli status-line yes nmcli> nmcli save-confirmation no nmcli> nmcli prompt-color 3

source: quit :: exit nmcli This command exits nmcli. When the connection being edited is not saved, the user is asked to confirm the action.
kk: quit :: nmcli-дан шығу Бұл команда nmcli-дан шығады. Түзетіліп жатқан қосылым сақталмаған болса, пайдаланушыдан әрекетті растау сұралады.

source: Unknown command: '%s'
kk: Белгісіз команда: '%s'

source: ---[ Property menu ]--- set [<value>] :: set new value add [<value>] :: add new option to the property change :: change current value remove [<index> | <option>] :: delete the value describe :: describe property print [setting | connection] :: print property (setting/connection) value(s) back :: go to upper level help/? [<command>] :: print this help or command description quit :: exit nmcli
kk: ---[ Қасиет мәзірі ]--- set [<value>] :: жаңа мән орнату add [<value>] :: қасиетке жаңа опция қосу change :: ағымдағы мәнді өзгерту remove [<index> | <option>] :: мәнді өшіру describe :: қасиетті сипаттау print [setting | connection] :: қасиет (баптау/қосылым) мән(дер)ін шығару back :: жоғарғы деңгейге өту help/? [<command>] :: осы көмекті немесе команда сипаттамасын шығару quit :: nmcli-дан шығу

source: set [<value>] :: set new value This command sets provided <value> to this property
kk: set [<value>] :: жаңа мән орнату Бұл команда ұсынылған <value> мәнін осы қасиетке орнатады

source: add [<value>] :: append new value to the property This command adds provided <value> to this property, if the property is of a container type. For single-valued properties the property value is replaced (same as 'set').
kk: add [<value>] :: қасиетке жаңа мән жалғау Бұл команда ұсынылған <value> мәнін осы қасиетке қосады (егер қасиет контейнер түрінде болса). Бір мәнді қасиеттер үшін қасиет мәні ауыстырылады ('set' сияқты).

source: change :: change current value Displays current value and allows editing it.
kk: change :: ағымдағы мәнді өзгерту Ағымдағы мәнді көрсетеді және оны түзетуге мүмкіндік береді.

source: remove [<value>|<index>|<option name>] :: delete the value Removes the property value. For single-valued properties, this sets the property back to its default value. For container-type properties, this removes all the values of that property or you can specify an argument to remove just a single item or option. The argument is either a value or index of the item to remove, or an option name (for properties with named options). Examples: nmcli ipv4.dns> remove 8.8.8.8 nmcli ipv4.dns> remove 2 nmcli bond.options> remove downdelay
kk: remove [<value>|<index>|<option name>] :: мәнді өшіру Қасиет мәнін өшіреді. Бір мәнді қасиеттер үшін бұл қасиетті оның бастапқы мәніне қайтарады. Контейнерлік типтегі қасиеттер үшін бұл сол қасиеттің барлық мәндерін өшіреді немесе бір элементті не опцияны өшіру үшін аргумент көрсете аласыз. Аргумент өшірілетін элементтің мәні не индексі, немесе опция атауы (аталған опциялары бар қасиеттер үшін) болуы мүмкін. Мысалдар: nmcli ipv4.dns> remove 8.8.8.8 nmcli ipv4.dns> remove 2 nmcli bond.options> remove downdelay

source: describe :: describe property Shows property description. You can consult nm-settings(5) manual page to see all NM settings and properties.
kk: describe :: қасиетті сипаттау Қасиет сипаттамасын көрсетеді. Барлық NM баптаулары мен қасиеттерін көру үшін nm-settings(5) нұсқаулық бетін қарай аласыз.

source: print [property|setting|connection] :: print property (setting, connection) value(s) Shows property value. Providing an argument you can also display values for the whole setting or connection.
kk: print [property|setting|connection] :: қасиет (баптау, қосылым) мән(дер)ін шығару Қасиет мәнін көрсетеді. Аргумент бере отырып, сондай-ақ толық баптау немесе қосылым үшін мәндерді көрсете аласыз.

source: help/? [<command>] :: help for nmcli commands
kk: help/? [<command>] :: nmcli командалары үшін көмек

source: Error: Connection activation failed.
kk: Қате: Қосылымды белсендіру сәтсіз аяқталды.

source: [ Type: %s | Name: %s | UUID: %s | Dirty: %s | Temp: %s ]
kk: [ Түрі: %s | Аты: %s | UUID: %s | Өзгерген: %s | Уақытша: %s ]

source: The connection is not saved. Do you really want to quit? %s
kk: Қосылым сақталмаған. Шынымен шыққыңыз келе ме? %s

source: The connection profile has been removed from another client. You may type 'save' in the main menu to restore it.
kk: Қосылым профилі басқа клиенттен өшірілді. Оны қалпына келтіру үшін басты мәзірде 'save' теруіңізге болады.

source: Allowed values for '%s' property: %s
kk: '%s' қасиеті үшін рұқсат етілген мәндер: %s

source: Enter '%s' value:
kk: '%s' мәнін енгізіңіз:

source: Error: failed to set '%s' property: %s
kk: Қате: '%s' қасиетін орнату сәтсіз аяқталды: %s

source: Edit '%s' value:
kk: '%s' мәнін түзету:

source: Error: %s
kk: Қате: %s

source: Unknown command argument: '%s'
kk: Белгісіз команда аргументі: '%s'

source: Available settings: %s
kk: Қолжетімді баптаулар: %s

source: Error: invalid setting name; %s
kk: Қате: жарамсыз баптау атауы; %s

source: Available properties: %s
kk: Қолжетімді қасиеттер: %s

source: Error: property %s
kk: Қате: %s қасиеті

source: Saving the connection with 'autoconnect=yes'. That might result in an immediate activation of the connection. Do you still want to save? %s
kk: Қосылымды 'autoconnect=yes' параметрімен сақтау. Бұл қосылымның дереу белсендірілуіне әкелуі мүмкін. Дегенмен сақтағыңыз келе ме? %s

source: You may edit the following settings: %s
kk: Келесі баптауларды түзете аласыз: %s

source: The connection profile has been removed from another client. You may type 'save' to restore it.
kk: Қосылым профилі басқа клиенттен өшірілді. Оны қалпына келтіру үшін 'save' теруіңізге болады.

source: Error: no setting selected; valid are [%s]
kk: Қате: ешқандай баптау таңдалмаған; жарамдылары: [%s]

source: use 'goto <setting>' first, or 'set <setting>.<property>'
kk: алдымен 'goto <setting>' немесе 'set <setting>.<property>' қолданыңыз

source: Error: invalid setting argument '%s'; valid are [%s]
kk: Қате: жарамсыз баптау аргументі '%s'; жарамдылары: [%s]

source: Error: missing setting for '%s' property
kk: Қате: '%s' қасиеті үшін баптау жетіспейді

source: Error: invalid property: %s
kk: Қате: жарамсыз қасиет: %s

source: Error: unknown setting '%s'
kk: Қате: белгісіз баптау '%s'

source: You may edit the following properties: %s
kk: Келесі қасиеттерді түзете аласыз: %s

source: Error: failed to remove value of '%s': %s
kk: Қате: '%s' мәнін өшіру сәтсіз аяқталды: %s

source: Error: no argument given; valid are [%s]
kk: Қате: аргумент берілмеген; жарамдылары: [%s]

source: Setting '%s' is not present in the connection.
kk: '%s' баптауы қосылымда жоқ.

source: Error: %s properties, nor it is a setting name.
kk: Қате: %s қасиеттері, немесе ол баптау атауы емес.

source: use 'goto <setting>' first, or 'describe <setting>.<property>'
kk: алдымен 'goto <setting>' немесе 'describe <setting>.<property>' қолданыңыз

source: Error: invalid property: %s, neither a valid setting name.
kk: Қате: жарамсыз қасиет: %s, жарамды баптау атауы да емес.

source: Error: unknown setting: '%s'
kk: Қате: белгісіз баптау: '%s'

source: Error: '%s' setting not present in the connection
kk: Қате: '%s' баптауы қосылымда жоқ

source: Error: invalid property: %s%s
kk: Қате: жарамсыз қасиет: %s%s

source: , neither a valid setting name
kk: , жарамды баптау атауы да емес

source: Invalid verify option: %s
kk: Жарамсыз тексеру опциясы: %s

source: Verify setting '%s': %s
kk: '%s' баптауын тексеру: %s

source: Verify connection: %s
kk: Қосылымды тексеру: %s

source: The error cannot be fixed automatically.
kk: Қатені автоматты түрде түзету мүмкін емес.

source: Error: invalid argument '%s'
kk: Қате: жарамсыз аргумент '%s'

source: Error: Failed to save '%s' (%s) connection: %s
kk: Қате: '%s' (%s) қосылымын сақтау сәтсіз аяқталды: %s

source: Error: Timeout saving '%s' (%s) connection
kk: Қате: '%s' (%s) қосылымын сақтау мерзімі аяқталды

source: Connection '%s' (%s) successfully saved.
kk: '%s' (%s) қосылымы сәтті сақталды.

source: Connection '%s' (%s) successfully updated.
kk: '%s' (%s) қосылымы сәтті жаңартылды.

source: Error: connection verification failed: %s
kk: Қате: қосылымды тексеру сәтсіз аяқталды: %s

source: (unknown error)
kk: (белгісіз қате)

source: You may try running 'verify fix' to fix errors.
kk: Қателерді түзету үшін 'verify fix' орындап көріңіз.

source: Error: connection is not saved. Type 'save' first.
kk: Қате: қосылым сақталмаған. Алдымен 'save' теріңіз.

source: Error: connection is not valid: %s
kk: Қате: қосылым жарамсыз: %s

source: Error: Cannot activate connection: %s.
kk: Қате: Қосылымды белсендіру мүмкін емес: %s.

source: Error: Failed to activate '%s' (%s) connection: %s
kk: Қате: '%s' (%s) қосылымын белсендіру сәтсіз аяқталды: %s

source: Monitoring connection activation (press any key to continue)
kk: Қосылым белсендіруін бақылау (жалғастыру үшін кез келген пернені басыңыз)

source: Error: status-line: %s
kk: Қате: status-line: %s

source: Error: save-confirmation: %s
kk: Қате: save-confirmation: %s

source: Error: show-secrets: %s
kk: Қате: show-secrets: %s

source: Current nmcli configuration:
kk: Ағымдағы nmcli конфигурациясы:

source: Invalid configuration option '%s'; allowed [%s]
kk: Жарамсыз конфигурация опциясы '%s'; рұқсат етілгендері [%s]

source: Error: only one of 'id', 'filename', uuid, or 'path' can be provided.
kk: Қате: тек 'id', 'filename', uuid немесе 'path' біреуін ғана беруге болады.

source: Error: Unknown connection '%s'.
kk: Қате: Белгісіз қосылым '%s'.

source: Warning: editing existing connection '%s'; 'type' argument is ignored
kk: Ескерту: бар '%s' қосылымы түзетілуде; 'type' аргументі еленбейді

source: Warning: editing existing connection '%s'; 'con-name' argument is ignored
kk: Ескерту: бар '%s' қосылымы түзетілуде; 'con-name' аргументі еленбейді

source: Valid connection types: %s
kk: Жарамды қосылым түрлері: %s

source: Error: invalid connection type; %s
kk: Қате: қосылым түрі жарамсыз: %s

source: ===| nmcli interactive connection editor |===
kk: ===| nmcli интерактивті қосылым түзеткіші |===

source: Editing existing '%s' connection: '%s'
kk: Бар '%s' қосылымын түзету: '%s'

source: Adding a new '%s' connection
kk: Жаңа '%s' қосылымын қосу

source: Type 'help' or '?' for available commands.
kk: Қолжетімді командалар үшін 'help' немесе '?' теріңіз.

source: Type 'print' to show all the connection properties.
kk: Барлық қосылым қасиеттерін көрсету үшін 'print' теріңіз.

source: Type 'describe [<setting>.<prop>]' for detailed property description.
kk: Қасиеттің толық сипаттамасы үшін 'describe [<setting>.<prop>]' теріңіз.

source: Error: Failed to modify connection '%s': %s
kk: Қате: '%s' қосылымын өзгерту сәтсіз аяқталды: %s

source: Connection '%s' (%s) successfully modified.
kk: '%s' (%s) қосылымы сәтті өзгертілді.

source: %s (%s) cloned as %s (%s).
kk: %s (%s) көшірмесі %s (%s) ретінде жасалды.

source: New connection name:
kk: Жаңа қосылым аты:

source: Error: <new name> argument is missing.
kk: Қате: <new name> аргументі жоқ.

source: Error: unknown extra argument: '%s'.
kk: Қате: белгісіз қосымша аргумент: '%s'.

source: Error: not all connections deleted.
kk: Қате: барлық қосылымдар өшірілмеді.

source: Error: Connection deletion failed: %s
kk: Қате: Қосылымды өшіру сәтсіз аяқталды: %s

source: Error: %s.
kk: Қате: %s.

source: Error: not all connections found.
kk: Қате: барлық қосылымдар табылмады.

source: Error: cannot delete unknown connection(s): %s.
kk: Қате: белгісіз қосылым(дар)ды өшіру мүмкін емес: %s.

source: %s: connection profile changed
kk: %s: қосылым профилі өзгертілді

source: %s: connection profile created
kk: %s: қосылым профилі жасалды

source: %s: connection profile removed
kk: %s: қосылым профилі өшірілді

source: Error: failed to reload connections: %s.
kk: Қате: қосылымдарды қайта жүктеу сәтсіз аяқталды: %s.

source: Error: failed to load connection: %s.
kk: Қате: қосылымды жүктеу сәтсіз аяқталды: %s.

source: Could not load file '%s'
kk: '%s' файлын жүктеу мүмкін емес

source: File to import:
kk: Импортталатын файл:

source: Error: No arguments provided.
kk: Қате: Ешқандай аргумент берілмеген.

source: Error: 'type' argument is required.
kk: Қате: 'type' аргументі қажет.

source: Error: 'file' argument is required.
kk: Қате: 'file' аргументі қажет.

source: Error: failed to find VPN plugin for %s.
kk: Қате: %s үшін VPN плагинін табу сәтсіз аяқталды.

source: Error: failed to load VPN plugin: %s.
kk: Қате: VPN плагинін жүктеу сәтсіз аяқталды: %s.

source: Error: failed to import '%s': %s.
kk: Қате: '%s' импорттау сәтсіз аяқталды: %s.

source: Output file name:
kk: Шығыс файл аты:

source: Error: the connection is not VPN.
kk: Қате: қосылым VPN емес.

source: Error: failed to create temporary file %s.
kk: Қате: %s уақытша файлын жасау сәтсіз аяқталды.

source: Error: failed to export '%s': %s.
kk: Қате: '%s' экспорттау сәтсіз аяқталды: %s.

source: Error: failed to read temporary file '%s': %s.
kk: Қате: '%s' уақытша файлын оқу сәтсіз аяқталды: %s.

source: Error: not all connections migrated.
kk: Қате: барлық қосылымдар көшірілмеді.

source: Error: Connection migration failed: %s
kk: Қате: Қосылымды көшіру сәтсіз аяқталды: %s

source: Connection '%s' (%s) successfully migrated.
kk: '%s' (%s) қосылымы сәтті көшірілді.

source: '--plugin' argument is missing
kk: '--plugin' аргументі жоқ

source: Error: cannot migrate unknown connection(s): %s.
kk: Қате: белгісіз қосылым(дар)ды көшіру мүмкін емес: %s.

source: Interface:
kk: Интерфейс:

source: Interface(s):
kk: Интерфейс(тер):

source: (none)
kk: (жоқ)

source: <invisible> | %s
kk: <көрінбейтін> | %s

source: <invisible>
kk: <көрінбейтін>

source: %u Mb/s
kk: %u Мб/с

source: Usage: nmcli device { COMMAND | help } COMMAND := { status | show | set | connect | reapply | modify | disconnect | delete | monitor | wifi | lldp } status show [<ifname>] set [ifname] <ifname> [autoconnect yes|no] [managed yes|no] connect <ifname> reapply <ifname> modify <ifname> ([+|-]<setting>.<property> <value>)+ disconnect <ifname> ... delete <ifname> ... monitor <ifname> ... wifi [list [ifname <ifname>] [bssid <BSSID>] [--rescan yes|no|auto]] wifi connect <(B)SSID> [password <password>] [wep-key-type key|phrase] [ifname <ifname>] [bssid <BSSID>] [name <name>] [private yes|no] [hidden yes|no] wifi hotspot [ifname <ifname>] [con-name <name>] [ssid <SSID>] [band a|bg|6GHz] [channel <channel>] [password <password>] wifi rescan [ifname <ifname>] [[ssid <SSID to scan>] ...] wifi show-password [ifname <ifname>] lldp [list [ifname <ifname>]]
kk: Қолданылуы: nmcli device { COMMAND | help } COMMAND := { status | show | set | connect | reapply | modify | disconnect | delete | monitor | wifi | lldp } status show [<ifname>] set [ifname] <ifname> [autoconnect yes|no] [managed yes|no] connect <ifname> reapply <ifname> modify <ifname> ([+|-]<setting>.<property> <value>)+ disconnect <ifname> ... delete <ifname> ... monitor <ifname> ... wifi [list [ifname <ifname>] [bssid <BSSID>] [--rescan yes|no|auto]] wifi connect <(B)SSID> [password <password>] [wep-key-type key|phrase] [ifname <ifname>] [bssid <BSSID>] [name <name>] [private yes|no] [hidden yes|no] wifi hotspot [ifname <ifname>] [con-name <name>] [ssid <SSID>] [band a|bg|6GHz] [channel <channel>] [password <password>] wifi rescan [ifname <ifname>] [[ssid <SSID to scan>] ...] wifi show-password [ifname <ifname>] lldp [list [ifname <ifname>]]

source: Usage: nmcli device status { help } Show status for all devices. By default, the following columns are shown: DEVICE - interface name TYPE - device type STATE - device state CONNECTION - connection activated on device (if any) Displayed columns can be changed using '--fields' global option. 'status' is the default command, which means 'nmcli device' calls 'nmcli device status'.
kk: Қолданылуы: nmcli device status { help } Барлық құрылғылар үшін күйді көрсету. Әдепкі бойынша, келесі бағандар көрсетіледі: DEVICE - интерфейс аты TYPE - құрылғы түрі STATE - құрылғы күйі CONNECTION - құрылғыда белсендірілген қосылым (егер болса) Көрсетілетін бағандарды '--fields' глобалды опциясы арқылы өзгертуге болады. 'status' — әдепкі команда, яғни 'nmcli device' командасы 'nmcli device status' командасын шақырады.

source: Usage: nmcli device show { ARGUMENTS | help } ARGUMENTS := [<ifname>] Show details of device(s). The command lists details for all devices, or for a given device.
kk: Қолданылуы: nmcli device show { ARGUMENTS | help } ARGUMENTS := [<ifname>] Құрылғы(лар)дың егжей-тегжейін көрсету. Команда барлық құрылғылар немесе берілген құрылғы үшін егжей-тегжейді тізімдейді.
