Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Usage: nmcli device connect { ARGUMENTS | help } ARGUMENTS := <ifname> Connect the device. NetworkManager will try to find a suitable connection that will be activated. It will also consider connections that are not set to auto-connect.
kk: Қолданылуы: nmcli device connect { ARGUMENTS | help } ARGUMENTS := <ifname> Құрылғыны байланыстыру. NetworkManager белсендірілетін қолайлы қосылымды табуға тырысады. Ол сондай-ақ автоматты қосылуға орнатылмаған қосылымдарды да қарастырады.

source: Usage: nmcli device reapply { ARGUMENTS | help } ARGUMENTS := <ifname> Attempts to update device with changes to the currently active connection made since it was last applied.
kk: Қолданылуы: nmcli device reapply { ARGUMENTS | help } ARGUMENTS := <ifname> Соңғы қолданылғаннан бері жасалған ағымдағы белсенді қосылым өзгерістерімен құрылғыны жаңартуға әрекеттенеді.

source: Usage: nmcli device modify { ARGUMENTS | help } ARGUMENTS := <ifname> ([+|-]<setting>.<property> <value>)+ Modify one or more properties that are currently active on the device without modifying the connection profile. The changes have immediate effect. For multi-valued properties you can use optional '+' or '-' prefix to the property name. The '+' sign allows appending items instead of overwriting the whole value. The '-' sign allows removing selected items instead of the whole value. Examples: nmcli dev mod em1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli dev mod em1 +ipv4.dns 8.8.4.4 nmcli dev mod em1 -ipv4.dns 1 nmcli dev mod em1 -ipv6.addr "abbe::cafe/56"
kk: Қолданылуы: nmcli device modify { ARGUMENTS | help } ARGUMENTS := <ifname> ([+|-]<setting>.<property> <value>)+ Қосылым профилін өзгертпестен құрылғыда қазіргі уақытта белсенді бір немесе бірнеше қасиетті өзгерту. Өзгерістер дереу күшіне енеді. Көп мәнді қасиеттер үшін қасиет атауына қосымша '+' немесе '-' префиксін қолдануға болады. '+' белгісі бүкіл мәнді үстінен жазудың орнына элементтерді қосуға мүмкіндік береді. '-' белгісі бүкіл мәннің орнына таңдалған элементтерді өшіруге мүмкіндік береді. Мысалдар: nmcli dev mod em1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli dev mod em1 +ipv4.dns 8.8.4.4 nmcli dev mod em1 -ipv4.dns 1 nmcli dev mod em1 -ipv6.addr "abbe::cafe/56"

source: Usage: nmcli device disconnect { ARGUMENTS | help } ARGUMENTS := <ifname> ... Disconnect devices. The command disconnects the device and prevents it from auto-activating further connections without user/manual intervention.
kk: Қолданылуы: nmcli device disconnect { ARGUMENTS | help } ARGUMENTS := <ifname> ... Құрылғыларды ажырату. Команда құрылғыны ажыратады және пайдаланушы/қолмен араласусыз оның кейінгі қосылымдарды автоматты түрде белсендіруіне жол бермейді.

source: Usage: nmcli device delete { ARGUMENTS | help } ARGUMENTS := <ifname> ... Delete the software devices. The command removes the interfaces. It only works for software devices (like bonds, bridges, etc.). Hardware devices cannot be deleted by the command.
kk: Қолданылуы: nmcli device delete { ARGUMENTS | help } ARGUMENTS := <ifname> ... Бағдарламалық құрылғыларды өшіру. Команда интерфейстерді өшіреді. Ол тек бағдарламалық құрылғылар үшін (bond, bridge және т.б. сияқты) жұмыс істейді. Аппараттық құрылғыларды бұл командамен өшіру мүмкін емес.

source: Usage: nmcli device set { ARGUMENTS | help } ARGUMENTS := DEVICE { PROPERTY [ PROPERTY ... ] } DEVICE := [ifname] <ifname> PROPERTY := { autoconnect { yes | no } | { managed { yes | no } Modify device properties.
kk: Қолданылуы: nmcli device set { ARGUMENTS | help } ARGUMENTS := DEVICE { PROPERTY [ PROPERTY ... ] } DEVICE := [ifname] <ifname> PROPERTY := { autoconnect { yes | no } | { managed { yes | no } Құрылғы қасиеттерін өзгерту.

source: Usage: nmcli device monitor { ARGUMENTS | help } ARGUMENTS := [<ifname>] ... Monitor device activity. This command prints a line whenever the specified devices change state. Monitors all devices in case no interface is specified.
kk: Қолданылуы: nmcli device monitor { ARGUMENTS | help } ARGUMENTS := [<ifname>] ... Құрылғы белсенділігін бақылау. Көрсетілген құрылғылар күйін өзгерткен сайын бұл команда жолды шығарады. Егер интерфейс көрсетілмесе, барлық құрылғыларды бақылайды.

source: Usage: nmcli device wifi { ARGUMENTS | help } Perform operation on Wi-Fi devices. ARGUMENTS := [list [ifname <ifname>] [bssid <BSSID>] [--rescan yes|no|auto]] List available Wi-Fi access points. The 'ifname' and 'bssid' options can be used to list APs for a particular interface, or with a specific BSSID. The --rescan flag tells whether a new Wi-Fi scan should be triggered. ARGUMENTS := connect <(B)SSID> [password <password>] [wep-key-type key|phrase] [ifname <ifname>] [bssid <BSSID>] [name <name>] [private yes|no] [hidden yes|no] Connect to a Wi-Fi network specified by SSID or BSSID. The command finds a matching connection or creates one and then activates it on a device. This is a command-line counterpart of clicking an SSID in a GUI client. If a connection for the network already exists, it is possible to bring up the existing profile as follows: nmcli con up id <name>. Note that only open, WEP and WPA-PSK networks are supported if no previous connection exists. It is also assumed that IP configuration is obtained via DHCP. ARGUMENTS := hotspot [ifname <ifname>] [con-name <name>] [ssid <SSID>] [band a|bg|6GHz] [channel <channel>] [password <password>] Create a Wi-Fi hotspot. Use 'connection down' or 'device disconnect' to stop the hotspot. Parameters of the hotspot can be influenced by the optional parameters: ifname - Wi-Fi device to use con-name - name of the created hotspot connection profile ssid - SSID of the hotspot band - Wi-Fi band to use channel - Wi-Fi channel to use password - password to use for the hotspot ARGUMENTS := rescan [ifname <ifname>] [[ssid <SSID to scan>] ...] Request that NetworkManager immediately re-scan for available access points. NetworkManager scans Wi-Fi networks periodically, but in some cases it might be useful to start scanning manually. 'ssid' allows scanning for a specific SSID, which is useful for APs with hidden SSIDs. More 'ssid' parameters can be given. Note that this command does not show the APs, use 'nmcli device wifi list' for that.
kk: Қолданылуы: nmcli device wifi { ARGUMENTS | help } Wi-Fi құрылғыларында операцияны орындау. ARGUMENTS := [list [ifname <ifname>] [bssid <BSSID>] [--rescan yes|no|auto]] Қолжетімді Wi-Fi қатынау нүктелерін тізімдеу. 'ifname' және 'bssid' опциялары нақты интерфейс үшін немесе арнайы BSSID бар AP-ларды тізімдеу үшін қолданыла алады. --rescan жалаушасы жаңа Wi-Fi сканерлеу іске қосылуы керектігін айтады. ARGUMENTS := connect <(B)SSID> [password <password>] [wep-key-type key|phrase] [ifname <ifname>] [bssid <BSSID>] [name <name>] [private yes|no] [hidden yes|no] SSID немесе BSSID арқылы көрсетілген Wi-Fi желісіне қосылу. Команда сәйкес келетін қосылымды табады немесе біреуін жасайды, содан кейін оны құрылғыда белсендіреді. Бұл GUI клиентінде SSID шертудің командалық жолдағы баламасы. Егер желі үшін қосылым бұрыннан бар болса, бар профильді келесідей көтеруге болады: nmcli con up id <name>. Алдыңғы қосылым болмаса, тек ашық, WEP және WPA-PSK желілеріне қолдау көрсетілетінін ескеріңіз. Сондай-ақ IP конфигурациясы DHCP арқылы алынады деп болжанады. ARGUMENTS := hotspot [ifname <ifname>] [con-name <name>] [ssid <SSID>] [band a|bg|6GHz] [channel <channel>] [password <password>] Wi-Fi хотспотын жасау. Хотспотты тоқтату үшін 'connection down' немесе 'device disconnect' қолданыңыз. Хотспот параметрлеріне қосымша параметрлер әсер етуі мүмкін: ifname - қолданылатын Wi-Fi құрылғысы con-name - жасалған хотспот қосылым профилінің аты ssid - хотспоттың SSID-і band - қолданылатын Wi-Fi диапазоны channel - қолданылатын Wi-Fi арнасы password - хотспот үшін қолданылатын пароль ARGUMENTS := rescan [ifname <ifname>] [[ssid <SSID to scan>] ...] NetworkManager-ден қолжетімді қатынау нүктелерін дереу қайта сканерлеуді сұрау. NetworkManager Wi-Fi желілерін мерзімді түрде сканерлейді, бірақ кейбір жағдайларда сканерлеуді қолмен бастау пайдалы болуы мүмкін. 'ssid' нақты SSID іздеуге мүмкіндік береді, бұл жасырын SSID бар AP-лар үшін пайдалы. Көбірек 'ssid' параметрлерін беруге болады. Бұл команда AP-ларды көрсетпейтінін ескеріңіз, ол үшін 'nmcli device wifi list' қолданыңыз.

source: Usage: nmcli device lldp { ARGUMENTS | help } ARGUMENTS := [list [ifname <ifname>]] List neighboring devices discovered through LLDP. The 'ifname' option can be used to list neighbors for a particular interface.
kk: Қолданылуы: nmcli device lldp { ARGUMENTS | help } ARGUMENTS := [list [ifname <ifname>]] LLDP арқылы табылған көршілес құрылғыларды тізімдеу. 'ifname' опциясын нақты интерфейс үшін көршілерді тізімдеу үшін қолдануға болады.

source: Usage: nmcli device checkpoint { ARGUMENTS | help } ARGUMENTS := [--timeout <seconds>] -- COMMAND... Runs the command with a configuration checkpoint taken and asks for a confirmation when finished. When the confirmation is not given, the checkpoint is automatically restored after timeout.
kk: Қолданылуы: nmcli device checkpoint { ARGUMENTS | help } ARGUMENTS := [--timeout <seconds>] -- COMMAND... Пәрменді конфигурация бақылау нүктесі алынған күйде іске қосады және аяқталғанда растауды сұрайды. Растау берілмесе, бақылау нүктесі күту уақыты аяқталғаннан кейін автоматты түрде қалпына келтіріледі.

source: Error: No interface specified.
kk: Қате: Интерфейс көрсетілмеген.

source: Warning: argument '%s' is duplicated.
kk: Ескерту: '%s' аргументі қайталанған.

source: Error: Device '%s' not found.
kk: Қате: '%s' құрылғысы табылмады.

source: Error: not all devices found.
kk: Қате: барлық құрылғылар табылмады.

source: No interface specified
kk: Интерфейс көрсетілмеген

source: Device '%s' not found
kk: '%s' құрылғысы табылмады

source: %u MHz
kk: %u МГц

source: %u Mbit/s
kk: %u Мбит/с

source: 2.4 GHz
kk: 2.4 ГГц

source: 5 GHz
kk: 5 ГГц

source: 6 GHz
kk: 6 ГГц

source: N/A
kk: Қ/Ж

source: Device details
kk: Құрылғы мәліметтері

source: Error: 'device show': %s
kk: Қате: 'device show': %s

source: Status of devices
kk: Құрылғылар күйі

source: Error: 'device status': %s
kk: Қате: 'device status': %s

source: Error: Timeout %d sec expired.
kk: Қате: Күту уақыты %d сек өтті.

source: Device '%s' successfully activated with '%s'.
kk: '%s' құрылғысы '%s' арқылы сәтті белсендірілді.

source: Hint: "nmcli dev wifi show-password" shows the Wi-Fi name and password.
kk: Нұсқау: "nmcli dev wifi show-password" Wi-Fi аты мен паролін көрсетеді.

source: Error: Connection activation failed: %s.
kk: Қате: Қосылымды белсендіру сәтсіз аяқталды: %s.

source: Error: Failed to setup a Wi-Fi hotspot: %s
kk: Қате: Wi-Fi хотспотын орнату сәтсіз аяқталды: %s

source: Error: Failed to add/activate new connection: %s
kk: Қате: Жаңа қосылымды қосу/белсендіру сәтсіз аяқталды: %s

source: Error: Failed to activate connection: %s
kk: Қате: Қосылымды белсендіру сәтсіз аяқталды: %s

source: Error: Device activation failed: %s
kk: Қате: Құрылғыны белсендіру сәтсіз аяқталды: %s

source: Error: extra argument not allowed: '%s'.
kk: Қате: қосымша аргументке рұқсат жоқ: '%s'.

source: Device '%s' successfully disconnected.
kk: '%s' құрылғысы сәтті ажыратылды.

source: Device '%s' successfully removed.
kk: '%s' құрылғысы сәтті өшірілді.

source: Error: Reapplying connection to device '%s' (%s) failed: %s
kk: Қате: '%s' (%s) құрылғысына қосылымды қайта қолдану сәтсіз аяқталды: %s

source: Connection successfully reapplied to device '%s'.
kk: Қосылым '%s' құрылғысына сәтті қайта қолданылды.

source: Error: Reading applied connection from device '%s' (%s) failed: %s
kk: Қате: '%s' (%s) құрылғысынан қолданылған қосылымды оқу сәтсіз аяқталды: %s

source: Error: not all devices disconnected.
kk: Қате: барлық құрылғылар ажыратылмады.

source: Error: Device '%s' (%s) disconnecting failed: %s
kk: Қате: '%s' (%s) құрылғысын ажырату сәтсіз аяқталды: %s

source: Error: not all devices deleted.
kk: Қате: барлық құрылғылар өшірілмеді.

source: Error: Device '%s' (%s) deletion failed: %s
kk: Қате: '%s' (%s) құрылғысын өшіру сәтсіз аяқталды: %s

source: Error: No property specified.
kk: Қате: Қасиет көрсетілмеген.

source: Error: '%s' argument is missing.
kk: Қате: '%s' аргументі жоқ.

source: Error: 'managed': %s.
kk: Қате: 'managed': %s.

source: Error: 'autoconnect': %s.
kk: Қате: 'autoconnect': %s.

source: Error: property '%s' is not known.
kk: Қате: '%s' қасиеті белгісіз.

source: %s: using connection '%s'
kk: %s: '%s' қосылымын қолдану

source: %s: device created
kk: %s: құрылғы жасалды

source: %s: device removed
kk: %s: құрылғы өшірілді

source: Wi-Fi scan list
kk: Wi-Fi сканерлеу тізімі

source: Error: Access point with bssid '%s' not found.
kk: Қате: bssid '%s' бар қатынау нүктесі табылмады.

source: Error: 'device wifi': %s
kk: Қате: 'device wifi': %s

source: Error: invalid rescan argument: '%s' not among [auto, no, yes]
kk: Қате: жарамсыз rescan аргументі: '%s' [auto, no, yes] ішінде емес

source: Error: Device '%s' not found.
kk: Қате: '%s' құрылғысы табылмады.

source: Error: Device '%s' was not recognized as a Wi-Fi device, check NetworkManager Wi-Fi plugin.
kk: Қате: '%s' құрылғысы Wi-Fi құрылғысы ретінде танылмады, NetworkManager Wi-Fi плагинін тексеріңіз.

source: Error: Device '%s' is not a Wi-Fi device.
kk: Қате: '%s' құрылғысы Wi-Fi құрылғысы емес.

source: SSID or BSSID:
kk: SSID немесе BSSID:

source: Error: SSID or BSSID are missing.
kk: Қате: SSID немесе BSSID жоқ.

source: Error: bssid argument value '%s' is not a valid BSSID.
kk: Қате: bssid аргументінің '%s' мәні жарамды BSSID емес.

source: Error: wep-key-type argument value '%s' is invalid, use 'key' or 'phrase'.
kk: Қате: wep-key-type аргументінің '%s' мәні жарамсыз, 'key' немесе 'phrase' қолданыңыз.

source: Error: %s: %s.
kk: Қате: %s: %s.

source: Error: BSSID to connect to (%s) differs from bssid argument (%s).
kk: Қате: қосылатын BSSID (%s) bssid аргументінен (%s) өзгеше.

source: Error: Parameter '%s' is neither SSID nor BSSID.
kk: Қате: '%s' параметрі SSID те, BSSID те емес.

source: Error: No Wi-Fi device found.
kk: Қате: Wi-Fi құрылғысы табылмады.

source: Error: Failed to scan hidden SSID: %s.
kk: Қате: жасырын SSID сканерлеу сәтсіз аяқталды: %s.

source: Error: No network with SSID '%s' found.
kk: Қате: SSID '%s' бар желі табылмады.

source: Error: No access point with BSSID '%s' found.
kk: Қате: BSSID '%s' бар қатынау нүктесі табылмады.

source: Error: Connection '%s' exists but properties don't match.
kk: Қате: '%s' қосылымы бар, бірақ қасиеттері сәйкес келмейді.

source: Warning: '%s' should be SSID for hidden APs; but it looks like a BSSID.
kk: Ескерту: '%s' жасырын AP-лар үшін SSID болуы керек; бірақ ол BSSID-ге ұқсайды.

source: '%s' is not valid WPA PSK
kk: '%s' — жарамды WPA PSK емес

source: '%s' is not valid WEP key (it should be 5 or 13 ASCII chars)
kk: '%s' — жарамды WEP кілті емес (ол 5 немесе 13 ASCII таңбасы болуы керек)

source: Hotspot password: %s
kk: Хотспот паролі: %s

source: Error: ssid is too long.
kk: Қате: ssid тым ұзын.

source: Error: band argument value '%s' is invalid; use 'a', 'bg' or '6GHz'.
kk: Қате: band аргументінің '%s' мәні жарамсыз; 'a', 'bg' немесе '6GHz' қолданыңыз.

source: Error: channel requires band too.
kk: Қате: арна үшін диапазон да қажет.

source: Error: channel '%s' not valid for band '%s'.
kk: Қате: '%s' арнасы '%s' диапазоны үшін жарамсыз.

source: Error: Device '%s' supports neither AP nor Ad-Hoc mode.
kk: Қате: '%s' құрылғысы AP режимін де, Ad-Hoc режимін де қолдамайды.

source: Error: Invalid 'password': %s.
kk: Қате: Жарамсыз 'password': %s.

source: Error: '%s' cannot repeat.
kk: Қате: '%s' қайталана алмайды.

source: Security
kk: Қауіпсіздік

source: None
kk: Жоқ

source: Device LLDP neighbors
kk: Құрылғының LLDP көршілері

source: Error: 'device lldp list': %s
kk: Қате: 'device lldp list': %s

source: Checkpoint was removed.
kk: Бақылау нүктесі өшірілді.

source: No
kk: Жоқ

source: Error: Destroying a checkpoint failed: %s
kk: Қате: Бақылау нүктесін жою сәтсіз аяқталды: %s

source: Yes
kk: Иә

source: Error: Creating a checkpoint failed: %s
kk: Қате: Бақылау нүктесін жасау сәтсіз аяқталды: %s

source: Error: %s
kk: Қате: %s

source: Error: '%s' is not a valid timeout.
kk: Қате: '%s' — жарамды күту уақыты емес.

source: Error: Expected a command to run after '--'
kk: Қате: '--' кейін іске қосылатын команда күтілген

source: network off
kk: желі сөндірулі

source: connecting
kk: қосылуда

source: connected (local only)
kk: қосылған (тек жергілікті)

source: connected (site only)
kk: қосылған (тек сайт)

source: disconnecting
kk: ажыратылуда

source: auth
kk: аутентификация

source: running
kk: орындалуда

source: starting
kk: басталуда

source: started
kk: басталды

source: missing
kk: жоқ

source: enabled
kk: іске қосылған

source: disabled
kk: сөндірулі

source: Usage: nmcli general { COMMAND | help } COMMAND := { status | hostname | permissions | logging | reload } status hostname [<hostname>] permissions logging [level <log level>] [domains <log domains>] reload [<flags>]
kk: Қолданылуы: nmcli general { COMMAND | help } COMMAND := { status | hostname | permissions | logging | reload } status hostname [<hostname>] permissions logging [level <log level>] [domains <log domains>] reload [<flags>]

source: Usage: nmcli general status { help } Show overall status of NetworkManager. 'status' is the default action, which means 'nmcli gen' calls 'nmcli gen status'
kk: Қолданылуы: nmcli general status { help } NetworkManager-дің жалпы күйін көрсету. 'status' — әдепкі әрекет, яғни 'nmcli gen' командасы 'nmcli gen status' командасын шақырады

source: Usage: nmcli general hostname { ARGUMENTS | help } ARGUMENTS := [<hostname>] Get or change persistent system hostname. With no arguments, this prints currently configured hostname. When you pass a hostname, NetworkManager will set it as the new persistent system hostname.
kk: Қолданылуы: nmcli general hostname { ARGUMENTS | help } ARGUMENTS := [<hostname>] Жүйенің тұрақты хост атын алу немесе өзгерту. Аргументсіз, бұл қазіргі бапталған хост атын шығарады. Хост атын бергенде, NetworkManager оны жаңа тұрақты жүйелік хост аты ретінде орнатады.

source: Usage: nmcli general permissions { help } Show caller permissions for authenticated operations.
kk: Қолданылуы: nmcli general permissions { help } Аутентификацияланған операциялар үшін шақырушы рұқсаттарын көрсету.

source: Usage: nmcli general reload { ARGUMENTS | help } ARGUMENTS := [<flag>[,<flag>...]] Reload NetworkManager's configuration and perform certain updates, like flushing caches or rewriting external state to disk. This is similar to sending SIGHUP to NetworkManager but it allows for more fine-grained control over what to reload through the flags argument. It also allows non-root access via PolicyKit and contrary to signals it is synchronous. Available flags are: 'conf' Reload the NetworkManager.conf configuration from disk. Note that this does not include connections, which can be reloaded through 'nmcli connection reload' instead. 'dns-rc' Update DNS configuration, which usually involves writing /etc/resolv.conf anew. This is equivalent to sending the SIGUSR1 signal to the NetworkManager process. 'dns-full' Restart the DNS plugin. This is for example useful when using dnsmasq plugin, which uses additional configuration in /etc/NetworkManager/dnsmasq.d. If you edit those files, you can restart the DNS plugin. This action shortly interrupts name resolution. With no flags, everything that is supported is reloaded, which is identical to sending a SIGHUP.
kk: Қолданылуы: nmcli general reload { ARGUMENTS | help } ARGUMENTS := [<flag>[,<flag>...]] NetworkManager конфигурациясын қайта жүктеу және кэштерді тазалау немесе сыртқы күйді дискіге қайта жазу сияқты белгілі бір жаңартуларды орындау. Бұл NetworkManager-ге SIGHUP жіберуге ұқсас, бірақ жалаушалар аргументі арқылы нені қайта жүктеу керектігін дәлірек бақылауға мүмкіндік береді. Ол сондай-ақ PolicyKit арқылы root емес қолжетімділікке мүмкіндік береді және сигналдарға қарағанда синхронды болып табылады. Қолжетімді жалаушалар: 'conf' NetworkManager.conf конфигурациясын дискіден қайта жүктеу. Бұл қосылымдарды қамтымайтынын ескеріңіз, оларды 'nmcli connection reload' арқылы қайта жүктеуге болады. 'dns-rc' DNS конфигурациясын жаңарту, бұл әдетте /etc/resolv.conf файлын қайта жазуды қамтиды. Бұл NetworkManager процесіне SIGUSR1 сигналын жіберумен тең. 'dns-full' DNS плагинін қайта іске қосу. Бұл, мысалы, /etc/NetworkManager/dnsmasq.d ішінде қосымша конфигурацияны қолданатын dnsmasq плагинін пайдаланған кезде пайдалы. Егер сол файлдарды түзетсеңіз, DNS плагинін қайта іске қоса аласыз. Бұл әрекет атауларды шешуді қысқа уақытқа үзеді. Жалаушаларсыз, қолдау көрсетілетін барлық нәрсе қайта жүктеледі, бұл SIGHUP жіберумен бірдей.

source: Usage: nmcli general logging { ARGUMENTS | help } ARGUMENTS := [level <log level>] [domains <log domains>] Get or change NetworkManager logging level and domains. Without any argument current logging level and domains are shown. In order to change logging state, provide level and/or domain. Please refer to the man page for the list of possible logging domains.
kk: Қолданылуы: nmcli general logging { ARGUMENTS | help } ARGUMENTS := [level <log level>] [domains <log domains>] NetworkManager журналдау деңгейі мен домендерін алу немесе өзгерту. Аргументсіз қазіргі журналдау деңгейі мен домендер көрсетіледі. Журналдау күйін өзгерту үшін деңгейді және/немесе доменді көрсетіңіз. Ықтимал журналдау домендерінің тізімін нұсқаулық бетінен қараңыз.

source: Usage: nmcli networking { COMMAND | help } COMMAND := { [ on | off | connectivity ] } on off connectivity [check]
kk: Қолданылуы: nmcli networking { COMMAND | help } COMMAND := { [ on | off | connectivity ] } on off connectivity [check]

source: Usage: nmcli networking on { help } Switch networking on.
kk: Қолданылуы: nmcli networking on { help } Желіні іске қосу.

source: Usage: nmcli networking off { help } Switch networking off.
kk: Қолданылуы: nmcli networking off { help } Желіні сөндіру.

source: Usage: nmcli networking connectivity { ARGUMENTS | help } ARGUMENTS := [check] Get network connectivity state. The optional 'check' argument makes NetworkManager re-check the connectivity.
kk: Қолданылуы: nmcli networking connectivity { ARGUMENTS | help } ARGUMENTS := [check] Желілік қосылым күйін алу. Қосымша 'check' аргументі NetworkManager-ді қосылымды қайта тексеруге мәжбүрлейді.

source: Usage: nmcli radio { COMMAND | help } COMMAND := { all | wifi | wwan } all | wifi | wwan [ on | off ]
kk: Қолданылуы: nmcli radio { COMMAND | help } COMMAND := { all | wifi | wwan } all | wifi | wwan [ on | off ]

source: Usage: nmcli radio all { ARGUMENTS | help } ARGUMENTS := [on | off] Get status of all radio switches, or turn them on/off.
kk: Қолданылуы: nmcli radio all { ARGUMENTS | help } ARGUMENTS := [on | off] Барлық радио ауыстырып-қосқыштардың күйін алу, немесе оларды қосу/сөндіру.

source: Usage: nmcli radio wifi { ARGUMENTS | help } ARGUMENTS := [on | off] Get status of Wi-Fi radio switch, or turn it on/off.
kk: Қолданылуы: nmcli radio wifi { ARGUMENTS | help } ARGUMENTS := [on | off] Wi-Fi радио ауыстырып-қосқышының күйін алу, немесе оны қосу/сөндіру.

source: Usage: nmcli radio wwan { ARGUMENTS | help } ARGUMENTS := [on | off] Get status of mobile broadband radio switch, or turn it on/off.
kk: Қолданылуы: nmcli radio wwan { ARGUMENTS | help } ARGUMENTS := [on | off] Мобильді кең жолақты радио ауыстырып-қосқышының күйін алу, немесе оны қосу/сөндіру.

source: Usage: nmcli monitor Monitor NetworkManager changes. Prints a line whenever a change occurs in NetworkManager
kk: Қолданылуы: nmcli monitor NetworkManager өзгерістерін бақылау. NetworkManager-де өзгеріс болған сайын жолды шығарады

source: NetworkManager status
kk: NetworkManager күйі
