Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: ignoring missing number
kk: жетіспейтін санды елемеу

source: ignoring invalid number '%s'
kk: жарамсыз '%s' санын елемеу

source: ignoring invalid %s address: %s
kk: жарамсыз %s адресін елемеу: %s

source: ignoring invalid gateway '%s' for %s route
kk: %s маршруты үшін жарамсыз '%s' шлюзін елемеу

source: ignoring invalid %s route: %s
kk: жарамсыз %s маршрутын елемеу: %s

source: unexpected character '%c' for address %s: '%s' (position %td)
kk: күтпеген '%c' таңбасы (%s адресі үшін): '%s' (%td орны)

source: unexpected character '%c' for %s: '%s' (position %td)
kk: күтпеген '%c' таңбасы (%s үшін): '%s' (%td орны)

source: unexpected character '%c' in prefix length for %s: '%s' (position %td)
kk: күтпеген '%c' таңбасы (%s үшін префикс ұзындығында): '%s' (%td орны)

source: garbage at the end of value %s: '%s'
kk: %s мәнінің соңындағы қоқыс: '%s'

source: deprecated semicolon at the end of value %s: '%s'
kk: %s мәнінің соңындағы ескірген нүктелі үтір: '%s'

source: invalid prefix length for %s '%s', defaulting to %d
kk: %s '%s' үшін жарамсыз префикс ұзындығы, %d әдепкі мәні қолданылады

source: missing prefix length for %s '%s', defaulting to %d
kk: %s '%s' үшін префикс ұзындығы жетіспейді, %d әдепкі мәні қолданылады

source: ignoring gateway "%s" from "address*" keys because the "gateway" key is set
kk: "gateway" кілті орнатылғандықтан "address*" кілттерінен "%s" шлюзі елеменбейді

source: invalid value for "%s": %s
kk: "%s" үшін жарамсыз мән: %s

source: ignoring invalid DNS server IPv%c address '%s': %s
kk: жарамсыз DNS серверінің IPv%c адресі '%s' елеменбейді: %s

source: normalizing invalid separator ',' or ' ' in DNS search value '%s', only ';' will be valid separators in keyfiles in the future
kk: DNS іздеу мәніндегі '%s' жарамсыз ',' немесе ' ' ажыратқышы қалыпқа келтірілуде, болашақта кілт файлдарында тек ';' жарамды ажыратқыш болады

source: invalid option '%s', use one of [%s]
kk: жарамсыз опция '%s', [%s] біреуін қолданыңыз

source: ignoring invalid MAC address
kk: жарамсыз MAC адресін елемеу

source: ignoring invalid bond option %s%s%s = %s%s%s: %s
kk: жарамсыз bond опциясы %s%s%s = %s%s%s елеменбейді: %s

source: ignoring invalid SSID
kk: жарамсыз SSID елемеу

source: ignoring invalid raw password
kk: жарамсыз өңделмеген (raw) парольді елемеу

source: invalid key/cert value
kk: жарамсыз кілт/сертификат мәні

source: invalid key/cert value path "%s"
kk: жарамсыз кілт/сертификат мәнінің жолы "%s"

source: certificate or key file '%s' does not exist
kk: '%s' сертификат немесе кілт файлы жоқ

source: invalid PKCS#11 URI "%s"
kk: жарамсыз PKCS#11 URI "%s"

source: invalid key/cert value data:;base64, is not base64
kk: жарамсыз кілт/сертификат мәнінің деректері:;base64, base64 емес

source: invalid key/cert value data:;base64,file://
kk: жарамсыз кілт/сертификат мәнінің деректері:;base64,file://

source: invalid key/cert value is not a valid blob
kk: жарамсыз кілт/сертификат мәні жарамды blob емес

source: invalid parity value '%s'
kk: жарамсыз жұптылық мәні '%s'

source: invalid setting: %s
kk: жарамсыз баптау: %s

source: ignoring invalid team configuration: %s
kk: жарамсыз team конфигурациясын елемеу: %s

source: invalid qdisc: %s
kk: жарамсыз qdisc: %s

source: invalid tfilter: %s
kk: жарамсыз tfilter: %s

source: error loading setting value: %s
kk: баптау мәнін жүктеу қатесі: %s

source: value cannot be interpreted as integer
kk: мәнді бүтін сан ретінде түсіндіру мүмкін емес

source: ignoring invalid byte element '%u' (not between 0 and 255 inclusive)
kk: жарамсыз байт элементі '%u' (0 мен 255 арасында емес) елеменбейді

source: invalid value for '%s.dhcp-send-hostname'
kk: '%s.dhcp-send-hostname' үшін жарамсыз мән

source: invalid value for '%s.dhcp-send-hostname-deprecated'
kk: '%s.dhcp-send-hostname-deprecated' үшін жарамсыз мән

source: invalid setting name '%s'
kk: жарамсыз баптау аты '%s'

source: invalid key '%s.%s'
kk: жарамсыз кілт '%s.%s'

source: key '%s.%s' is not boolean
kk: '%s.%s' кілті логикалық (boolean) емес

source: key '%s.%s' is not a uint32
kk: '%s.%s' кілті uint32 емес

source: invalid peer public key in section '%s'
kk: '%s' бөліміндегі жарамсыз тораптың ашық кілті

source: key '%s.%s' is not a valid 256 bit key in base64 encoding
kk: '%s.%s' кілті base64 кодтауындағы жарамды 256 биттік кілт емес

source: key '%s.%s' is not a valid secret flag
kk: '%s.%s' кілті жарамды құпия жалаушасы емес

source: key '%s.%s' is not a integer in range 0 to 2^32
kk: '%s.%s' кілті 0 мен 2^32 арасындағы бүтін сан емес

source: key '%s.%s' is not a valid endpoint
kk: '%s.%s' кілті жарамды соңғы нүкте емес

source: key '%s.%s' has invalid allowed-ips
kk: '%s.%s' кілтінде жарамсыз allowed-ips бар

source: peer '%s' is invalid: %s
kk: '%s' торабы жарамсыз: %s

source: unsupported option "%s.%s" of variant type %s
kk: variant түріндегі "%s.%s" қолдау көрсетілмейтін опциясы %s

source: property is not specified
kk: қасиет көрсетілмеген

source: '%s' value doesn't match '%s=%s'
kk: '%s' мәні '%s=%s' сәйкес келмейді

source: '%s' is neither an UUID nor an interface name
kk: '%s' UUID те, интерфейс аты да емес

source: binary data missing
kk: бинарлы деректер жетіспейді

source: URI not NUL terminated
kk: URI NUL таңбасымен аяқталмаған

source: URI is empty
kk: URI бос

source: URI is not valid UTF-8
kk: URI жарамды UTF-8 емес

source: data missing
kk: деректер жетіспейді

source: certificate is invalid: %s
kk: сертификат жарамсыз: %s

source: certificate detected as invalid scheme
kk: сертификат жарамсыз схема ретінде анықталды

source: CA certificate must be in X.509 format
kk: CA сертификаты X.509 пішімінде болуы керек

source: invalid certificate format
kk: жарамсыз сертификат пішімі

source: password is not supported when certificate is not on a PKCS#11 token
kk: сертификат PKCS#11 токенінде болмағанда парольге қолдау көрсетілмейді

source: property is empty
kk: қасиет бос

source: has to match '%s' property for PKCS#12
kk: PKCS#12 үшін '%s' қасиетіне сәйкес келуі керек

source: exactly one property must be set
kk: дәл бір қасиет орнатылуы керек

source: can be enabled only on Ethernet connections
kk: тек Ethernet қосылымдарында іске қосылуы мүмкін

source: property is invalid
kk: қасиет жарамсыз

source: '%s' is not a valid value for the property
kk: '%s' — қасиет үшін жарамды мән емес

source: invalid auth flags: '%d' contains unknown flags
kk: жарамсыз аутентификация жалаушалары: '%d' ішінде белгісіз жалаушалар бар

source: invalid auth flags: both enable and disable are set for the same TLS version
kk: жарамсыз аутентификация жалаушалары: бір TLS нұсқасы үшін іске қосу және сөндіру екеуі де орнатылған

source: '%s' connection requires '%s' or '%s' setting
kk: '%s' қосылымы '%s' немесе '%s' баптауын талап етеді

source: '%s' connection requires '%s' setting
kk: '%s' қосылымы '%s' баптауын талап етеді

source: missing setting
kk: баптау жетіспейді

source: A connection with a '%s' setting must have the port-type set to '%s'. Instead it is '%s'
kk: '%s' баптауы бар қосылымда port-type '%s' болып орнатылуы керек. Оның орнына ол '%s'

source: '%s' option is empty
kk: '%s' опциясы бос

source: '%s' is not a valid %s address for '%s' option
kk: '%s' — '%s' опциясы үшін жарамды %s адресі емес

source: missing option name
kk: опция аты жетіспейді

source: invalid option '%s'
kk: жарамсыз опция '%s'

source: invalid value '%s' for option '%s'
kk: '%s' опциясы үшін жарамсыз мән '%s'

source: mandatory option '%s' is missing
kk: міндетті '%s' опциясы жетіспейді

source: '%s' is not a valid value for '%s'
kk: '%s' — '%s' үшін жарамды мән емес

source: '%s=%s' is incompatible with '%s > 0'
kk: '%s=%s' мәні '%s > 0' шартымен үйлесімсіз

source: '%s' is not valid for the '%s' option: %s
kk: '%s' мәні '%s' опциясы үшін жарамсыз: %s

source: '%s' option is only valid for '%s=%s'
kk: '%s' опциясы тек '%s=%s' үшін жарамды

source: '%s=%s' is not a valid configuration for '%s'
kk: '%s=%s' — '%s' үшін жарамды конфигурация емес

source: '%s' option requires '%s' option to be enabled
kk: '%s' опциясы '%s' опциясының іске қосылуын талап етеді

source: '%s' option needs to be a value multiple of '%s' value
kk: '%s' опциясы '%s' мәніне еселі мән болуы керек

source: '%s' option requires '%s' or '%s'option to be set
kk: '%s' опциясы '%s' немесе '%s' опциясының орнатылуын талап етеді

source: '%s' option requires '%s' option to be set
kk: '%s' опциясы '%s' опциясының орнатылуын талап етеді

source: '%s' option is only valid with mode '%s'
kk: '%s' опциясы тек '%s' режимімен жарамды

source: '%s' and '%s' cannot have different values
kk: '%s' және '%s' әртүрлі мәндерге ие бола алмайды

source: %s requires bond mode "%s"
kk: %s bond "%s" режимін талап етеді

source: %s requires xmit_hash_policy "vlan+srcmac"
kk: %s xmit_hash_policy "vlan+srcmac" талап етеді

source: '%s' option should be string
kk: '%s' опциясы жол болуы керек

source: '%s' option is not valid with mode '%s'
kk: '%s' опциясы '%s' режимімен жарамсыз

source: value '%d' is out of range <%d-%d>
kk: '%d' мәні <%d-%d> ауқымынан тыс

source: is not a valid MAC address
kk: жарамды MAC адресі емес

source: the mask can't contain bits 0 (STP), 1 (MAC) or 2 (LACP)
kk: маскада 0 (STP), 1 (MAC) немесе 2 (LACP) биттері бола алмайды

source: is not a valid link local MAC address
kk: жарамды link local MAC адресі емес

source: is not a valid VLAN filtering protocol
kk: жарамды VLAN сүзгілеу хаттамасы емес

source: is not a valid option
kk: жарамды опция емес

source: '%s' option must be a power of 2
kk: '%s' опциясы 2-нің дәрежесі болуы керек

source: bridge connection should have a ethernet setting as well
kk: bridge қосылымында ethernet баптауы да болуы керек

source: setting required for connection of type '%s'
kk: '%s' түріндегі қосылым үшін баптау қажет

source: Unknown port type '%s'
kk: Белгісіз порт түрі '%s'

source: Slave connections need a valid '%s' property
kk: Еншілес (Slave) қосылымдарға жарамды '%s' қасиеті қажет

source: Cannot set '%s' without '%s'
kk: '%s' мәнін '%s' жоқ кезде орнату мүмкін емес

source: '%s' is not a valid UUID
kk: '%s' — жарамды UUID емес

source: connection type '%s' is not valid
kk: '%s' қосылым түрі жарамсыз

source: '%s' connections must be attached as port to '%s', not '%s'
kk: '%s' қосылымдары '%s' порты ретінде тіркелуі керек, '%s' емес

source: metered value %d is not valid
kk: %d өлшенетін (metered) мәні жарамсыз

source: value %d is not valid
kk: %d мәні жарамсыз

source: "disabled" flag cannot be combined with other MPTCP flags
kk: "disabled" жалаушасын басқа MPTCP жалаушаларымен біріктіруге болмайды

source: cannot set both "signal" and "fullmesh" MPTCP flags
kk: "signal" және "fullmesh" MPTCP жалаушаларын қатар орнату мүмкін емес

source: value %u is not a valid combination of MPTCP flags
kk: %u мәні MPTCP жалаушаларының жарамды комбинациясы емес

source: DHCP option cannot be longer than 255 characters
kk: DHCP опциясы 255 таңбадан ұзын бола алмайды

source: MUD URL is not a valid URL
kk: MUD URL жарамды URL емес

source: invalid permissions not in format "user:$UNAME[:]"
kk: рұқсаттар жарамсыз, "user:$UNAME[:]" пішімінде емес

source: can only be set if %s.%s is set
kk: тек %s.%s орнатылғанда ғана орнатыла алады

source: is incompatible with '%s'
kk: '%s' мәнімен үйлесімсіз

source: contains IPv4 address '%s', %s.%s cannot be 'disabled'
kk: құрамында '%s' IPv4 адресі бар, %s.%s 'disabled' бола алмайды

source: contains IPv4 address '%s', %s.%s cannot be 'true'
kk: құрамында '%s' IPv4 адресі бар, %s.%s 'true' бола алмайды

source: contains IPv4 address '%s', %s.%s must be set to 'false' explicitly
kk: құрамында '%s' IPv4 адресі бар, %s.%s айқын түрде 'false' болып орнатылуы керек

source: contains IPv6 address '%s', %s.%s cannot be '%s'
kk: құрамында '%s' IPv6 адресі бар, %s.%s '%s' бола алмайды

source: contains IPv6 address '%s', %s.%s cannot be 'true'
kk: құрамында '%s' IPv6 адресі бар, %s.%s 'true' бола алмайды

source: contains IPv6 address '%s', %s.%s must be set to 'false' explicitly
kk: құрамында '%s' IPv6 адресі бар, %s.%s айқын түрде 'false' болып орнатылуы керек

source: has an invalid IP address '%s'
kk: жарамсыз IP адресі '%s' бар

source: property type should be set to '%s'
kk: қасиет түрі '%s' болып орнатылуы керек

source: port-type '%s' requires a '%s' setting in the connection
kk: port-type '%s' қосылымда '%s' баптауын талап етеді

source: Detect a port connection with '%s' set and a port type '%s'. '%s' should be set to '%s'
kk: '%s' орнатылған және порт түрі '%s' порт қосылымы анықталды. '%s' мәні '%s' болып орнатылуы керек

source: A port connection with '%s' set to '%s' cannot have a '%s' setting
kk: '%s' мәні '%s' болып орнатылған порт қосылымында '%s' баптауы бола алмайды

source: UUID needs normalization
kk: UUID қалыпқа келтіруді қажет етеді

source: has duplicate addresses
kk: қайталанатын адрестер бар

source: read-only is deprecated and not settable for the user
kk: read-only ескірген және пайдаланушы орната алмайды

source: flags invalid
kk: жалаушалар жарамсыз

source: flags invalid - disabled
kk: жалаушалар жарамсыз - сөндірілген

source: property invalid (not enabled)
kk: қасиет жарамсыз (іске қосылмаған)

source: element invalid
kk: элемент жарамсыз

source: sum not 100%
kk: қосынды 100% емес

source: property invalid
kk: қасиет жарамсыз

source: unsupported ethtool setting
kk: қолдау көрсетілмейтін ethtool баптауы

source: setting has invalid variant type
kk: баптауда жарамсыз variant түрі бар

source: coalesce option must be either 0 or 1
kk: coalesce опциясы 0 немесе 1 болуы керек

source: pause-autoneg cannot be enabled when setting rx/tx options
kk: rx/tx опцияларын орнатқанда pause-autoneg іске қосыла алмайды

source: '%s' is not valid FEC modes, valid modes are combinations of %s
kk: '%s' жарамды FEC режимдері емес, жарамды режимдер %s комбинациялары

source: unknown ethtool option '%s'
kk: белгісіз ethtool опциясы '%s'

source: the property is required when %s.%s is set
kk: %s.%s орнатылған кезде қасиет қажет

source: property value is empty
kk: қасиет мәні бос

source: property value is too long (>64)
kk: қасиет мәні тым ұзын (>64)

source: '%s' contains invalid char(s) (use [A-Za-z._-])
kk: '%s' ішінде жарамсыз таңба(лар) бар ([A-Za-z._-] қолданыңыз)

source: '%s' length is invalid (should be 5 or 6 digits)
kk: '%s' ұзындығы жарамсыз (5 немесе 6 цифр болуы керек)

source: '%s' is not a number
kk: '%s' сан емес

source: property is empty or wrong size
kk: қасиет бос немесе өлшемі қате

source: property must contain only digits
kk: қасиетте тек цифрлар болуы керек

source: can't be enabled when manual configuration is present
kk: қолмен конфигурация бар болғанда іске қосу мүмкін емес

source: '%s' is not a valid interface name
kk: '%s' — жарамды интерфейс аты емес

source: HSR protocol cannot be configured for PRP interfaces
kk: HSR хаттамасын PRP интерфейстері үшін баптау мүмкін емес

source: Must specify a P_Key if specifying parent
kk: Егер аталық (parent) көрсетілсе, P_Key көрсетілуі керек

source: InfiniBand P_Key connection did not specify parent interface name
kk: InfiniBand P_Key қосылымы аталық интерфейс атын көрсетпеді

source: the values 0 and 0x8000 are not allowed
kk: 0 және 0x8000 мәндеріне рұқсат етілмейді

source: interface name of software infiniband device must be '%s' or unset (instead it is '%s')
kk: бағдарламалық infiniband құрылғысының интерфейс аты '%s' болуы керек немесе орнатылмауы керек (оның орнына ол '%s')

source: interface name of software infiniband device with MAC address must be unset (instead it is '%s')
kk: MAC адресі бар бағдарламалық infiniband құрылғысының интерфейс аты орнатылмауы керек (оның орнына ол '%s')

source: mtu can be at most %u but it is %u
kk: mtu ең көбі %u болуы мүмкін, бірақ ол %u

source: Missing IPv4 address
kk: IPv4 адресі жетіспейді

source: Missing IPv6 address
kk: IPv6 адресі жетіспейді

source: Invalid IPv4 address '%s'
kk: Жарамсыз IPv4 адресі '%s'

source: Invalid IPv6 address '%s'
kk: Жарамсыз IPv6 адресі '%s'

source: Invalid IPv4 address prefix '%u'
kk: Жарамсыз IPv4 адрес префиксі '%u'

source: Invalid IPv6 address prefix '%u'
kk: Жарамсыз IPv6 адрес префиксі '%u'

source: Invalid routing metric '%s'
kk: Жарамсыз маршруттау метрикасы '%s'

source: unknown attribute
kk: белгісіз атрибут

source: invalid attribute type '%s'
kk: жарамсыз атрибут түрі '%s'

source: attribute is not valid for a IPv4 route
kk: атрибут IPv4 маршруты үшін жарамсыз

source: attribute is not valid for a IPv6 route
kk: атрибут IPv6 маршруты үшін жарамсыз

source: '%s' is not a valid IPv4 address
kk: '%s' - жарамды IPv4 адресі емес

source: '%s' is not a valid IPv6 address
kk: '%s' - жарамды IPv6 адресі емес

source: invalid prefix %s
kk: жарамсыз префикс %s

source: %s is not a valid route type
kk: %s - жарамды маршрут түрі емес

source: route weight cannot be larger than 256
kk: маршрут салмағы 256-дан үлкен бола алмайды

source: route scope is invalid for local route
kk: маршрут ауқымы жергілікті маршрут үшін жарамсыз

source: a %s route cannot have a next-hop
kk: %s маршрутында next-hop бола алмайды

source: a %s route cannot have a ECMP multi-hop "weight"
kk: %s маршрутында ECMP multi-hop "weight" бола алмайды

source: missing priority
kk: басымдық жетіспейді

source: missing table
kk: кесте жетіспейді

source: invalid action type
kk: жарамсыз әрекет түрі

source: has from/src but the prefix-length is zero
kk: from/src бар, бірақ префикс ұзындығы нөлге тең

source: missing from/src for a non zero prefix-length
kk: нөл емес префикс ұзындығы үшін from/src жетіспейді

source: invalid from/src
kk: жарамсыз from/src

source: invalid prefix length for from/src
kk: from/src үшін жарамсыз префикс ұзындығы

source: has to/dst but the prefix-length is zero
kk: to/dst бар, бірақ префикс ұзындығы нөлге тең

source: missing to/dst for a non zero prefix-length
kk: нөл емес префикс ұзындығы үшін to/dst жетіспейді

source: invalid to/dst
kk: жарамсыз to/dst

source: invalid prefix length for to/dst
kk: to/dst үшін жарамсыз префикс ұзындығы

source: invalid iifname
kk: жарамсыз iifname

source: invalid oifname
kk: жарамсыз oifname

source: invalid source port range
kk: жарамсыз бастапқы порт ауқымы

source: invalid destination port range
kk: жарамсыз тағайындалған порт ауқымы

source: suppress_prefixlength out of range
kk: suppress_prefixlength ауқымнан тыс

source: suppress_prefixlength is only allowed with the to-table action
kk: suppress_prefixlength тек to-table әрекетімен рұқсат етіледі

source: invalid key "%s"
kk: жарамсыз кілт "%s"

source: duplicate key %s
kk: қайталанатын кілт %s

source: invalid variant type '%s' for "%s"
kk: "%s" үшін жарамсыз variant түрі '%s'

source: missing "family"
kk: "family" жетіспейді

source: invalid "family"
kk: жарамсыз "family"

source: "uid-range-start" is greater than "uid-range-end"
kk: "uid-range-start" "uid-range-end" мәнінен үлкен

source: Unsupported to-string-flags argument
kk: Қолдау көрсетілмейтін to-string-flags аргументі

source: Unsupported extra-argument
kk: Қолдау көрсетілмейтін қосымша аргумент

source: unsupported key "%s"
kk: қолдау көрсетілмейтін кілт "%s"

source: duplicate key "%s"
kk: қайталанатын кілт "%s"

source: invalid value for "%s"
kk: "%s" үшін жарамсыз мән

source: empty text does not describe a rule
kk: бос мәтін ережені сипаттамайды

source: missing argument for "%s"
kk: "%s" үшін аргумент жетіспейді

source: invalid "from" part
kk: жарамсыз "from" бөлігі

source: invalid "to" part
kk: жарамсыз "to" бөлігі

source: cannot detect address family for rule
kk: ереже үшін адрес отбасын анықтау мүмкін емес

source: rule is invalid: %s
kk: ереже жарамсыз: %s

source: invalid address family
kk: жарамсыз адрес отбасы

source: rule #%u is invalid: %s
kk: #%u ереже жарамсыз: %s

source: %u. DNS server address is invalid: %s
kk: %u. DNS сервер адресі жарамсыз: %s

source: DNS search domain '%s' is invalid
kk: DNS іздеу домені '%s' жарамсыз

source: %d. IP address is invalid
kk: %d. IP адресі жарамсыз

source: %d. IP address has 'label' property with invalid type
kk: %d. IP адресінде жарамсыз түрі бар 'label' қасиеті бар

source: %d. IP address has invalid label '%s'
kk: %d. IP адресінде жарамсыз '%s' белгісі бар

source: gateway cannot be set if there are no addresses configured
kk: егер адрестер бапталмаса, шлюзді орнату мүмкін емес

source: gateway is invalid
kk: шлюз жарамсыз

source: %d. route is invalid
kk: %d. бағдар жарамсыз

source: invalid attribute: %s
kk: жарамсыз атрибут: %s

source: %u. rule has wrong address-family
kk: %u. ереженің адрес тобы қате

source: %u. rule is invalid: %s
kk: %u. ереже жарамсыз: %s

source: '%s' is not a valid IAID
kk: '%s' — жарамды IAID емес

source: the property cannot be set when '%s' is disabled
kk: '%s' сөндірулі болғанда қасиетті орнату мүмкін емес

source: the property is currently supported only for DHCPv4
kk: қасиет қазір тек DHCPv4 үшін қолдау көрсетіледі

source: '%s' is not a valid IP or subnet
kk: '%s' — жарамды IP немесе ішкі желі емес

source: a gateway is incompatible with '%s'
kk: шлюз '%s' мәнімен үйлесімсіз

source: the value is inconsistent with '%s'
kk: мән '%s' мәнімен сәйкес келмейді

source: '%d' is not a valid tunnel mode
kk: '%d' — жарамды туннель режимі емес

source: '%s' is not a valid IPv%c address
kk: '%s' — жарамды IPv%c адресі емес

source: tunnel keys can only be specified for GRE and VTI tunnels
kk: туннель кілттерін тек GRE және VTI туннельдері үшін көрсетуге болады

source: '%s' is not a valid tunnel key
kk: '%s' — жарамды туннель кілті емес

source: a fixed TTL is allowed only when path MTU discovery is enabled
kk: бекітілген TTL мәніне тек жолдың MTU анықталуы іске қосылғанда рұқсат етіледі

source: some flags are invalid for the select mode: %s
kk: кейбір жалаушалар таңдау режимі үшін жарамсыз: %s

source: can be set only on VTI tunnels
kk: тек VTI туннельдерінде орнатуға болады

source: wired setting not allowed for mode %s
kk: сымды желі баптауына %s режимі үшін рұқсат етілмейді

source: property is not specified and neither is '%s:%s'
kk: қасиет көрсетілмеген және '%s:%s' те

source: unsupported mode %u
kk: қолдау жоқ %u режимі

source: private and VEPA cannot be enabled at the same time
kk: private және VEPA режимдерін бір уақытта іске қосу мүмкін емес

source: method '%s' requires at least an address, a route, or CLAT set to 'force'
kk: '%s' әдісі кем дегенде адресті, бағдарды немесе 'force' күйіне орнатылған CLAT талап етеді

source: this property is not allowed for '%s=%s'
kk: бұл қасиетке '%s=%s' үшін рұқсат жоқ

source: cannot enable ipv4.link-local with ipv4.method=disabled
kk: ipv4.method=disabled болғанда ipv4.link-local іске қосу мүмкін емес

source: cannot disable ipv4.link-local with ipv4.method=link-local
kk: ipv4.method=link-local болғанда ipv4.link-local сөндіру мүмкін емес

source: '%s' is not a valid FQDN
kk: '%s' — жарамды FQDN емес

source: property cannot be set when dhcp-hostname is also set
kk: dhcp-hostname орнатылған кезде қасиетті орнату мүмкін емес

source: FQDN flags requires a FQDN set
kk: FQDN жалаушалары FQDN орнатылуын талап етеді

source: multiple addresses are not allowed for '%s=%s'
kk: '%s=%s' үшін бірнеше адреске рұқсат етілмейді

source: property should be TRUE when method is set to disabled
kk: әдіс сөндірулі күйіне орнатылғанда қасиет TRUE болуы керек

source: method '%s' requires at least an address or a route
kk: '%s' әдісі кем дегенде адресті немесе бағдарды талап етеді

source: value is not a valid token
kk: мән жарамды токен емес

source: only makes sense with EUI64 address generation mode
kk: тек EUI64 адресті генерациялау режимімен ғана мағынасы бар

source: invalid DUID
kk: жарамсыз DUID

source: must be a valid IPv6 address with prefix
kk: префиксі бар жарамды IPv6 адресі болуы керек

source: DHCP DSCP is not supported for IPv6
kk: DHCP DSCP үшін IPv6 қолдауы жоқ
