Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Error: only these fields are allowed: %s
kk: Қате: тек осы өрістерге рұқсат етілген: %s

source: NetworkManager is not running.
kk: NetworkManager орындалып тұрған жоқ.

source: NetworkManager permissions
kk: NetworkManager рұқсаттары

source: Error: 'general permissions': %s
kk: Қате: 'general permissions': %s

source: Error: failed to reload: %s
kk: Қате: қайта жүктеу сәтсіз аяқталды: %s

source: Error: invalid reload flag '%s'. Allowed flags are: %s
kk: Қате: жарамсыз қайта жүктеу жалаушасы '%s'. Рұқсат етілген жалаушалар: %s

source: Error: extra argument '%s'
kk: Қате: қосымша аргумент '%s'

source: NetworkManager logging
kk: NetworkManager журналдауы

source: Error: 'general logging': %s
kk: Қате: 'general logging': %s

source: Error: failed to set logging: %s
kk: Қате: журналдауды орнату сәтсіз аяқталды: %s

source: Error: failed to set hostname: %s
kk: Қате: хост атын орнату сәтсіз аяқталды: %s

source: Error: '--fields' value '%s' is not valid here (allowed field: %s)
kk: Қате: '--fields' мәні '%s' бұл жерде жарамсыз (рұқсат етілген өріс: %s)

source: Error: invalid '%s' argument: '%s' (use on/off).
kk: Қате: жарамсыз '%s' аргументі: '%s' (on/off қолданыңыз).

source: Error: failed to set networking: %s
kk: Қате: желіні орнату сәтсіз аяқталды: %s

source: Connectivity
kk: Қосылым

source: Error: 'networking' command '%s' is not valid.
kk: Қате: 'networking' командасы '%s' жарамсыз.

source: Networking
kk: Желі

source: Radio switches
kk: Радио ауыстырып-қосқыштар

source: Error: failed to set Wi-Fi radio: %s
kk: Қате: Wi-Fi радиосын орнату сәтсіз аяқталды: %s

source: Wi-Fi radio switch
kk: Wi-Fi радио ауыстырып-қосқышы

source: WWAN radio switch
kk: WWAN радио ауыстырып-қосқышы

source: NetworkManager is running
kk: NetworkManager орындалуда

source: NetworkManager is stopped
kk: NetworkManager тоқтатылды

source: Hostname set to '%s'
kk: Хост аты '%s' болып орнатылды

source: '%s' is now the primary connection
kk: '%s' қазір негізгі қосылым

source: There's no primary connection
kk: Негізгі қосылым жоқ

source: Connectivity is now '%s'
kk: Қосылым енді '%s'

source: Networkmanager is now in the '%s' state
kk: Networkmanager қазір '%s' күйінде

source: connection available
kk: қосылым қолжетімді

source: connections available
kk: қосылымдар қолжетімді

source: autoconnect
kk: автоқосылу

source: fw missing
kk: fw жоқ

source: plugin missing
kk: плагин жоқ

source: sw disabled
kk: бағд. қамт. сөндірулі

source: hw disabled
kk: аппараттық сөндірулі

source: sw
kk: бағд. қамт.

source: hw
kk: аппараттық

source: iface
kk: интерфейс

source: port
kk: порт

source: controller
kk: контроллер

source: ip4 default
kk: ip4 әдепкі

source: ip6 default
kk: ip6 әдепкі

source: %s VPN connection
kk: %s VPN қосылымы

# nmcli-overview
source: %s: %s to %s
kk: %s: %s -> %s

source: Use "nmcli device show" to get complete information about known devices and "nmcli connection show" to get an overview on active connection profiles. Consult nmcli(1) and nmcli-examples(7) manual pages for complete usage details.
kk: Белгілі құрылғылар туралы толық ақпарат алу үшін "nmcli device show", ал белсенді қосылым профильдеріне шолу жасау үшін "nmcli connection show" қолданыңыз. Толық пайдалану мәліметтерін алу үшін nmcli(1) және nmcli-examples(7) нұсқаулық беттерін қараңыз.

source: Error: 'monitor' command '%s' is not valid.
kk: Қате: 'monitor' командасы '%s' жарамсыз.

source: Usage: nmcli [OPTIONS] OBJECT { COMMAND | help } OPTIONS -a, --ask ask for missing parameters -c, --colors auto|yes|no whether to use colors in output -e, --escape yes|no escape columns separators in values -f, --fields <field,...>|all|common specify fields to output -g, --get-values <field,...>|all|common shortcut for -m tabular -t -f -h, --help print this help -m, --mode tabular|multiline output mode -o, --overview overview mode -p, --pretty pretty output -s, --show-secrets allow displaying passwords -t, --terse terse output -v, --version show program version -w, --wait <seconds> set timeout waiting for finishing operations OBJECT g[eneral] NetworkManager's general status and operations n[etworking] overall networking control r[adio] NetworkManager radio switches c[onnection] NetworkManager's connections d[evice] devices managed by NetworkManager a[gent] NetworkManager secret agent or polkit agent m[onitor] monitor NetworkManager changes
kk: Қолданылуы: nmcli [OPTIONS] OBJECT { COMMAND | help } OPTIONS -a, --ask жетіспейтін параметрлерді сұрау -c, --colors auto|yes|no шығыста түстерді қолдану-қолданбау -e, --escape yes|no мәндердегі баған ажыратқыштарын экрандау -f, --fields <field,...>|all|common шығарылатын өрістерді көрсету -g, --get-values <field,...>|all|common -m tabular -t -f үшін жарлық -h, --help осы көмекті шығару -m, --mode tabular|multiline шығару режимі -o, --overview шолу режимі -p, --pretty әдемі шығару -s, --show-secrets парольдерді көрсетуге рұқсат ету -t, --terse қысқаша шығару -v, --version бағдарлама нұсқасын көрсету -w, --wait <seconds> операциялардың аяқталуын күту уақытын орнату OBJECT g[eneral] NetworkManager жалпы күйі және операциялары n[etworking] жалпы желіні басқару r[adio] NetworkManager радио ауыстырып-қосқыштары c[onnection] NetworkManager қосылымдары d[evice] NetworkManager басқаратын құрылғылар a[gent] NetworkManager құпия агенті немесе polkit агенті m[onitor] NetworkManager өзгерістерін бақылау

source: Error: missing argument for '%s' option.
kk: Қате: '%s' опциясы үшін аргумент жетіспейді.

source: Unexpected end of file following '%s'
kk: '%s' соңынан файлдың күтпеген соңы келді

source: Expected whitespace following '%s'
kk: '%s' соңынан бос орын күтілді

source: Expected a value for '%s'
kk: '%s' үшін мән күтілді

source: Expected a line break following '%s'
kk: '%s' соңынан жол үзілімі күтілді

source: Error: Option '--terse' is specified the second time.
kk: Қате: '--terse' опциясы екінші рет көрсетілген.

source: Error: Option '--terse' is mutually exclusive with '--pretty'.
kk: Қате: '--terse' опциясы '--pretty' опциясымен қатар қолданылмайды.

source: Error: Option '--pretty' is specified the second time.
kk: Қате: '--pretty' опциясы екінші рет көрсетілген.

source: Error: Option '--pretty' is mutually exclusive with '--terse'.
kk: Қате: '--pretty' опциясы '--terse' опциясымен қатар қолданылмайды.

source: Error: '%s' is not a valid argument for '%s' option.
kk: Қате: '%s' — '%s' опциясы үшін жарамды аргумент емес.

source: Error: '%s' is not valid argument for '%s' option.
kk: Қате: '%s' — '%s' опциясы үшін жарамды аргумент емес.

source: nmcli tool, version %s
kk: nmcli құралы, нұсқасы %s

source: Error: Option '%s' is unknown, try 'nmcli -help'.
kk: Қате: '%s' опциясы белгісіз, 'nmcli -help' көріңіз.

source: Error: nmcli terminated by signal %s (%d)
kk: Қате: nmcli %s (%d) сигналымен тоқтатылды

source: Success
kk: Сәтті

source: Error: polkit agent failed: %s
kk: Қате: polkit агенті сәтсіз аяқталды: %s

source: Warning: polkit agent initialization failed: %s
kk: Ескерту: polkit агентін инициализациялау сәтсіз аяқталды: %s

source: Do you also want to set '%s' to '%s'? [yes]:
kk: Сондай-ақ '%s' мәнін '%s' етіп орнатқыңыз келе ме? [yes]:

source: Do you also want to clear '%s'? [yes]:
kk: Сондай-ақ '%s' тазалағыңыз келе ме? [yes]:

source: Warning: %s.%s set to '%s', but it might be ignored in infrastructure mode
kk: Ескерту: %s.%s мәні '%s' етіп орнатылды, бірақ ол инфрақұрылым режимінде еленбеуі мүмкін

source: Warning: setting %s.%s requires removing ipv4 and ipv6 settings
kk: Ескерту: %s.%s орнату ipv4 және ipv6 баптауларын өшіруді талап етеді

source: Do you want to remove them? [yes]
kk: Оларды өшіргіңіз келе ме? [yes]

source: Warning: %s is not an UUID of any existing connection profile
kk: Ескерту: %s ешқандай бар қосылым профилінің UUID-ы емес

source: '%s' is not a VPN connection profile
kk: '%s' — VPN қосылым профилі емес

source: '%s' is not a name of any existing profile
kk: '%s' — ешқандай бар профильдің аты емес

source: Warning: %s
kk: Ескерту: %s

source: Info: %s
kk: Ақпарат: %s

source: don't know how to get the property value
kk: қасиет мәнін қалай алу керектігі белгісіз

source: the property can't be changed
kk: қасиетті өзгерту мүмкін емес

source: [NM property description]
kk: [NM қасиетінің сипаттамасы]

source: [nmcli specific description]
kk: [nmcli арнайы сипаттамасы]

source: Error: Argument '%s' was expected, but '%s' provided.
kk: Қате: '%s' аргументі күтілген, бірақ '%s' берілді.

source: Error: Unexpected argument '%s'
kk: Қате: Күтпеген аргумент '%s'

source: invalid field '%s%s%s'; no such field
kk: жарамсыз өріс '%s%s%s'; ондай өріс жоқ

source: invalid field '%s%s%s'; allowed fields: [%s]
kk: жарамсыз өріс '%s%s%s'; рұқсат етілген өрістер: [%s]

source: failure to select field
kk: өрісті таңдау сәтсіз аяқталды

source: Failed to create pager pipe: %s
kk: Пейджер түтігін жасау сәтсіз аяқталды: %s

source: Failed to fork pager: %s
kk: Пейджерді айырлау сәтсіз аяқталды: %s

source: Failed to duplicate pager pipe: %s
kk: Пейджер түтігін қайталау сәтсіз аяқталды: %s

source: Warning: nmcli (%s) and NetworkManager (%s) versions don't match. Restarting NetworkManager is advised.
kk: Ескерту: nmcli (%s) және NetworkManager (%s) нұсқалары сәйкес келмейді. NetworkManager-ді қайта іске қосу ұсынылады.

source: (unknown)
kk: (белгісіз)

source: Ethernet connection %d
kk: Ethernet қосылымы %d

source: Veth connection %d
kk: Veth қосылымы %d

source: Loopback connection %d
kk: Loopback қосылымы %d

source: Wi-Fi connection %d
kk: Wi-Fi қосылымы %d

source: InfiniBand connection %d
kk: InfiniBand қосылымы %d

source: Mobile broadband connection %d
kk: Мобильді кең жолақты қосылым %d

source: DSL connection %d
kk: DSL қосылымы %d

source: Bond connection %d
kk: Bond қосылымы %d

source: Bridge connection %d
kk: Bridge қосылымы %d

source: Team connection %d
kk: Team қосылымы %d

source: VLAN connection %d
kk: VLAN қосылымы %d

source: IP tunnel
kk: IP туннелі

source: IP tunnel connection %d
kk: IP туннель қосылымы %d

source: MACsec connection %d
kk: MACsec қосылымы %d

source: VPN connection %d
kk: VPN қосылымы %d

source: WireGuard connection %d
kk: WireGuard қосылымы %d

source: Default
kk: Әдепкі

source: Disable
kk: Сөндіру

source: Enable
kk: Іске қосу

source: Disable time checks
kk: Уақыт тексерулерін сөндіру

source: Show expert TLS options
kk: Сарапшы TLS опцияларын көрсету

source: Wpa_supplicant settings:
kk: Wpa_supplicant баптаулары:

source: Cipher string
kk: Шифр жолы

source: Domain
kk: Домен

source: CA cert
kk: CA сертификаты

source: CA cert password
kk: CA сертификатының паролі

source: User cert
kk: Пайдаланушы сертификаты

source: User cert password
kk: Пайдаланушы сертификатының паролі

source: User private key
kk: Пайдаланушының жеке кілті

source: User privkey password
kk: Пайдаланушының жеке кілтінің паролі

source: MSCHAPv2 (no EAP)
kk: MSCHAPv2 (EAP жоқ)

source: Anonymous identity
kk: Анонимді идентификация

source: Inner authentication
kk: Ішкі аутентификация

source: Automatic
kk: Автоматты

source: Version 0
kk: Нұсқа 0

source: Version 1
kk: Нұсқа 1

source: PEAP version
kk: PEAP нұсқасы

source: No devices available
kk: Құрылғылар қолжетімсіз

source: Select...
kk: Таңдау...

source: Add
kk: Қосу

source: Edit...
kk: Түзету...

source: Delete
kk: Өшіру

source: Hide
kk: Жасыру

source: Show
kk: Көрсету

source: Could not create editor for connection '%s' of type '%s'.
kk: '%s' қосылымы ('%s' түрі) үшін түзеткішті жасау мүмкін емес.

source: Could not create editor for invalid connection '%s'.
kk: Жарамсыз '%s' қосылымы үшін түзеткішті жасау мүмкін емес.

source: Edit Connection
kk: Қосылымды түзету

source: Unable to save connection: %s
kk: Қосылымды сақтау мүмкін емес: %s

source: Unable to add new connection: %s
kk: Жаңа қосылымды қосу мүмкін емес: %s

source: Profile name
kk: Профиль аты

source: Ethernet device
kk: Ethernet құрылғысы

source: Device
kk: Құрылғы

source: Automatically connect
kk: Автоматты түрде қосылу

source: Available to all users
kk: Барлық пайдаланушыларға қолжетімді

source: Cancel
kk: Бас тарту

source: (default)
kk: (әдепкі)

source: bytes
kk: байт

source: BOND PORT
kk: BOND ПОРТЫ

source: MII (recommended)
kk: MII (ұсынылады)

source: Ports
kk: Порттар

source: Mode
kk: Режим

source: Primary
kk: Негізгі

source: Link monitoring
kk: Сілтемені бақылау

# milliseconds
source: ms
kk: мс

source: Monitoring frequency
kk: Бақылау жиілігі

source: Link up delay
kk: Сілтеменің қосылу кідірісі

source: Link down delay
kk: Сілтеменің ажырау кідірісі

source: ARP targets
kk: ARP мақсаттары

source: Cloned MAC address
kk: Клондалған MAC адресі

source: BRIDGE PORT
kk: BRIDGE ПОРТЫ

source: Priority
kk: Басымдық

source: Path cost
kk: Жол құны

source: Hairpin mode
kk: Hairpin режимі

source: seconds
kk: секунд

source: Aging time
kk: Ескіру уақыты

source: Enable STP (Spanning Tree Protocol)
kk: STP (Spanning Tree Protocol) іске қосу

source: 802.1X SECURITY
kk: 802.1X ҚАУІПСІЗДІГІ

source: Enable 802.1X security
kk: 802.1X қауіпсіздігін іске қосу

source: Datagram
kk: Датаграмма

source: Connected
kk: Қосылған

source: Parent
kk: Ата-аналық

source: Local IP
kk: Жергілікті IP

source: Remote IP
kk: Қашықтағы IP

source: Input key
kk: Кіріс кілті

source: Output key
kk: Шығыс кілті

source: Disabled
kk: Сөндірулі

source: Manual
kk: Қолмен

source: Shared
kk: Бөлісілген

source: (No custom routes)
kk: (Таңдаулы маршруттар жоқ)

source: One custom route
kk: %d пайдаланушылық маршрут

source: IPv4 CONFIGURATION
kk: IPv4 КОНФИГУРАЦИЯСЫ

source: Addresses
kk: Адрестер

source: Gateway
kk: Шлюз

source: DNS servers
kk: DNS серверлері

source: Search domains
kk: Іздеу домендері

source: Routing
kk: Маршруттау

source: Never use this network for default route
kk: Бұл желіні әдепкі маршрут үшін ешқашан қолданбау

source: Ignore automatically obtained routes
kk: Автоматты түрде алынған маршруттарды елемеу

source: Ignore automatically obtained DNS parameters
kk: Автоматты түрде алынған DNS параметрлерін елемеу

source: Require IPv4 addressing for this connection
kk: Осы қосылым үшін IPv4 адрестеуін талап ету

source: Ignore
kk: Елемеу

source: Automatic (DHCP-only)
kk: Автоматты (тек DHCP)

source: IPv6 CONFIGURATION
kk: IPv6 КОНФИГУРАЦИЯСЫ

source: Require IPv6 addressing for this connection
kk: Осы қосылым үшін IPv6 адрестеуін талап ету

source: Check
kk: Тексеру

source: Strict
kk: Қатаң

source: Parent device
kk: Ата-аналық құрылғы

source: Validation
kk: Валидация

source: Encrypt traffic
kk: Трафикті шифрлау

source: PPP CONFIGURATION
kk: PPP КОНФИГУРАЦИЯСЫ

source: Allowed authentication methods:
kk: Рұқсат етілген аутентификация әдістері:

source: Use point-to-point encryption (MPPE)
kk: Нүктеден нүктеге шифрлауды (MPPE) қолдану

source: Require 128-bit encryption
kk: 128-биттік шифрлауды талап ету

source: Use stateful MPPE
kk: Күйді сақтайтын MPPE қолдану

source: Allow BSD data compression
kk: BSD деректерді сығуға рұқсат ету

source: Allow Deflate data compression
kk: Deflate деректерді сығуға рұқсат ету

source: Use TCP header compression
kk: TCP тақырыптамасын сығуды қолдану

source: Send PPP echo packets
kk: PPP жаңғырық пакеттерін жіберу

source: TEAM PORT
kk: TEAM ПОРТЫ

source: JSON configuration
kk: JSON конфигурациясы

# Wi-Fi
source: Client
kk: Клиент

source: Access Point
kk: Қатынау нүктесі

source: Ad-Hoc Network
kk: Ad-Hoc желісі

# Wi-Fi
source: Automatic
kk: Автоматты

# Wi-Fi security
source: None
kk: Жоқ

source: WPA & WPA2 Personal
kk: WPA & WPA2 жеке

source: WPA3 Personal
kk: WPA3 жеке

source: WPA & WPA2 Enterprise
kk: WPA & WPA2 корпоративтік

source: Enhanced Open (OWE)
kk: Жақсартылған Open (OWE)

source: WEP 40/128-bit Key (Hex or ASCII)
kk: WEP 40/128-биттік кілт (Hex немесе ASCII)

source: WEP 128-bit Passphrase
kk: WEP 128-биттік кілттік фраза

source: Dynamic WEP (802.1x)
kk: Динамикалық WEP (802.1x)

# WEP key index
source: 1 (Default)
kk: 1 (Әдепкі)

source: Open System
kk: Ашық жүйе

source: Shared Key
kk: Бөлісілген кілт

source: Channel
kk: Арна

source: WEP index
kk: WEP индексі

source: Authentication
kk: Аутентификация

source: (No support for dynamic-wep yet...)
kk: (dynamic-wep үшін әзірге қолдау жоқ...)

source: Private key
kk: Жеке кілт

source: Listen port
kk: Тыңдау порты

source: Add peer routes
kk: Пир маршруттарын қосу

source: Peers
kk: Пирлер

source: Store password for all users
kk: Парольді барлық пайдаланушылар үшін сақтау

source: Store password only for this user
kk: Парольді тек осы пайдаланушы үшін сақтау

source: Ask password every time
kk: Парольді әр кезде сұрау

source: Show password
kk: Парольді көрсету

source: Select the type of port connection you wish to add.
kk: Қосқыңыз келетін порт қосылымының түрін таңдаңыз.

source: Destination
kk: Мақсаты

source: Prefix
kk: Префикс

source: Next Hop
kk: Келесі секіріс

source: Metric
kk: Метрика

source: No custom routes are defined.
kk: Таңдаулы маршруттар анықталмаған.

source: Add...
kk: Қосу...

source: Remove
kk: Өшіру

source: Public key
kk: Ашық кілт

source: Allowed IPs
kk: Рұқсат етілген IP-тер

source: Endpoint
kk: Соңғы нүкте

source: Preshared key
kk: Алдын ала бөлісілген кілт

source: seconds
kk: секунд

source: Persistent keepalive
kk: Тұрақты keepalive

source: openconnect will be run to authenticate. It will return to nmtui when completed.
kk: түпнұсқалық растау үшін openconnect іске қосылады. Аяқталғанда nmtui-ге қайта оралады.

source: Error: openconnect failed: %s
kk: Қате: openconnect сәтсіз аяқталды: %s

source: Activation failed: %s
kk: Белсендіру сәтсіз аяқталды: %s

source: Could not deactivate connection: %s
kk: Қосылымды сөндіру мүмкін емес: %s

source: Connecting...
kk: Қосылуда...

source: Could not activate connection: %s
kk: Қосылымды белсендіру мүмкін емес: %s

source: Activate
kk: Белсендіру

source: Deactivate
kk: Сөндіру

source: Rescanning Wi-Fi devices...
kk: Wi-Fi құрылғыларын қайта сканерлеу...

source: Wi-Fi scan failed for device : %s
kk: Құрылғы үшін Wi-Fi сканерлеу сәтсіз аяқталды : %s

source: Wi-Fi scan timed out for device : %s
kk: Құрылғы үшін Wi-Fi сканерлеу уақыты өтті : %s

source: No active Wi-Fi devices found
kk: Белсенді Wi-Fi құрылғылары табылмады

source: Rescan Wi-Fi
kk: Wi-Fi қайта сканерлеу

source: Quit
kk: Шығу

source: Back
kk: Артқа

source: No such connection '%s'
kk: Ондай қосылым жоқ '%s'

source: Connection is already active
kk: Қосылым қазірдің өзінде белсенді

source: Create
kk: Жасау

source: Select the type of connection you wish to create.
kk: Жасағыңыз келетін қосылым түрін таңдаңыз.

source: If you are creating a VPN, and the VPN connection you wish to create does not appear in the list, you may not have the correct VPN plugin installed.
kk: Егер сіз VPN жасап жатсаңыз және жасағыңыз келетін VPN қосылымы тізімде пайда болмаса, сізде дұрыс VPN плагині орнатылмаған болуы мүмкін.

source: New Connection
kk: Жаңа қосылым

source: Unable to delete connection: %s
kk: Қосылымды өшіру мүмкін емес: %s

source: Could not delete connection '%s': %s
kk: '%s' қосылымын өшіру мүмкін емес: %s

source: Are you sure you want to delete the connection '%s'?
kk: '%s' қосылымын өшіргіңіз келетініне сенімдісіз бе?

source: Set Hostname
kk: Хост атын орнату

source: Hostname
kk: Хост аты

source: Set hostname to '%s'
kk: Хост атын '%s' етіп орнату

source: Unable to set hostname: %s
kk: Хост атын орнату мүмкін емес: %s

source: Set the radio switches status
kk: Радио ауыстырып-қосқыштардың күйін орнату

source: Hardware:
kk: Аппараттық:

source: Missing
kk: Жоқ

source: Enabled
kk: Іске қосылған

source: Software:
kk: Бағдарламалық:

source: connection
kk: қосылым

source: Edit a connection
kk: Қосылымды түзету

source: Activate a connection
kk: Қосылымды белсендіру

source: new hostname
kk: жаңа хост аты

source: Set system hostname
kk: Жүйелік хост атын орнату

source: radio
kk: радио

source: Radio
kk: Радио

source: Please select an option
kk: Опцияны таңдаңыз

source: Usage
kk: Қолданылуы

source: Could not parse arguments
kk: Аргументтерді талдау мүмкін емес

source: Could not contact NetworkManager: %s.
kk: NetworkManager-мен байланысу мүмкін емес: %s.
