Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Identifies specific subchannels that this network device uses for communication with z/VM or s390 host. Like the "mac-address" property for non-z/VM devices, this property can be used to ensure this connection only applies to the network device that uses these subchannels. The list should contain exactly 3 strings, and each string may only be composed of hexadecimal characters and the period (.) character.
kk: Осы желілік құрылғы z/VM немесе s390 хостымен қосылу үшін қолданатын арнайы ішкі арналарды анықтайды. z/VM емес құрылғылар үшін "mac-address" қасиеті сияқты, бұл қасиет осы қосылымның тек осы ішкі арналарды қолданатын желілік құрылғыға қолданылуын қамтамасыз ету үшін қолданылуы мүмкін. Тізім дәл 3 жолды қамтуы керек және әр жол тек он алтылық таңбалардан және нүкте (.) таңбасынан тұруы мүмкін.

source: When a value greater than 0 is set, configures the device to use the specified speed. If "auto-negotiate" is "yes" the specified speed will be the only one advertised during link negotiation: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabit speeds, as in this case link negotiation is mandatory. If the value is unset (0, the default), the link configuration will be either skipped (if "auto-negotiate" is "no", the default) or will be auto-negotiated (if "auto-negotiate" is "yes") and the local device will advertise all the supported speeds. In Mbit/s, ie 100 == 100Mbit/s. Must be set together with the "duplex" property when non-zero. Before specifying a speed value be sure your device supports it.
kk: 0-ден үлкен мән орнатылған кезде, құрылғыны көрсетілген жылдамдықты қолдануға баптайды. Егер "auto-negotiate" "yes" болса, көрсетілген жылдамдық сілтеме келіссөзі кезінде жарияланатын жалғыз жылдамдық болады: бұл тек BASE-T 802.3 спецификациялары үшін жұмыс істейді және гигабиттік жылдамдықтарды мәжбүрлеу үшін пайдалы, өйткені бұл жағдайда сілтеме келіссөзі міндетті болып табылады. Егер мән орнатылмаған болса (0, әдепкі), сілтеме конфигурациясы не өткізіліп жіберіледі (егер "auto-negotiate" "no" болса, әдепкі) немесе автокеліссөз жүргізіледі (егер "auto-negotiate" "yes" болса) және жергілікті құрылғы барлық қолдау көрсетілетін жылдамдықтарды жариялайды. Мбит/с-пен, яғни 100 == 100Мбит/с. Нөл емес болғанда "duplex" қасиетімен бірге орнатылуы керек. Жылдамдық мәнін көрсетпес бұрын құрылғыңыздың оны қолдайтынына көз жеткізіңіз.

source: The NMSettingWiredWakeOnLan options to enable. Not all devices support all options. May be any combination of "phy" (0x2), "unicast" (0x4), "multicast" (0x8), "broadcast" (0x10), "arp" (0x20), "magic" (0x40) or the special values "default" (0x1) (to use global settings) and "ignore" (0x8000) (to disable management of Wake-on-LAN in NetworkManager).
kk: Іске қосылатын NMSettingWiredWakeOnLan опциялары. Барлық құрылғылар барлық опцияларды қолдай бермейді. "phy" (0x2), "unicast" (0x4), "multicast" (0x8), "broadcast" (0x10), "arp" (0x20), "magic" (0x40) кез келген комбинациясы немесе "default" (0x1) (глобалды баптауларды қолдану үшін) және "ignore" (0x8000) (NetworkManager-де Wake-on-LAN басқаруын сөндіру үшін) арнайы мәндері болуы мүмкін.

source: If specified, the password used with magic-packet-based Wake-on-LAN, represented as an Ethernet MAC address. If NULL, no password will be required.
kk: Егер көрсетілсе, Ethernet MAC адресі ретінде ұсынылған сиқырлы пакетке негізделген Wake-on-LAN-мен қолданылатын пароль. Егер NULL болса, ешқандай пароль талап етілмейді.

source: The use of fwmark is optional and is by default off. Setting it to 0 disables it. Otherwise, it is a 32-bit fwmark for outgoing packets. Note that "ip4-auto-default-route" or "ip6-auto-default-route" enabled, implies to automatically choose a fwmark.
kk: fwmark қолдану міндетті емес және әдепкі бойынша өшірулі. Оны 0-ге орнату оны сөндіреді. Әйтпесе, бұл шығыс пакеттер үшін 32 биттік fwmark. Ескеріңіз, "ip4-auto-default-route" немесе "ip6-auto-default-route" іске қосылған болса, fwmark-ты автоматты түрде таңдауды білдіреді.

source: Whether to enable special handling of the IPv4 default route. If enabled, the IPv4 default route from wireguard.peer-routes will be placed to a dedicated routing-table and two policy routing rules will be added. The fwmark number is also used as routing-table for the default-route, and if fwmark is zero, an unused fwmark/table is chosen automatically. This corresponds to what wg-quick does with Table=auto and what WireGuard calls "Improved Rule-based Routing". Note that for this automatism to work, you usually don't want to set ipv4.gateway, because that will result in a conflicting default route. Leaving this at the default will enable this option automatically if ipv4.never-default is not set and there are any peers that use a default-route as allowed-ips. Since this automatism only makes sense if you also have a peer with an /0 allowed-ips, it is usually not necessary to enable this explicitly. However, you can disable it if you want to configure your own routing and rules.
kk: IPv4 әдепкі бағдарының арнайы өңделуін іске қосу керек пе. Егер іске қосылса, wireguard.peer-routes ішінен IPv4 әдепкі бағдары арнайы бағыттау кестесіне орналастырылады және екі саясат бағыттау ережесі қосылады. fwmark нөмірі де әдепкі бағдар үшін бағыттау кестесі ретінде қолданылады және егер fwmark нөл болса, пайдаланылмаған fwmark/кесте автоматты түрде таңдалады. Бұл wg-quick Table=auto арқылы жасайтын әрекетке және WireGuard "Жақсартылған Ережеге негізделген Бағыттау" деп атайтын әрекетке сәйкес келеді. Ескеріңіз, бұл автоматизм жұмыс істеуі үшін әдетте ipv4.gateway орнатқыңыз келмейді, өйткені бұл қайшы келетін әдепкі бағдарға әкеледі. Мұны әдепкі күйде қалдыру, егер ipv4.never-default орнатылмаған болса және allowed-ips ретінде әдепкі бағдарды қолданатын кез келген серіктестер болса, бұл опцияны автоматты түрде іске қосады. Бұл автоматизм тек сізде /0 allowed-ips бар серіктес болған жағдайда ғана мағыналы болғандықтан, әдетте оны айқын түрде іске қосу қажет емес. Алайда, егер өз бағыттауыңыз бен ережелеріңізді баптағыңыз келсе, оны сөндіре аласыз.

source: Like ip4-auto-default-route, but for the IPv6 default route.
kk: ip4-auto-default-route сияқты, бірақ IPv6 әдепкі бағдары үшін.

source: The listen-port. If listen-port is not specified, the port will be chosen randomly when the interface comes up.
kk: Тыңдау порты. Егер тыңдау порты көрсетілмесе, интерфейс көтерілген кезде порт кездейсоқ таңдалады.

source: If non-zero, only transmit packets of the specified size or smaller, breaking larger packets up into multiple fragments. If zero a default MTU is used. Note that contrary to wg-quick's MTU setting, this does not take into account the current routes at the time of activation.
kk: Егер нөл болмаса, тек көрсетілген өлшемдегі немесе одан кіші пакеттерді жібереді, үлкен пакеттерді бірнеше фрагменттерге бөледі. Егер нөл болса, әдепкі MTU қолданылады. Ескеріңіз, wg-quick MTU баптауына қарағанда, бұл белсендіру кезіндегі ағымдағы бағдарларды ескермейді.

source: Whether to automatically add routes for the AllowedIPs ranges of the peers. If TRUE (the default), NetworkManager will automatically add routes in the routing tables according to ipv4.route-table and ipv6.route-table. Usually you want this automatism enabled. If FALSE, no such routes are added automatically. In this case, the user may want to configure static routes in ipv4.routes and ipv6.routes, respectively. Note that if the peer's AllowedIPs is "0.0.0.0/0" or "::/0" and the profile's ipv4.never-default or ipv6.never-default setting is enabled, the peer route for this peer won't be added automatically.
kk: Серіктестердің AllowedIPs ауқымдары үшін бағдарларды автоматты түрде қосу керек пе. Егер TRUE (әдепкі) болса, NetworkManager ipv4.route-table және ipv6.route-table сәйкес бағыттау кестелеріне бағдарларды автоматты түрде қосады. Әдетте бұл автоматизмнің іске қосылғанын қалайсыз. Егер FALSE болса, мұндай бағдарлар автоматты түрде қосылмайды. Бұл жағдайда пайдаланушы статикалық бағдарларды ipv4.routes және ipv6.routes ішінде сәйкесінше баптағысы келуі мүмкін. Ескеріңіз, егер серіктестің AllowedIPs "0.0.0.0/0" немесе "::/0" болса және профильдің ipv4.never-default немесе ipv6.never-default баптауы іске қосылған болса, осы серіктес үшін серіктес бағдары автоматты түрде қосылмайды.

source: A comma-separated list of WireGuard peers. Each peer has the following syntax: PUBLIC_KEY [ATTRIBUTE=VALUE [ATTRIBUTE=VALUE]...] The supported attributes are: endpoint, allowed-ips, persistent-keepalive, preshared-key, preshared-key-flags.
kk: Үтірмен бөлінген WireGuard серіктестерінің тізімі. Әр серіктестің келесі синтаксисі бар: АШЫҚ_КІЛТ [АТРИБУТ=МӘН [АТРИБУТ=МӘН]...] Қолдау көрсетілетін атрибуттар: endpoint, allowed-ips, persistent-keepalive, preshared-key, preshared-key-flags.

source: The 256 bit private-key in base64 encoding.
kk: base64 кодтауындағы 256 биттік жеке кілт.

source: Flags indicating how to handle the "private-key" property.
kk: "private-key" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Configures AP isolation, which prevents communication between wireless devices connected to this AP. This property can be set to a value different from "default" (-1) only when the interface is configured in AP mode. If set to "true" (1), devices are not able to communicate with each other. This increases security because it protects devices against attacks from other clients in the network. At the same time, it prevents devices to access resources on the same wireless networks as file shares, printers, etc. If set to "false" (0), devices can talk to each other. When set to "default" (-1), the global default is used; in case the global default is unspecified it is assumed to be "false" (0).
kk: AP оқшаулауын баптайды, бұл осы AP-ге қосылған сымсыз құрылғылар арасындағы қосылымға жол бермейді. Бұл қасиетті "default" (-1) мәнінен басқа мәнге тек интерфейс AP режимінде бапталған кезде ғана орнатуға болады. Егер "true" (1) мәніне орнатылса, құрылғылар бір-бірімен байланыса алмайды. Бұл қауіпсіздікті арттырады, өйткені ол құрылғыларды желідегі басқа клиенттердің шабуылынан қорғайды. Сонымен қатар, ол құрылғылардың файл бөлісулері, принтерлер, т.б. сияқты бір сымсыз желілердегі ресурстарға қол жеткізуіне жол бермейді. Егер "false" (0) мәніне орнатылса, құрылғылар бір-бірімен сөйлесе алады. "default" (-1) мәніне орнатылған кезде, глобалды әдепкі қолданылады; глобалды әдепкі көрсетілмеген жағдайда, ол "false" (0) деп есептеледі.

source: 802.11 frequency band of the network. One of "a" for 5GHz, "bg" for 2.4GHz or "6GHz". This will lock associations to the Wi-Fi network to the specific band, i.e. if "a" is specified, the device will not associate with the same network in the 2.4GHz (bg) or 6GHz bands even if the network's settings are compatible. This setting depends on specific driver capability and may not work with all drivers.
kk: Желінің 802.11 жиілік диапазоны. 5ГГц үшін "a", 2.4ГГц үшін "bg" немесе "6GHz" біреуі. Бұл Wi-Fi желісіне ассоциацияларды нақты диапазонға құлыптайды, яғни егер "a" көрсетілсе, құрылғы желінің баптаулары үйлесімді болса да 2.4ГГц (bg) немесе 6ГГц диапазондарындағы сол желімен ассоциацияланбайды. Бұл баптау нақты драйвер мүмкіндігіне байланысты және барлық драйверлермен жұмыс істемеуі мүмкін.

source: If specified, directs the device to only associate with the given access point. This capability is highly driver dependent and not supported by all devices. Note: this property does not control the BSSID used when creating an Ad-Hoc network and is unlikely to in the future. Locking a client profile to a certain BSSID will prevent roaming and also disable background scanning. That can be useful, if there is only one access point for the SSID.
kk: Егер көрсетілсе, құрылғыны тек берілген қол жеткізу нүктесімен ассоциациялануға бағыттайды. Бұл мүмкіндік драйверге қатты тәуелді және барлық құрылғылар қолдамайды. Ескерту: бұл қасиет Ad-Hoc желісін жасау кезінде қолданылатын BSSID-ті басқармайды және болашақта басқаруы екіталай. Клиент профилін белгілі бір BSSID-ге құлыптау роумингке жол бермейді және фондық сканерлеуді сөндіреді. Бұл SSID үшін тек бір қол жеткізу нүктесі болса пайдалы болуы мүмкін.

source: Wireless channel to use for the Wi-Fi connection. The device will only join (or create for Ad-Hoc networks) a Wi-Fi network on the specified channel. Because channel numbers overlap between bands, this property also requires the "band" property to be set.
kk: Wi-Fi қосылымы үшін қолданылатын сымсыз арна. Құрылғы тек көрсетілген арнадағы Wi-Fi желісіне қосылады (немесе Ad-Hoc желілері үшін жасайды). Арна нөмірлері диапазондар арасында қабаттасатындықтан, бұл қасиет сонымен қатар "band" қасиетінің орнатылуын талап етеді.

source: Specifies width of the wireless channel in Access Point (AP) mode. When set to "auto" (0) (the default), the channel width is automatically determined. At the moment, this means that the safest (smallest) width is chosen. If the value is not "auto" (0), then the 'channel' property must also be set. When using the 2.4GHz band, the width can be at most 40MHz. This property can be set to a value different from "auto" (0) only when the interface is configured in AP mode.
kk: Қол жеткізу Нүктесі (AP) режиміндегі сымсыз арнаның енін көрсетеді. "auto" (0) (әдепкі) мәніне орнатылған кезде, арна ені автоматты түрде анықталады. Қазіргі уақытта бұл ең қауіпсіз (ең кіші) ен таңдалатынын білдіреді. Егер мән "auto" (0) болмаса, онда 'channel' қасиеті де орнатылуы керек. 2.4ГГц диапазонын қолданған кезде, ен ең көп дегенде 40МГц болуы мүмкін. Бұл қасиетті "auto" (0) мәнінен басқа мәнге тек интерфейс AP режимінде бапталған кезде ғана орнатуға болады.

source: If specified, request that the device use this MAC address instead. This is known as MAC cloning or spoofing. Beside explicitly specifying a MAC address, the special values "preserve", "permanent", "random", "stable" and "stable-ssid" are supported. "preserve" means not to touch the MAC address on activation. "permanent" means to use the permanent hardware address of the device. "random" creates a random MAC address on each connect. "stable" creates a hashed MAC address based on connection.stable-id and a machine dependent key. "stable-ssid" creates a hashed MAC address based on the SSID, the same as setting the stable-id to "${NETWORK_SSID}". If unspecified, the value can be overwritten via global defaults, see manual of NetworkManager.conf. If still unspecified, it defaults to "preserve" (older versions of NetworkManager may use a different default value). On D-Bus, this field is expressed as "assigned-mac-address" or the deprecated "cloned-mac-address".
kk: Егер көрсетілсе, құрылғының оның орнына осы MAC адресін қолдануын сұраңыз. Бұл MAC клондау немесе спуфинг ретінде белгілі. MAC адресін айқын көрсетуден басқа, "preserve", "permanent", "random", "stable" және "stable-ssid" арнайы мәндеріне қолдау көрсетіледі. "preserve" белсендіру кезінде MAC адресіне тиіспеуді білдіреді. "permanent" құрылғының тұрақты аппараттық адресін қолдануды білдіреді. "random" әр қосылу кезінде кездейсоқ MAC адресін жасайды. "stable" connection.stable-id және машинаға тәуелді кілт негізінде хэштелген MAC адресін жасайды. "stable-ssid" stable-id-ті "${NETWORK_SSID}" етіп орнатумен бірдей SSID негізінде хэштелген MAC адресін жасайды. Егер көрсетілмесе, мән глобалды әдепкілер арқылы қайта жазылуға жарамды, NetworkManager.conf нұсқаулығын қараңыз. Егер әлі көрсетілмесе, ол әдепкі бойынша "preserve" болады (NetworkManager ескі нұсқалары басқа әдепкі мәнді қолдануы мүмкін). D-Bus-та бұл өріс "assigned-mac-address" немесе ескірген "cloned-mac-address" ретінде көрсетіледі.

source: If TRUE, indicates that the network is a non-broadcasting network that hides its SSID. This works both in infrastructure and AP mode. In infrastructure mode, various workarounds are used for a more reliable discovery of hidden networks, such as probe-scanning the SSID. However, these workarounds expose inherent insecurities with hidden SSID networks, and thus hidden SSID networks should be used with caution. In AP mode, the created network does not broadcast its SSID. Note that marking the network as hidden may be a privacy issue for you (in infrastructure mode) or client stations (in AP mode), as the explicit probe-scans are distinctly recognizable on the air.
kk: Егер TRUE болса, желінің өз SSID жасыратын таратылмайтын желі екенін көрсетеді. Бұл инфрақұрылым және AP режимінде де жұмыс істейді. Инфрақұрылым режимінде жасырын желілерді сенімдірек табу үшін SSID-ті зонд-сканерлеу сияқты әртүрлі уақытша шешімдер қолданылады. Алайда, бұл уақытша шешімдер жасырын SSID желілеріндегі тән қауіпсіздіксіздіктерді әшкерелейді, сондықтан жасырын SSID желілерін сақтықпен қолдану керек. AP режимінде жасалған желі өз SSID таратпайды. Ескеріңіз, желіні жасырын деп белгілеу сіз үшін (инфрақұрылым режимінде) немесе клиенттік станциялар үшін (AP режимінде) жекелік мәселесі болуы мүмкін, өйткені айқын зонд-сканерлеулер ауада анық танылады.

source: If specified, this connection will only apply to the Wi-Fi device whose permanent MAC address matches. This property does not change the MAC address of the device (i.e. MAC spoofing).
kk: Егер көрсетілсе, бұл қосылым тек тұрақты MAC адресі сәйкес келетін Wi-Fi құрылғысына қолданылады. Бұл қасиет құрылғының MAC адресін өзгертпейді (яғни, MAC spoofing).

source: A list of permanent MAC addresses of Wi-Fi devices to which this connection should never apply. Each MAC address should be given in the standard hex-digits-and-colons notation (eg "00:11:22:33:44:55").
kk: Бұл қосылым ешқашан қолданылмауы тиіс Wi-Fi құрылғыларының тұрақты MAC адрестерінің тізімі. Әр MAC адрес стандартты он алтылық цифрлар мен қос нүктелер нотациясында (мысалы "00:11:22:33:44:55") берілуі керек.

source: One of "default" (0) (never randomize unless the user has set a global default to randomize and the supplicant supports randomization), "never" (1) (never randomize the MAC address), or "always" (2) (always randomize the MAC address).
kk: "default" (0) (пайдаланушы рандомизациялау үшін глобалды әдепкі орнатпаса және суппликант рандомизациялауды қолдамаса, ешқашан рандомизацияланбайды), "never" (1) (MAC адресін ешқашан рандомизацияламау) немесе "always" (2) (MAC адресін әрқашан рандомизациялау) біреуі.

source: Wi-Fi network mode; one of "infrastructure", "mesh", "adhoc" or "ap". If blank, infrastructure is assumed.
kk: Wi-Fi желілік режимі; "infrastructure", "mesh", "adhoc" немесе "ap" біреуі. Егер бос болса, инфрақұрылым деп есептеледі.

source: One of "disable" (2) (disable Wi-Fi power saving), "enable" (3) (enable Wi-Fi power saving), "ignore" (1) (don't touch currently configure setting) or "default" (0) (use the globally configured value). All other values are reserved.
kk: "disable" (2) (Wi-Fi қуат үнемдеуін сөндіру), "enable" (3) (Wi-Fi қуат үнемдеуін іске қосу), "ignore" (1) (қазіргі бапталған баптауға тиіспеу) немесе "default" (0) (глобалды бапталған мәнді қолдану) біреуі. Барлық басқа мәндер резервтелген.

source: This property is not implemented and has no effect.
kk: Бұл қасиет жүзеге асырылмаған және ешқандай әсері жоқ.

source: A list of BSSIDs (each BSSID formatted as a MAC address like "00:11:22:33:44:55") that have been detected as part of the Wi-Fi network. NetworkManager internally tracks previously seen BSSIDs. The property is only meant for reading and reflects the BSSID list of NetworkManager. The changes you make to this property will not be preserved. This is not a regular property that the user would configure. Instead, NetworkManager automatically sets the seen BSSIDs and tracks them internally in "/var/lib/NetworkManager/seen-bssids" file.
kk: Wi-Fi желісінің бөлігі ретінде анықталған BSSID-тер ("00:11:22:33:44:55" сияқты MAC адресі ретінде пішімделген әр BSSID) тізімі. NetworkManager ішкі жағынан бұрын көрінген BSSID-терді бақылайды. Қасиет тек оқуға арналған және NetworkManager BSSID тізімін көрсетеді. Бұл қасиетке енгізген өзгерістеріңіз сақталмайды. Бұл пайдаланушы баптайтын тұрақты қасиет емес. Оның орнына, NetworkManager көрінген BSSID-терді автоматты түрде орнатады және оларды ішкі жағынан "/var/lib/NetworkManager/seen-bssids" файлында бақылайды.

source: SSID of the Wi-Fi network. Must be specified.
kk: Wi-Fi желісінің SSID. Көрсетілуі керек.

source: The NMSettingWirelessWakeOnWLan options to enable. Not all devices support all options. May be any combination of "any" (0x2), "disconnect" (0x4), "magic" (0x8), "gtk-rekey-failure" (0x10), "eap-identity-request" (0x20), "4way-handshake" (0x40), "rfkill-release" (0x80), "tcp" (0x100) or the special values "default" (0x1) (to use global settings) and "ignore" (0x8000) (to disable management of Wake-on-LAN in NetworkManager).
kk: Іске қосылатын NMSettingWirelessWakeOnWLan опциялары. Барлық құрылғылар барлық опцияларды қолдай бермейді. "any" (0x2), "disconnect" (0x4), "magic" (0x8), "gtk-rekey-failure" (0x10), "eap-identity-request" (0x20), "4way-handshake" (0x40), "rfkill-release" (0x80), "tcp" (0x100) кез келген комбинациясы немесе "default" (0x1) (глобалды баптауларды қолдану үшін) және "ignore" (0x8000) (NetworkManager-де Wake-on-LAN басқаруын сөндіру үшін) арнайы мәндері болуы мүмкін.

source: When WEP is used (ie, key-mgmt = "none" or "ieee8021x") indicate the 802.11 authentication algorithm required by the AP here. One of "open" for Open System, "shared" for Shared Key, or "leap" for Cisco LEAP. When using Cisco LEAP (ie, key-mgmt = "ieee8021x" and auth-alg = "leap") the "leap-username" and "leap-password" properties must be specified.
kk: WEP қолданылған кезде (яғни, key-mgmt = "none" немесе "ieee8021x") осында AP талап ететін 802.11 аутентификация алгоритмін көрсетіңіз. Open System үшін "open", Shared Key үшін "shared" немесе Cisco LEAP үшін "leap" біреуі. Cisco LEAP қолданған кезде (яғни, key-mgmt = "ieee8021x" және auth-alg = "leap") "leap-username" және "leap-password" қасиеттері көрсетілуі керек.

source: Indicates whether Fast Initial Link Setup (802.11ai) must be enabled for the connection. One of "default" (0) (use global default value), "disable" (1) (disable FILS), "optional" (2) (enable FILS if the supplicant and the access point support it) or "required" (3) (enable FILS and fail if not supported). When set to "default" (0) and no global default is set, FILS will be optionally enabled.
kk: Қосылым үшін Жылдам Бастапқы Сілтеме Орнату (802.11ai) іске қосылуы керек пе екенін көрсетеді. "default" (0) (глобалды әдепкі мәнді қолдану), "disable" (1) (FILS сөндіру), "optional" (2) (суппликант және қол жеткізу нүктесі қолдаса FILS іске қосу) немесе "required" (3) (FILS іске қосу және қолдау көрсетілмесе сәтсіз аяқтау) біреуі. "default" (0) мәніне орнатылған кезде және глобалды әдепкі орнатылмаған болса, FILS міндетті емес түрде іске қосылады.

source: A list of group/broadcast encryption algorithms which prevents connections to Wi-Fi networks that do not utilize one of the algorithms in the list. For maximum compatibility leave this property empty. Each list element may be one of "wep40", "wep104", "tkip", or "ccmp".
kk: Тізімдегі алгоритмдердің бірін қолданбайтын Wi-Fi желілеріне қосылымдарға жол бермейтын топтық/тарату шифрлау алгоритмдерінің тізімі. Максималды үйлесімділік үшін бұл қасиетті бос қалдырыңыз. Әр тізім элементі "wep40", "wep104", "tkip" немесе "ccmp" біреуі болуы мүмкін.
