Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: A string sent to the DHCP server to identify the local machine which the DHCP server may use to customize the DHCP lease and options. When the property is a hex string ('aa:bb:cc') it is interpreted as a binary client ID, in which case the first byte is assumed to be the 'type' field as per RFC 2132 section 9.14 and the remaining bytes may be an hardware address (e.g. '01:xx:xx:xx:xx:xx:xx' where 1 is the Ethernet ARP type and the rest is a MAC address). If the property is not a hex string it is considered as a non-hardware-address client ID and the 'type' field is set to 0. The special values "mac" and "perm-mac" are supported, which use the current or permanent MAC address of the device to generate a client identifier with type ethernet (01). Currently, these options only work for ethernet type of links. The special value "ipv6-duid" uses the DUID from "ipv6.dhcp-duid" property as an RFC4361-compliant client identifier. As IAID it uses "ipv4.dhcp-iaid" and falls back to "ipv6.dhcp-iaid" if unset. The special value "duid" generates a RFC4361-compliant client identifier based on "ipv4.dhcp-iaid" and uses a DUID generated by hashing /etc/machine-id. The special value "stable" is supported to generate a type 0 client identifier based on the stable-id (see connection.stable-id) and a per-host key. If you set the stable-id, you may want to include the "${DEVICE}" or "${MAC}" specifier to get a per-device key. The special value "none" prevents any client identifier from being sent. Note that this is normally not recommended. If unset, a globally configured default from NetworkManager.conf is used. If still unset, the default depends on the DHCP plugin. The internal dhcp client will default to "mac" and the dhclient plugin will try to use one from its config file if present, or won't sent any client-id otherwise.
kk: DHCP сервері DHCP жалға алуын және опцияларын бейімдеу үшін қолдана алатын жергілікті машинаны анықтау үшін DHCP серверіне жіберілетін жол. Қасиет он алтылық жол ('aa:bb:cc') болған кезде, ол екілік клиент ID ретінде түсіндіріледі, бұл жағдайда бірінші байт RFC 2132 9.14 бөліміне сәйкес 'type' өрісі деп есептеледі және қалған байттар аппараттық адрес болуы мүмкін (мысалы, '01:xx:xx:xx:xx:xx:xx', мұндағы 1 — Ethernet ARP түрі және қалғаны — MAC адрес). Егер қасиет он алтылық жол болмаса, ол аппараттық адрес емес клиент ID ретінде қарастырылады және 'type' өрісі 0-ге орнатылады. "mac" және "perm-mac" арнайы мәндеріне қолдау көрсетіледі, олар ethernet (01) түріндегі клиент идентификаторын жасау үшін құрылғының ағымдағы немесе тұрақты MAC адресін қолданады. Қазіргі уақытта бұл опциялар тек ethernet түріндегі сілтемелер үшін жұмыс істейді. "ipv6-duid" арнайы мәні RFC4361-ге сәйкес келетін клиент идентификаторы ретінде "ipv6.dhcp-duid" қасиетіндегі DUID қолданады. IAID ретінде ол "ipv4.dhcp-iaid" қолданады және орнатылмаған жағдайда "ipv6.dhcp-iaid" мәніне ауысады. "duid" арнайы мәні "ipv4.dhcp-iaid" негізінде RFC4361-ге сәйкес келетін клиент идентификаторын жасайды және /etc/machine-id хэштеу арқылы жасалған DUID қолданады. "stable" арнайы мәні stable-id (connection.stable-id қараңыз) және әр хост кілті негізінде 0 түріндегі клиент идентификаторын жасау үшін қолдау көрсетеді. Егер stable-id орнатсаңыз, әр құрылғы кілтін алу үшін "${DEVICE}" немесе "${MAC}" спецификаторын қосқыңыз келуі мүмкін. "none" арнайы мәні кез келген клиент идентификаторының жіберілуіне жол бермейді. Ескеріңіз, бұл әдетте ұсынылмайды. Егер орнатылмаса, NetworkManager.conf ішіндегі глобалды бапталған әдепкі мән қолданылады. Егер әлі де орнатылмаса, әдепкі мән DHCP плагиніне байланысты болады. Ішкі dhcp клиенті әдепкі бойынша "mac" болады, ал dhclient плагині бар болса, конфигурация файлындағы біреуін қолдануға тырысады немесе әйтпесе ешқандай client-id жібермейді.

source: Specifies the value for the DSCP field (traffic class) of the IP header. When empty, the global default value is used; if no global default is specified, it is assumed to be "CS0". Allowed values are: "CS0", "CS4" and "CS6". The property is currently valid only for IPv4, and it is supported only by the "internal" DHCP plugin.
kk: IP тақырыптамасының DSCP өрісі (трафик класы) үшін мәнді көрсетеді. Бос болған кезде, глобалды әдепкі мән қолданылады; егер глобалды әдепкі мән көрсетілмесе, ол "CS0" деп есептеледі. Рұқсат етілген мәндер: "CS0", "CS4" және "CS6". Қасиет қазіргі уақытта тек IPv4 үшін жарамды және оған тек "internal" DHCP плагині қолдау көрсетеді.

source: If the "dhcp-send-hostname" property is TRUE, then the specified FQDN will be sent to the DHCP server when acquiring a lease. This property and "dhcp-hostname" are mutually exclusive and cannot be set at the same time.
kk: Егер "dhcp-send-hostname" қасиеті TRUE болса, онда жалға алу кезінде көрсетілген FQDN DHCP серверіне жіберіледі. Бұл қасиет және "dhcp-hostname" өзара эксклюзивті және бір уақытта орнатыла алмайды.

source: If the "dhcp-send-hostname" property is TRUE, then the specified name will be sent to the DHCP server when acquiring a lease. This property and "dhcp-fqdn" are mutually exclusive and cannot be set at the same time.
kk: Егер "dhcp-send-hostname" қасиеті TRUE болса, онда жалға алу кезінде көрсетілген атау DHCP серверіне жіберіледі. Бұл қасиет және "dhcp-fqdn" өзара эксклюзивті және бір уақытта орнатыла алмайды.

source: Flags for the DHCP hostname and FQDN. Currently, this property only includes flags to control the FQDN flags set in the DHCP FQDN option. Supported FQDN flags are "fqdn-serv-update" (0x1), "fqdn-encoded" (0x2) and "fqdn-no-update" (0x4). When no FQDN flag is set and "fqdn-clear-flags" (0x8) is set, the DHCP FQDN option will contain no flag. Otherwise, if no FQDN flag is set and "fqdn-clear-flags" (0x8) is not set, the standard FQDN flags are set in the request: "fqdn-serv-update" (0x1), "fqdn-encoded" (0x2) for IPv4 and "fqdn-serv-update" (0x1) for IPv6. When this property is set to the default value "none" (0x0), a global default is looked up in NetworkManager configuration. If that value is unset or also "none" (0x0), then the standard FQDN flags described above are sent in the DHCP requests.
kk: DHCP хост аты және FQDN үшін жалаушалар. Қазіргі уақытта бұл қасиет тек DHCP FQDN опциясында орнатылған FQDN жалаушаларын басқаруға арналған жалаушаларды қамтиды. Қолдау көрсетілетін FQDN жалаушалары: "fqdn-serv-update" (0x1), "fqdn-encoded" (0x2) және "fqdn-no-update" (0x4). Ешқандай FQDN жалаушасы орнатылмаған кезде және "fqdn-clear-flags" (0x8) орнатылған кезде, DHCP FQDN опциясы ешқандай жалаушаны қамтымайды. Әйтпесе, егер ешқандай FQDN жалаушасы орнатылмаса және "fqdn-clear-flags" (0x8) орнатылмаса, сұрауда стандартты FQDN жалаушалары орнатылады: IPv4 үшін "fqdn-serv-update" (0x1), "fqdn-encoded" (0x2) және IPv6 үшін "fqdn-serv-update" (0x1). Бұл қасиет әдепкі "none" (0x0) мәніне орнатылған кезде, NetworkManager конфигурациясында глобалды әдепкі ізделеді. Егер ол мән орнатылмаған болса немесе сондай-ақ "none" (0x0) болса, онда жоғарыда сипатталған стандартты FQDN жалаушалары DHCP сұрауларында жіберіледі.

source: A string containing the "Identity Association Identifier" (IAID) used by the DHCP client. The string can be a 32-bit number (either decimal, hexadecimal or as colon separated hexadecimal numbers). Alternatively it can be set to the special values "mac", "perm-mac", "ifname" or "stable". When set to "mac" (or "perm-mac"), the last 4 bytes of the current (or permanent) MAC address are used as IAID. When set to "ifname", the IAID is computed by hashing the interface name. The special value "stable" can be used to generate an IAID based on the stable-id (see connection.stable-id), a per-host key and the interface name. When the property is unset, the value from global configuration is used; if no global default is set then the IAID is assumed to be "ifname". For DHCPv4, the IAID is only used with "ipv4.dhcp-client-id" values "duid" and "ipv6-duid" to generate the client-id. For DHCPv6, note that at the moment this property is only supported by the "internal" DHCPv6 plugin. The "dhclient" DHCPv6 plugin always derives the IAID from the MAC address. The actually used DHCPv6 IAID for a currently activated interface is exposed in the lease information of the device.
kk: DHCP клиенті қолданатын "Сәйкестік Қауымдастығының Идентификаторын" (IAID) қамтитын жол. Жол 32 биттік сан (ондық, он алтылық немесе қос нүктемен бөлінген он алтылық сандар ретінде) болуы мүмкін. Немесе оны "mac", "perm-mac", "ifname" немесе "stable" арнайы мәндеріне орнатуға болады. "mac" (немесе "perm-mac") мәніне орнатылған кезде, ағымдағы (немесе тұрақты) MAC адресінің соңғы 4 байты IAID ретінде қолданылады. "ifname" мәніне орнатылған кезде, IAID интерфейс атын хэштеу арқылы есептеледі. "stable" арнайы мәнін stable-id (connection.stable-id қараңыз), әр хост кілті және интерфейс аты негізінде IAID жасау үшін қолдануға болады. Қасиет орнатылмаған кезде, глобалды конфигурациядан алынған мән қолданылады; егер глобалды әдепкі мән орнатылмаса, IAID "ifname" деп есептеледі. DHCPv4 үшін IAID тек client-id жасау үшін "duid" және "ipv6-duid" мәндері бар "ipv4.dhcp-client-id" кезінде қолданылады. DHCPv6 үшін ескеріңіз, қазіргі уақытта бұл қасиетке тек "internal" DHCPv6 плагині қолдау көрсетеді. "dhclient" DHCPv6 плагині IAID-ті әрқашан MAC адресінен алады. Қазіргі белсендірілген интерфейс үшін нақты қолданылатын DHCPv6 IAID құрылғының жалға алу ақпаратында көрсетіледі.

source: Controls the "IPv6-Only Preferred" DHCPv4 option (option 108 - RFC 8925). When set to "yes" (1), the host adds the option to the parameter request list; if the DHCP server sends the option back, the host stops the DHCP client for the time interval specified in the option. Enable this feature if the host supports an IPv6-only mode, i.e. either all applications are IPv6-only capable or there is a form of CLAT (464XLAT) deployed. If set to "auto" (2), the option is automatically turned on when the IPv6 method is "auto" and the connection profile has ipv4.clat set to "yes" or "auto". If these two conditions are met, the host can operate in IPv6-only mode and therefore it is safe to disable DHCPv4 when the network also supports it. When set to "default" (-1), the actual value is looked up in the global configuration; if not specified, it defaults to "auto" (2). If the connection has IPv6 method set to "disabled", this property does not have effect and the "IPv6-Only Preferred" option is always disabled.
kk: "IPv6-Only Preferred" DHCPv4 опциясын басқарады (108 опция - RFC 8925). "yes" (1) мәніне орнатылған кезде, хост опцияны параметр сұрау тізіміне қосады; егер DHCP сервері опцияны қайтарып жіберсе, хост DHCP клиентін опцияда көрсетілген уақыт аралығына тоқтатады. Егер хост тек IPv6 режимін қолдаса, яғни барлық қолданбалар тек IPv6-ға қабілетті болса немесе CLAT (464XLAT) пішімі орнатылған болса, бұл мүмкіндікті іске қосыңыз. "auto" (2) мәніне орнатылған кезде, IPv6 әдісі "auto" болса және қосылым профилінде ipv4.clat "yes" немесе "auto" болып орнатылса, опция автоматты түрде қосылады. Егер осы екі шарт орындалса, хост тек IPv6 режимінде жұмыс істей алады, сондықтан желі оны қолдайтын болса, DHCPv4-ті сөндіру қауіпсіз. "default" (-1) мәніне орнатылған кезде, нақты мән глобалды конфигурациядан ізделеді; егер көрсетілмесе, ол әдепкі бойынша "auto" (2) болады. Егер қосылымның IPv6 әдісі "disabled" мәніне орнатылса, бұл қасиеттің әсері болмайды және "IPv6-Only Preferred" опциясы әрқашан сөндірулі болады.

source: Array of servers from which DHCP offers must be rejected. This property is useful to avoid getting a lease from misconfigured or rogue servers. For DHCPv4, each element must be an IPv4 address, optionally followed by a slash and a prefix length (e.g. "192.168.122.0/24"). This property is currently not implemented for DHCPv6.
kk: DHCP ұсыныстары қабылданбауы керек серверлер массиві. Бұл қасиет қате бапталған немесе зиянды серверлерден жалға алуды болдырмау үшін пайдалы. DHCPv4 үшін әр элемент IPv4 адресі болуы керек, одан кейін міндетті емес қиғаш сызық және префикс ұзындығы (мысалы, "192.168.122.0/24") болуы мүмкін. Бұл қасиет қазіргі уақытта DHCPv6 үшін жүзеге асырылмаған.

source: Since 1.52 this property is deprecated and is only used as fallback value for dhcp-send-hostname if it's set to 'default'. This is only done to avoid breaking existing configurations, the new property should be used from now on.
kk: 1.52 нұсқасынан бастап бұл қасиет ескірген және тек dhcp-send-hostname 'default' мәніне орнатылған жағдайда резервтік мән ретінде қолданылады. Бұл тек бар конфигурацияларды бұзбау үшін жасалады, бұдан былай жаңа қасиетті қолдану керек.

source: If TRUE, a hostname is sent to the DHCP server when acquiring a lease. Some DHCP servers use this hostname to update DNS databases, essentially providing a static hostname for the computer. If the dhcp-hostname property is NULL and this property is TRUE, the current persistent hostname of the computer is sent. The default value is default (-1). In this case the global value from NetworkManager configuration is looked up. If it's not set, the value from dhcp-send-hostname-deprecated, which defaults to TRUE, is used for backwards compatibility. In the future this will change and, in absence of a global default, it will always fallback to TRUE.
kk: Егер TRUE болса, жалға алу кезінде хост аты DHCP серверіне жіберіледі. Кейбір DHCP серверлері бұл хост атын DNS дерекқорларын жаңарту үшін қолданады, негізінен компьютер үшін тұрақты хост атын береді. Егер dhcp-hostname қасиеті NULL болса және бұл қасиет TRUE болса, компьютердің ағымдағы тұрақты хост аты жіберіледі. Әдепкі мән default (-1). Бұл жағдайда NetworkManager конфигурациясынан глобалды мән ізделеді. Егер ол орнатылмаған болса, артқа қарай үйлесімділік үшін әдепкі бойынша TRUE болатын dhcp-send-hostname-deprecated мәні қолданылады. Болашақта бұл өзгереді және глобалды әдепкі болмаған жағдайда, ол әрқашан TRUE мәніне ауысады.

source: Whether the DHCP client will send RELEASE message when bringing the connection down. The default value is "default" (-1). When the default value is specified, then the global value from NetworkManager configuration is looked up, if not set, it is considered as FALSE.
kk: Қосылымды төмендету кезінде DHCP клиенті RELEASE хабарламасын жібере ме. Әдепкі мән "default" (-1). Әдепкі мән көрсетілген кезде, NetworkManager конфигурациясынан глобалды мән ізделеді, егер орнатылмаған болса, ол FALSE деп есептеледі.

source: A timeout for a DHCP transaction in seconds. If zero (the default), a globally configured default is used. If still unspecified, a device specific timeout is used (usually 45 seconds). Set to 2147483647 (MAXINT32) for infinity.
kk: DHCP транзакциясы үшін күту уақыты (секундпен). Егер нөл болса (әдепкі), глобалды бапталған әдепкі қолданылады. Егер әлі көрсетілмесе, құрылғыға тән күту уақыты қолданылады (әдетте 45 секунд). Шексіздік үшін 2147483647 (MAXINT32) мәніне орнатыңыз.

source: The Vendor Class Identifier DHCP option (60). Special characters in the data string may be escaped using C-style escapes, nevertheless this property cannot contain nul bytes. If the per-profile value is unspecified (the default), a global connection default gets consulted. If still unspecified, the DHCP option is not sent to the server.
kk: Vendor Class Identifier DHCP опциясы (60). Деректер жолындағы арнайы таңбаларды C стиліндегі экрандау арқылы экрандауға болады, дегенмен бұл қасиет нөлдік байттарды қамти алмайды. Егер профиль бойынша мән көрсетілмесе (әдепкі), глобалды қосылым әдепкісі қаралады. Егер әлі көрсетілмесе, DHCP опциясы серверге жіберілмейді.

source: Array of DNS servers. Each server can be specified either as a plain IP address (optionally followed by a "#" and the SNI server name for DNS over TLS) or with a URI syntax. When it is specified as an URI, the following forms are supported: dns+udp://ADDRESS[:PORT], dns+tls://ADDRESS[:PORT][SERVERNAME] . When using the URI syntax, IPv6 addresses must be enclosed in square brackets ('[', ']').
kk: DNS серверлерінің массиві. Әр серверді қарапайым IP адрес ретінде (міндетті емес "#" және TLS арқылы DNS үшін SNI сервер атымен) немесе URI синтаксисімен көрсетуге болады. URI ретінде көрсетілген кезде келесі пішімдерге қолдау көрсетіледі: dns+udp://АДРЕС[:ПОРТ], dns+tls://АДРЕС[:ПОРТ][СЕРВЕР_АТЫ] . URI синтаксисін қолданған кезде, IPv6 адрестері тік жақшаға алынуы керек ('[', ']').

source: DNS options for /etc/resolv.conf as described in resolv.conf(5) manual. The currently supported options are "attempts", "debug", "edns0", "ndots", "no-aaaa", "no-check-names", "no-reload", "no-tld-query", "rotate", "single-request", "single-request-reopen", "timeout", "trust-ad", "use-vc". See the resolv.conf(5) manual. Note that there is a distinction between an unset (default) list and an empty list. In nmcli, to unset the list set the value to "". To set an empty list, set it to " ". Currently, an unset list has the same meaning as an empty list. That might change in the future. The "trust-ad" setting is only honored if the profile contributes name servers to resolv.conf, and if all contributing profiles have "trust-ad" enabled. When using a caching DNS plugin (dnsmasq or systemd-resolved in NetworkManager.conf) then "edns0" and "trust-ad" are automatically added. The valid "ipv4.dns-options" and "ipv6.dns-options" get merged together.
kk: resolv.conf(5) нұсқаулығында сипатталғандай /etc/resolv.conf үшін DNS опциялары. Қазіргі уақытта қолдау көрсетілетін опциялар: "attempts", "debug", "edns0", "ndots", "no-aaaa", "no-check-names", "no-reload", "no-tld-query", "rotate", "single-request", "single-request-reopen", "timeout", "trust-ad", "use-vc". resolv.conf(5) нұсқаулығын қараңыз. Ескеріңіз, орнатылмаған (әдепкі) тізім мен бос тізім арасында айырмашылық бар. nmcli-де тізімді орнатпау үшін мәнді "" етіп орнатыңыз. Бос тізімді орнату үшін оны " " етіп орнатыңыз. Қазіргі уақытта орнатылмаған тізім бос тізіммен бірдей мағынаға ие. Бұл болашақта өзгеруі мүмкін. "trust-ad" баптауы тек профиль resolv.conf-қа атау серверлерін қосса және барлық қатысушы профильдерде "trust-ad" іске қосылған болса ғана ескеріледі. Кэштеуші DNS плагинін қолданған кезде (NetworkManager.conf ішінде dnsmasq немесе systemd-resolved) "edns0" және "trust-ad" автоматты түрде қосылады. Жарамды "ipv4.dns-options" және "ipv6.dns-options" бірге біріктіріледі.

source: DNS servers priority. The relative priority for DNS servers specified by this setting. A lower numerical value is better (higher priority). Negative values have the special effect of excluding other configurations with a greater numerical priority value; so in presence of at least one negative priority, only DNS servers from connections with the lowest priority value will be used. To avoid all DNS leaks, set the priority of the profile that should be used to the most negative value of all active connections profiles. Zero selects a globally configured default value. If the latter is missing or zero too, it defaults to 50 for VPNs (including WireGuard) and 100 for other connections. Note that the priority is to order DNS settings for multiple active connections. It does not disambiguate multiple DNS servers within the same connection profile. When multiple devices have configurations with the same priority, VPNs will be considered first, then devices with the best (lowest metric) default route and then all other devices. When using dns=default, servers with higher priority will be on top of resolv.conf. To prioritize a given server over another one within the same connection, just specify them in the desired order. Note that commonly the resolver tries name servers in /etc/resolv.conf in the order listed, proceeding with the next server in the list on failure. See for example the "rotate" option of the dns-options setting. If there are any negative DNS priorities, then only name servers from the devices with that lowest priority will be considered. When using a DNS resolver that supports Conditional Forwarding or Split DNS (with dns=dnsmasq or dns=systemd-resolved settings), each connection is used to query domains in its search list. The search domains determine which name servers to ask, and the DNS priority is used to prioritize name servers based on the domain. Queries for domains not present in any search list are routed through connections having the '~.' special wildcard domain, which is added automatically to connections with the default route (or can be added manually). When multiple connections specify the same domain, the one with the best priority (lowest numerical value) wins. If a sub domain is configured on another interface it will be accepted regardless the priority, unless parent domain on the other interface has a negative priority, which causes the sub domain to be shadowed. With Split DNS one can avoid undesired DNS leaks by properly configuring DNS priorities and the search domains, so that only name servers of the desired interface are configured.
kk: DNS серверлерінің басымдығы. Осы баптаумен көрсетілген DNS серверлері үшін салыстырмалы басымдық. Төменгі сандық мән жақсырақ (жоғары басымдық). Теріс мәндер жоғары сандық басымдық мәні бар басқа конфигурацияларды алып тастаудың арнайы әсеріне ие; сондықтан кем дегенде бір теріс басымдық болған кезде, тек ең төменгі басымдық мәні бар қосылымдардан DNS серверлері қолданылады. Барлық DNS ағып кетулерін болдырмау үшін, қолданылуы тиіс профильдің басымдығын барлық белсенді қосылым профильдерінің ең теріс мәніне орнатыңыз. Нөл глобалды бапталған әдепкі мәнді таңдайды. Егер ол жоқ болса немесе нөл болса, ол VPN (соның ішінде WireGuard) үшін 50-ге және басқа қосылымдар үшін 100-ге әдепкі болады. Ескеріңіз, басымдық бірнеше белсенді қосылымдар үшін DNS баптауларын реттеуге арналған. Ол бір қосылым профилі ішіндегі бірнеше DNS серверлерін айқындамайды. Бірнеше құрылғыларда бірдей басымдығы бар конфигурациялар болған кезде, VPN-дер бірінші болып қарастырылады, содан кейін ең жақсы (ең төменгі метрика) әдепкі бағдары бар құрылғылар және содан кейін барлық басқа құрылғылар. dns=default қолданған кезде, жоғары басымдығы бар серверлер resolv.conf жоғарғы жағында болады. Берілген серверге бір қосылым ішінде басқасына қарағанда басымдық беру үшін оларды қажетті ретпен көрсетіңіз. Ескеріңіз, әдетте резолвер /etc/resolv.conf ішіндегі атау серверлерін тізімделген ретпен тексеруге тырысады, сәтсіз болған жағдайда тізімдегі келесі сервермен жалғастырады. Мысалы, dns-options баптауының "rotate" опциясын қараңыз. Егер қандай да бір теріс DNS басымдықтары болса, онда тек сол ең төменгі басымдығы бар құрылғылардан атау серверлері қарастырылады. Шартты Қайта Бағыттауды немесе Бөлінген DNS (dns=dnsmasq немесе dns=systemd-resolved баптауларымен) қолдайтын DNS резолверін қолданған кезде, әр қосылым өзінің іздеу тізіміндегі домендерді сұрау үшін қолданылады. Іздеу домендері қай атау серверлерін сұрау керектігін анықтайды және DNS басымдығы домен негізінде атау серверлеріне басымдық беру үшін қолданылады. Ешқандай іздеу тізімінде жоқ домендерге сұраулар '~.' арнайы қойылмалы таңба домені бар қосылымдар арқылы бағытталады, ол әдепкі бағдары бар қосылымдарға автоматты түрде қосылады (немесе қолмен қосылуы мүмкін). Бірнеше қосылым бірдей доменді көрсеткен кезде, ең жақсы басымдығы (ең төменгі сандық мән) бар қосылым жеңеді. Егер ішкі домен басқа интерфейсте бапталған болса, ол басымдыққа қарамастан қабылданады, егер басқа интерфейстегі негізгі домен теріс басымдыққа ие болмаса (бұл ішкі доменнің көлеңкеленуіне әкеледі). Бөлінген DNS көмегімен DNS басымдықтары мен іздеу домендерін дұрыс баптау арқылы қажетсіз DNS ағып кетулерін болдырмауға болады, осылайша тек қажетті интерфейстің атау серверлері бапталады.
