Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: A IPv6 address followed by a slash and a prefix length. If set, the value is sent to the DHCPv6 server as hint indicating the prefix delegation (IA_PD) we want to receive. To only hint a prefix length without prefix, set the address part to the zero address (for example "::/60").
kk: IPv6 адресі, одан кейін қиғаш сызық және префикс ұзындығы. Егер орнатылса, мән DHCPv6 серверіне біз алғымыз келетін префикс делегациясын (IA_PD) көрсететін кеңес ретінде жіберіледі. Префиксіз тек префикс ұзындығын кеңес ету үшін адрес бөлігін нөлдік адрес етіп орнатыңыз (мысалы "::/60").

source: DNS options for /etc/resolv.conf as described in resolv.conf(5) manual. The currently supported options are "attempts", "debug", "edns0", "ndots", "no-aaaa", "no-check-names", "no-reload", "no-tld-query", "rotate", "single-request", "single-request-reopen", "timeout", "trust-ad", "use-vc" and "inet6", "ip6-bytestring", "ip6-dotint", "no-ip6-dotint". See the resolv.conf(5) manual. Note that there is a distinction between an unset (default) list and an empty list. In nmcli, to unset the list set the value to "". To set an empty list, set it to " ". Currently, an unset list has the same meaning as an empty list. That might change in the future. The "trust-ad" setting is only honored if the profile contributes name servers to resolv.conf, and if all contributing profiles have "trust-ad" enabled. When using a caching DNS plugin (dnsmasq or systemd-resolved in NetworkManager.conf) then "edns0" and "trust-ad" are automatically added. The valid "ipv4.dns-options" and "ipv6.dns-options" get merged together.
kk: resolv.conf(5) нұсқаулығында сипатталғандай /etc/resolv.conf үшін DNS опциялары. Қазіргі уақытта қолдау көрсетілетін опциялар: "attempts", "debug", "edns0", "ndots", "no-aaaa", "no-check-names", "no-reload", "no-tld-query", "rotate", "single-request", "single-request-reopen", "timeout", "trust-ad", "use-vc" және "inet6", "ip6-bytestring", "ip6-dotint", "no-ip6-dotint". resolv.conf(5) нұсқаулығын қараңыз. Ескеріңіз, орнатылмаған (әдепкі) тізім мен бос тізім арасында айырмашылық бар. nmcli-де тізімді орнатпау үшін мәнді "" етіп орнатыңыз. Бос тізімді орнату үшін оны " " етіп орнатыңыз. Қазіргі уақытта орнатылмаған тізім бос тізіммен бірдей мағынаға ие. Бұл болашақта өзгеруі мүмкін. "trust-ad" баптауы тек профиль resolv.conf-қа атау серверлерін қосса және барлық қатысушы профильдерде "trust-ad" іске қосылған болса ғана ескеріледі. Кэштеуші DNS плагинін қолданған кезде (NetworkManager.conf ішінде dnsmasq немесе systemd-resolved) "edns0" және "trust-ad" автоматты түрде қосылады. Жарамды "ipv4.dns-options" және "ipv6.dns-options" бірге біріктіріледі.

source: Configure IPv6 Privacy Extensions for SLAAC, described in RFC4941. If enabled, it makes the kernel generate a temporary IPv6 address in addition to the public one generated from MAC address via modified EUI-64. This enhances privacy, but could cause problems in some applications, on the other hand. The permitted values are: -1: unknown, 0: disabled, 1: enabled (prefer public address), 2: enabled (prefer temporary addresses). Having a per-connection setting set to "-1" (default) means fallback to global configuration "ipv6.ip6-privacy". If it's also unspecified or set to "-1", fallback to read "/proc/sys/net/ipv6/conf/default/use_tempaddr". Note that this setting is distinct from the Stable Privacy addresses that can be enabled with the "addr-gen-mode" property's "stable-privacy" setting as another way of avoiding host tracking with IPv6 addresses.
kk: SLAAC үшін RFC4941-де сипатталған IPv6 Жекелік Кеңейтімдерін баптаңыз. Егер іске қосылса, ол ядроға өзгертілген EUI-64 арқылы MAC адресінен жасалған жария адреспен қатар уақытша IPv6 адресін жасауға мәжбүрлейді. Бұл жекелікті жақсартады, бірақ екінші жағынан кейбір қолданбаларда мәселелер тудыруы мүмкін. Рұқсат етілген мәндер: -1: белгісіз, 0: сөндірулі, 1: іске қосулы (жария адреске артықшылық беру), 2: іске қосулы (уақытша адрестерге артықшылық беру). Профиль бойынша баптауды "-1" (әдепкі) мәніне орнату глобалды конфигурациядағы "ipv6.ip6-privacy"-ге ауысуды білдіреді. Егер ол да көрсетілмесе немесе "-1" болса, "/proc/sys/net/ipv6/conf/default/use_tempaddr" оқуға ауысады. Ескеріңіз, бұл баптау IPv6 адрестерімен хостты бақылауды болдырмаудың тағы бір жолы ретінде "addr-gen-mode" қасиетінің "stable-privacy" баптауымен іске қосылатын Тұрақты Жекелік адрестерінен өзгеше.

source: The IPv6 connection method.
kk: IPv6 қосылым әдісі.

source: Maximum transmission unit size, in bytes. If zero (the default), the MTU is set automatically from router advertisements or is left equal to the link-layer MTU. If greater than the link-layer MTU, or greater than zero but less than the minimum IPv6 MTU of 1280, this value has no effect.
kk: Байтпен өлшенетін максималды тарату блогының өлшемі. Егер нөл болса (әдепкі), MTU маршрутизатор хабарландыруларынан автоматты түрде орнатылады немесе сілтеме-деңгейінің MTU-ына тең қалады. Егер сілтеме-деңгейінің MTU-ынан үлкен болса немесе нөлден үлкен бірақ 1280 болатын ең аз IPv6 MTU-ынан кіші болса, бұл мәннің ешқандай әсері болмайды.

source: A timeout for waiting Router Advertisements in seconds. If zero (the default), a globally configured default is used. If still unspecified, the timeout depends on the sysctl settings of the device. Set to 2147483647 (MAXINT32) for infinity.
kk: Маршрутизатор Хабарландыруларын күтуге арналған уақыт (секундпен). Егер нөл болса (әдепкі), глобалды бапталған әдепкі қолданылады. Егер әлі көрсетілмесе, күту уақыты құрылғының sysctl баптауларына байланысты болады. Шексіздік үшін 2147483647 (MAXINT32) мәніне орнатыңыз.

source: Array of IP routes.
kk: IP бағдарларының массиві.

source: The preferred lifetime of autogenerated temporary addresses, in seconds. Having a per-connection setting set to "0" (default) means fallback to global configuration "ipv6.temp-preferred-lifetime" setting". If it's also unspecified or set to "0", fallback to read "/proc/sys/net/ipv6/conf/default/temp_prefered_lft".
kk: Автоматты түрде жасалған уақытша адрестердің қалаған өмір сүру ұзақтығы (секундпен). Профиль бойынша баптауды "0" (әдепкі) мәніне орнату глобалды конфигурациядағы "ipv6.temp-preferred-lifetime" баптауына ауысуды білдіреді. Егер ол да көрсетілмесе немесе "0" болса, "/proc/sys/net/ipv6/conf/default/temp_prefered_lft" оқуға ауысады.

source: The valid lifetime of autogenerated temporary addresses, in seconds. Having a per-connection setting set to "0" (default) means fallback to global configuration "ipv6.temp-valid-lifetime" setting". If it's also unspecified or set to "0", fallback to read "/proc/sys/net/ipv6/conf/default/temp_valid_lft".
kk: Автоматты түрде жасалған уақытша адрестердің жарамды өмір сүру ұзақтығы (секундпен). Профиль бойынша баптауды "0" (әдепкі) мәніне орнату глобалды конфигурациядағы "ipv6.temp-valid-lifetime" баптауына ауысуды білдіреді. Егер ол да көрсетілмесе немесе "0" болса, "/proc/sys/net/ipv6/conf/default/temp_valid_lft" оқуға ауысады.

source: Configure the token for draft-chown-6man-tokenised-ipv6-identifiers-02 IPv6 tokenized interface identifiers. Useful with eui64 addr-gen-mode. When set, the token is used as IPv6 interface identifier instead of the hardware address. This only applies to addresses from stateless autoconfiguration, not to IPv6 link local addresses.
kk: draft-chown-6man-tokenised-ipv6-identifiers-02 IPv6 токенделген интерфейс идентификаторлары үшін токенді баптаңыз. eui64 addr-gen-mode көмегімен пайдалы. Орнатылған кезде, токен аппараттық адрестің орнына IPv6 интерфейс идентификаторы ретінде қолданылады. Бұл тек күйсіз автоконфигурациядан алынған адрестерге қатысты, IPv6 сілтеме жергілікті адрестеріне емес.

source: How many additional levels of encapsulation are permitted to be prepended to packets. This property applies only to IPv6 tunnels. To disable this option, add 0x1 (ip6-ign-encap-limit) to ip-tunnel flags.
kk: Пакеттерге алдын ала қосуға рұқсат етілген инкапсуляцияның қанша қосымша деңгейі бар. Бұл қасиет тек IPv6 туннельдеріне қолданылады. Бұл опцияны сөндіру үшін ip-tunnel жалаушаларына 0x1 (ip6-ign-encap-limit) қосыңыз.

source: Tunnel flags. Currently, the following values are supported: 0x1 (ip6-ign-encap-limit), 0x2 (ip6-use-orig-tclass), 0x4 (ip6-use-orig-flowlabel), 0x8 (ip6-mip6-dev), 0x10 (ip6-rcv-dscp-copy) and 0x20 (ip6-use-orig-fwmark). They are valid only for IPv6 tunnels.
kk: Туннель жалаушалары. Қазіргі уақытта келесі мәндерге қолдау көрсетіледі: 0x1 (ip6-ign-encap-limit), 0x2 (ip6-use-orig-tclass), 0x4 (ip6-use-orig-flowlabel), 0x8 (ip6-mip6-dev), 0x10 (ip6-rcv-dscp-copy) және 0x20 (ip6-use-orig-fwmark). Олар тек IPv6 туннельдері үшін жарамды.

source: The flow label to assign to tunnel packets. This property applies only to IPv6 tunnels.
kk: Туннель пакеттеріне тағайындалатын ағын белгісі. Бұл қасиет тек IPv6 туннельдеріне қолданылады.

source: The fwmark value to assign to tunnel packets. This property can be set to a non zero value only on VTI and VTI6 tunnels.
kk: Туннель пакеттеріне тағайындалатын fwmark мәні. Бұл қасиетті нөлдік емес мәнге тек VTI және VTI6 туннельдерінде орнатуға болады.

source: The key used for tunnel input packets; the property is valid only for certain tunnel modes (GRE, IP6GRE). If empty, no key is used.
kk: Туннель кіріс пакеттері үшін қолданылатын кілт; қасиет тек белгілі бір туннель режимдері үшін жарамды (GRE, IP6GRE). Егер бос болса, ешқандай кілт қолданылмайды.

source: The local endpoint of the tunnel; the value can be empty, otherwise it must contain an IPv4 or IPv6 address.
kk: Туннельдің жергілікті соңғы нүктесі; мән бос болуы мүмкін, әйтпесе ол IPv4 немесе IPv6 адресін қамтуы керек.

source: The tunneling mode. Valid values: ipip (1), gre (2), sit (3), isatap (4), vti (5), ip6ip6 (6), ipip6 (7), ip6gre (8), vti6 (9), gretap (10) and ip6gretap (11)
kk: Туннельдеу режимі. Жарамды мәндер: ipip (1), gre (2), sit (3), isatap (4), vti (5), ip6ip6 (6), ipip6 (7), ip6gre (8), vti6 (9), gretap (10) және ip6gretap (11)

source: If non-zero, only transmit packets of the specified size or smaller, breaking larger packets up into multiple fragments.
kk: Егер нөл болмаса, тек көрсетілген өлшемдегі немесе одан кіші пакеттерді жібереді, үлкен пакеттерді бірнеше фрагменттерге бөледі.

source: The key used for tunnel output packets; the property is valid only for certain tunnel modes (GRE, IP6GRE). If empty, no key is used.
kk: Туннель шығыс пакеттері үшін қолданылатын кілт; қасиет тек белгілі бір туннель режимдері үшін жарамды (GRE, IP6GRE). Егер бос болса, ешқандай кілт қолданылмайды.

source: If given, specifies the parent interface name or parent connection UUID the new device will be bound to so that tunneled packets will only be routed via that interface.
kk: Берілген болса, жаңа құрылғы байланыстырылатын негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді, осылайша туннельденген пакеттер тек сол интерфейс арқылы бағытталады.

source: Whether to enable Path MTU Discovery on this tunnel.
kk: Осы туннельде Path MTU Discovery іске қосу керек пе.

source: The remote endpoint of the tunnel; the value must contain an IPv4 or IPv6 address.
kk: Туннельдің қашықтағы соңғы нүктесі; мән IPv4 немесе IPv6 адресін қамтуы керек.

source: The type of service (IPv4) or traffic class (IPv6) field to be set on tunneled packets.
kk: Туннельденген пакеттерге орнатылатын қызмет түрі (IPv4) немесе трафик класы (IPv6) өрісі.

source: The TTL to assign to tunneled packets. 0 is a special value meaning that packets inherit the TTL value.
kk: Туннельденген пакеттерге тағайындалатын TTL. 0 — пакеттер TTL мәнін мұрагерлікпен алатынын білдіретін арнайы мән.

source: The IPVLAN mode. Valid values: l2 (1), l3 (2), l3s (3)
kk: IPVLAN режимі. Жарамды мәндер: l2 (1), l3 (2), l3s (3)

source: If given, specifies the parent interface name or parent connection UUID from which this IPVLAN interface should be created. If this property is not specified, the connection must contain an "802-3-ethernet" setting with a "mac-address" property.
kk: Берілген болса, осы IPVLAN интерфейсі жасалуы керек негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді. Егер бұл қасиет көрсетілмесе, қосылым "mac-address" қасиеті бар "802-3-ethernet" баптауын қамтуы керек.

source: Whether the interface should be put in private mode.
kk: Интерфейсті жеке режимге қою керек пе.

source: Whether the interface should be put in VEPA mode.
kk: Интерфейсті VEPA режиміне қою керек пе.

source: Whether the transmitted traffic must be encrypted.
kk: Жіберілген трафик шифрлануы керек пе.

source: The pre-shared CAK (Connectivity Association Key) for MACsec Key Agreement. Must be a string of 32 hexadecimal characters.
kk: MACsec Кілт Келісімі үшін алдын ала бөлісілген CAK (Қосылым Қауымдастығының Кілті). 32 он алтылық таңбадан тұратын жол болуы керек.

source: Flags indicating how to handle the "mka-cak" property.
kk: "mka-cak" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: The pre-shared CKN (Connectivity-association Key Name) for MACsec Key Agreement. Must be a string of hexadecimal characters with a even length between 2 and 64.
kk: MACsec Кілт Келісімі үшін алдын ала бөлісілген CKN (Қосылым-қауымдастығының Кілт Аты). Ұзындығы 2 мен 64 арасындағы жұп болатын он алтылық таңбалардан тұратын жол болуы керек.

source: Specifies how the CAK (Connectivity Association Key) for MKA (MACsec Key Agreement) is obtained.
kk: MKA (MACsec Кілт Келісімі) үшін CAK (Қосылым Қауымдастығының Кілті) қалай алынатынын көрсетеді.

source: Specifies the MACsec offload mode. "off" (0) disables MACsec offload. "phy" (1) and "mac" (2) request offload respectively to the PHY or to the MAC; if the selected mode is not available, the connection will fail. "default" (-1) uses the global default value specified in NetworkManager configuration; if no global default is defined, the built-in default is "off" (0).
kk: MACsec offload режимін көрсетеді. "off" (0) MACsec offload-ты сөндіреді. "phy" (1) және "mac" (2) сәйкесінше PHY немесе MAC-қа offload сұрайды; егер таңдалған режим қолжетімсіз болса, қосылым сәтсіз аяқталады. "default" (-1) NetworkManager конфигурациясында көрсетілген глобалды әдепкі мәнді қолданады; егер глобалды әдепкі анықталмаса, кірістірілген әдепкі мән "off" (0) болады.

source: If given, specifies the parent interface name or parent connection UUID from which this MACSEC interface should be created. If this property is not specified, the connection must contain an "802-3-ethernet" setting with a "mac-address" property.
kk: Берілген болса, осы MACSEC интерфейсі жасалуы керек негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді. Егер бұл қасиет көрсетілмесе, қосылым "mac-address" қасиеті бар "802-3-ethernet" баптауын қамтуы керек.

source: The port component of the SCI (Secure Channel Identifier), between 1 and 65534.
kk: SCI (Қауіпсіз Арна Идентификаторы) порт компоненті, 1 мен 65534 арасында.

source: Specifies whether the SCI (Secure Channel Identifier) is included in every packet.
kk: SCI (Қауіпсіз Арна Идентификаторы) әр пакетке қосыла ма, соны көрсетеді.

source: Specifies the validation mode for incoming frames.
kk: Кіріс кадрлар үшін тексеру режимін көрсетеді.

source: The macvlan mode, which specifies the communication mechanism between multiple macvlans on the same lower device.
kk: macvlan режимі, ол бір төменгі құрылғыдағы бірнеше macvlan арасындағы қосылым механизмін көрсетеді.

source: If given, specifies the parent interface name or parent connection UUID from which this MAC-VLAN interface should be created. If this property is not specified, the connection must contain an "802-3-ethernet" setting with a "mac-address" property.
kk: Берілген болса, осы MAC-VLAN интерфейсі жасалуы керек негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді. Егер бұл қасиет көрсетілмесе, қосылым "mac-address" қасиеті бар "802-3-ethernet" баптауын қамтуы керек.

source: Whether the parent interface should be put in promiscuous mode (true by default).
kk: Негізгі интерфейсті promiscuous режиміне қою керек пе (әдепкі бойынша true).

source: Whether the interface should be a MACVTAP.
kk: Интерфейс MACVTAP болуы керек пе.

source: A list of driver names to match. Each element is a shell wildcard pattern. See NMSettingMatch:interface-name for how special characters '|', '&', '!' and '\' are used for optional and mandatory matches and inverting the pattern.
kk: Сәйкестендіруге арналған драйвер атауларының тізімі. Әр элемент — қоршам қойылмалы таңбасының үлгісі. Міндетті емес және міндетті сәйкестіктер үшін және үлгіні терістеу үшін '|', '&', '!' және '\' арнайы таңбалары қалай қолданылатыны туралы NMSettingMatch:interface-name қараңыз.

source: A list of interface names to match. Each element is a shell wildcard pattern. An element can be prefixed with a pipe symbol (|) or an ampersand (&). The former means that the element is optional and the latter means that it is mandatory. If there are any optional elements, than the match evaluates to true if at least one of the optional element matches (logical OR). If there are any mandatory elements, then they all must match (logical AND). By default, an element is optional. This means that an element "foo" behaves the same as "|foo". An element can also be inverted with exclamation mark (!) between the pipe symbol (or the ampersand) and before the pattern. Note that "!foo" is a shortcut for the mandatory match "&!foo". Finally, a backslash can be used at the beginning of the element (after the optional special characters) to escape the start of the pattern. For example, "&\!a" is an mandatory match for literally "!a".
kk: Сәйкестендіруге арналған интерфейс атауларының тізімі. Әр элемент — қоршам қойылмалы таңбасының үлгісі. Элемент алдында тік сызық таңбасы (|) немесе амперсанд (&) болуы мүмкін. Біріншісі элементтің міндетті емес екенін, ал екіншісі оның міндетті екенін білдіреді. Егер кез келген міндетті емес элементтер болса, кем дегенде бір міндетті емес элемент сәйкес келсе, сәйкестік true деп бағаланады (логикалық OR). Егер кез келген міндетті элементтер болса, олардың барлығы сәйкес келуі керек (логикалық AND). Әдепкі бойынша, элемент міндетті емес. Бұл "foo" элементінің "|foo" сияқты әрекет ететінін білдіреді. Элементті тік сызық таңбасы (немесе амперсанд) мен үлгі алдындағы лебіз белгісі (!) арқылы терістеуге болады. Ескеріңіз, "!foo" — "&!foo" міндетті сәйкестігі үшін қысқарту. Соңында, үлгінің басын экрандау үшін элементтің басында (міндетті емес арнайы таңбалардан кейін) кері қиғаш сызықты қолдануға болады. Мысалы, "&\!a" — дәл "!a" үшін міндетті сәйкестік.

source: A list of kernel command line arguments to match. This may be used to check whether a specific kernel command line option is set (or unset, if prefixed with the exclamation mark). The argument must either be a single word, or an assignment (i.e. two words, joined by "="). In the former case the kernel command line is searched for the word appearing as is, or as left hand side of an assignment. In the latter case, the exact assignment is looked for with right and left hand side matching. Wildcard patterns are not supported. See NMSettingMatch:interface-name for how special characters '|', '&', '!' and '\' are used for optional and mandatory matches and inverting the match.
kk: Сәйкестендіруге арналған ядро пәрмен жолы аргументтерінің тізімі. Бұл белгілі бір ядро пәрмен жолы опциясының орнатылғанын (немесе лебіз белгісімен префикстелген болса, орнатылмағанын) тексеру үшін қолданылуы мүмкін. Аргумент бір сөз немесе тағайындау (яғни, "=" арқылы қосылған екі сөз) болуы керек. Бірінші жағдайда ядро пәрмен жолында сөз сол күйінде немесе тағайындаудың сол жағы ретінде ізделеді. Екінші жағдайда, оң және сол жағы сәйкес келетін нақты тағайындау ізделеді. Қойылмалы таңба үлгілеріне қолдау көрсетілмейді. Міндетті емес және міндетті сәйкестіктер үшін және сәйкестікті терістеу үшін '|', '&', '!' және '\' арнайы таңбалары қалай қолданылатыны туралы NMSettingMatch:interface-name қараңыз.

source: A list of paths to match against the ID_PATH udev property of devices. ID_PATH represents the topological persistent path of a device. It typically contains a subsystem string (pci, usb, platform, etc.) and a subsystem-specific identifier. For PCI devices the path has the form "pci-$domain:$bus:$device.$function", where each variable is an hexadecimal value; for example "pci-0000:0a:00.0". The path of a device can be obtained with "udevadm info /sys/class/net/$dev | grep ID_PATH=" or by looking at the "path" property exported by NetworkManager ("nmcli -f general.path device show $dev"). Each element of the list is a shell wildcard pattern. See NMSettingMatch:interface-name for how special characters '|', '&', '!' and '\' are used for optional and mandatory matches and inverting the pattern.
kk: Құрылғылардың ID_PATH udev қасиетіне қарсы сәйкестендірілетін жолдар тізімі. ID_PATH құрылғының топологиялық тұрақты жолын білдіреді. Ол әдетте ішкі жүйе жолын (pci, usb, platform, т.б.) және ішкі жүйеге тән идентификаторды қамтиды. PCI құрылғылары үшін жол "pci-$domain:$bus:$device.$function" түрінде болады, мұндағы әр айнымалы он алтылық мән; мысалы "pci-0000:0a:00.0". Құрылғының жолын "udevadm info /sys/class/net/$dev | grep ID_PATH=" арқылы немесе NetworkManager экспорттаған "path" қасиетіне қарап ("nmcli -f general.path device show $dev") алуға болады. Тізімнің әр элементі — қоршам қойылмалы таңбасының үлгісі. Міндетті емес және міндетті сәйкестіктер үшін және үлгіні терістеу үшін '|', '&', '!' және '\' арнайы таңбалары қалай қолданылатыны туралы NMSettingMatch:interface-name қараңыз.

source: Channel on which the mesh network to join is located.
kk: Қосылатын торлы желі орналасқан арна.

source: Anycast DHCP MAC address used when requesting an IP address via DHCP. The specific anycast address used determines which DHCP server class answers the request. This is currently only implemented by dhclient DHCP plugin.
kk: DHCP арқылы IP адрес сұрау кезінде қолданылатын anycast DHCP MAC адресі. Қолданылатын нақты anycast адресі қай DHCP сервер класы сұрауға жауап беретінін анықтайды. Бұл қазіргі уақытта тек dhclient DHCP плагинімен жүзеге асырылған.

source: SSID of the mesh network to join.
kk: Қосылатын торлы желінің SSID.

source: The data path type. One of "system", "netdev" or empty.
kk: Деректер жолының түрі. "system", "netdev" біреуі немесе бос.

source: The bridge failure mode. One of "secure", "standalone" or empty.
kk: Көпірдің істен шығу режимі. "secure", "standalone" біреуі немесе бос.

source: Enable or disable multicast snooping.
kk: Мультикаст snooping іске қосу немесе сөндіру.

source: Enable or disable RSTP.
kk: RSTP іске қосу немесе сөндіру.

source: Enable or disable STP.
kk: STP іске қосу немесе сөндіру.

source: Open vSwitch DPDK device arguments.
kk: Open vSwitch DPDK құрылғысының аргументтері.

source: Configures the Link State Change (LSC) detection mode for the OVS DPDK interface. When set to "ignore" (-1), NetworkManager doesn't change the default value configured by Open vSwitch. "enabled" (1) enables interrupts. "disabled" (0) disables interrupts, thus setting the interface in poll mode.
kk: OVS DPDK интерфейсі үшін Сілтеме Күйін Өзгертуді (LSC) анықтау режимін баптайды. "ignore" (-1) мәніне орнатылған кезде, NetworkManager Open vSwitch баптаған әдепкі мәнді өзгертпейді. "enabled" (1) үзілімдерді іске қосады. "disabled" (0) үзілімдерді сөндіреді, осылайша интерфейсті сұрау режиміне орнатады.

source: Open vSwitch DPDK number of rx queues. Defaults to zero which means to leave the parameter in OVS unspecified and effectively configures one queue.
kk: Open vSwitch DPDK rx кезектерінің саны. Әдепкі нөлге тең, бұл OVS-те параметрді көрсетілмеген күйде қалдыруды білдіреді және іс жүзінде бір кезекті баптайды.
