Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Couldn't verify PKCS#12 file: %s
kk: PKCS#12 файлын тексеру мүмкін болмады: %s

source: Couldn't initialize PKCS#8 decoder: %s
kk: PKCS#8 декодерін инициализациялау мүмкін болмады: %s

source: Couldn't decode PKCS#8 file: %s
kk: PKCS#8 файлының кодын ашу мүмкін болмады: %s

source: Failed to initialize the crypto engine: %d.
kk: Криптоқозғалтқышты инициализациялау сәтсіз аяқталды: %d.

source: Failed to initialize the decryption cipher slot.
kk: Шифрды ашу слотын инициализациялау сәтсіз аяқталды.

source: Failed to set symmetric key for decryption.
kk: Шифрды ашу үшін симметриялық кілтті орнату сәтсіз аяқталды.

source: Failed to set IV for decryption.
kk: Шифрды ашу үшін IV орнату сәтсіз аяқталды.

source: Failed to initialize the decryption context.
kk: Шифрды ашу контекстін инициализациялау сәтсіз аяқталды.

source: Failed to decrypt the private key: %d.
kk: Жеке кілттің шифрын ашу сәтсіз аяқталды: %d.

source: Failed to decrypt the private key: decrypted data too large.
kk: Жеке кілттің шифрын ашу сәтсіз аяқталды: шифры ашылған деректер тым үлкен.

source: Failed to finalize decryption of the private key: %d.
kk: Жеке кілттің шифрын ашуды аяқтау сәтсіз аяқталды: %d.

source: Failed to initialize the encryption cipher slot.
kk: Шифрлау слотын инициализациялау сәтсіз аяқталды.

source: Failed to set symmetric key for encryption.
kk: Шифрлау үшін симметриялық кілтті орнату сәтсіз аяқталды.

source: Failed to set IV for encryption.
kk: Шифрлау үшін IV орнату сәтсіз аяқталды.

source: Failed to initialize the encryption context.
kk: Шифрлау контекстін инициализациялау сәтсіз аяқталды.

source: Failed to encrypt: %d.
kk: Шифрлау сәтсіз аяқталды: %d.

source: Unexpected amount of data after encrypting.
kk: Шифрлаудан кейін деректердің күтпеген көлемі.

source: Couldn't decode certificate: %d
kk: Сертификаттың кодын ашу мүмкін болмады: %d

source: Password must be UTF-8
kk: Пароль UTF-8 болуы керек

source: Couldn't initialize slot
kk: Слотты инициализациялау мүмкін болмады

source: Couldn't initialize PKCS#12 decoder: %d
kk: PKCS#12 декодерін инициализациялау мүмкін болмады: %d

source: Couldn't decode PKCS#12 file: %d
kk: PKCS#12 файлының кодын ашу мүмкін болмады: %d

source: Couldn't verify PKCS#12 file: %d
kk: PKCS#12 файлын тексеру мүмкін болмады: %d

source: Could not generate random data.
kk: Кездейсоқ деректерді генерациялау мүмкін болмады.

source: Compiled without crypto support.
kk: Крипто қолдауынсыз құрастырылған.

source: PEM key file had no start tag
kk: PEM кілт файлында басталу тегі жоқ

source: PEM key file had no end tag '%s'.
kk: PEM кілт файлында '%s' аяқталу тегі жоқ.

source: Malformed PEM file: Proc-Type was not first tag.
kk: Қате PEM файлы: Proc-Type бірінші тег болмады.

source: Malformed PEM file: unknown Proc-Type tag '%s'.
kk: Қате PEM файлы: белгісіз Proc-Type тегі '%s'.

source: Malformed PEM file: DEK-Info was not the second tag.
kk: Қате PEM файлы: DEK-Info екінші тег болмады.

source: Malformed PEM file: no IV found in DEK-Info tag.
kk: Қате PEM файлы: DEK-Info тегінде IV табылмады.

source: Malformed PEM file: invalid format of IV in DEK-Info tag.
kk: Қате PEM файлы: DEK-Info тегіндегі IV пішімі жарамсыз.

source: Malformed PEM file: unknown private key cipher '%s'.
kk: Қате PEM файлы: белгісіз жеке кілт шифры '%s'.

source: Could not decode private key.
kk: Жеке кілттің кодын ашу мүмкін болмады.

source: Failed to find expected PKCS#8 start tag.
kk: Күтілген PKCS#8 басталу тегі табылмады.

source: Failed to find expected PKCS#8 end tag '%s'.
kk: Күтілген PKCS#8 аяқталу тегі '%s' табылмады.

source: Failed to decode PKCS#8 private key.
kk: PKCS#8 жеке кілтінің кодын ашу сәтсіз аяқталды.

source: Failed to find expected TSS start tag.
kk: Күтілген TSS басталу тегі табылмады.

source: Failed to find expected TSS end tag '%s'.
kk: Күтілген TSS аяқталу тегі '%s' табылмады.

source: IV must be an even number of bytes in length.
kk: IV ұзындығы жұп байт саны болуы керек.

source: IV contains non-hexadecimal digits.
kk: IV құрамында он алтылық емес цифрлар бар.

source: IV must contain at least 8 characters
kk: IV құрамында кем дегенде 8 таңба болуы керек

source: Unable to determine private key type.
kk: Жеке кілт түрін анықтау мүмкін емес.

source: Password provided, but key was not encrypted.
kk: Пароль берілді, бірақ кілт шифрланбаған.

source: PEM certificate had no start tag '%s'.
kk: PEM сертификатында '%s' басталу тегі жоқ.

source: PEM certificate had no end tag '%s'.
kk: PEM сертификатында '%s' аяқталу тегі жоқ.

source: Failed to decode certificate.
kk: Сертификаттың кодын ашу сәтсіз аяқталды.

source: Certificate file is empty
kk: Сертификат файлы бос

source: Failed to recognize certificate
kk: Сертификатты тану сәтсіз аяқталды

source: not a valid private key
kk: жарамды жеке кілт емес

source: Method returned type '%s', but expected '%s'
kk: Әдіс '%s' түрін қайтарды, бірақ '%s' күтілді

source: object class '%s' has no property named '%s'
kk: '%s' объект класында '%s' атты қасиет жоқ

source: property '%s' of object class '%s' is not writable
kk: '%s' объект класының '%s' қасиеті жазылмайды

source: construct property "%s" for object '%s' can't be set after construction
kk: '%s' объектісі үшін "%s" құру қасиетін құрылғаннан кейін орнату мүмкін емес

source: '%s::%s' is not a valid property name; '%s' is not a GObject subtype
kk: '%s::%s' — жарамды қасиет аты емес; '%s' — GObject ішкі түрі емес

source: unable to set property '%s' of type '%s' from value of type '%s'
kk: '%s' түріндегі '%s' қасиетін '%s' түріндегі мәннен орнату мүмкін емес

source: value "%s" of type '%s' is invalid or out of range for property '%s' of type '%s'
kk: '%s' түріндегі "%s" мәні жарамсыз немесе '%s' түріндегі '%s' қасиетінің ауқымынан тыс

source: interface name is missing
kk: интерфейс аты жетіспейді

source: interface name is too short
kk: интерфейс аты тым қысқа

source: interface name is reserved
kk: интерфейс аты резервтелген

source: interface name contains an invalid character
kk: интерфейс атында жарамсыз таңба бар

source: interface name is longer than 15 characters
kk: интерфейс аты 15 таңбадан ұзын

source: '%%' is not allowed in interface names
kk: интерфейс аттарында '%%' таңбасына рұқсат жоқ

source: '%s' is not allowed as interface name
kk: '%s' интерфейс аты ретінде рұқсат етілмейді

source: interface name must be alphanumerical with no forward or backward slashes
kk: интерфейс аты әріптік-сандық болуы керек және қиғаш сызықтарсыз болуы тиіс

source: interface name must not be empty
kk: интерфейс аты бос болмауы керек

source: interface name must be UTF-8 encoded
kk: интерфейс аты UTF-8 кодталған болуы керек

source: Unknown log level '%s'
kk: Белгісіз журнал деңгейі '%s'

source: Unknown log domain '%s'
kk: Белгісіз журнал домені '%s'

source: '%s' is ambiguous (%s)
kk: '%s' екіұшты (%s)

source: '%s' is not valid; use [%s] or [%s]
kk: '%s' жарамсыз; [%s] немесе [%s] қолданыңыз

source: '%s' is not valid; use [%s], [%s] or [%s]
kk: '%s' жарамсыз; [%s], [%s] немесе [%s] қолданыңыз

source: '%s' is ambiguous: %s
kk: '%s' екіұшты: %s

source: missing name, try one of [%s]
kk: атау жетіспейді, мыналардың бірін көріңіз: [%s]

source: '%s' not among [%s]
kk: '%s' мыналардың арасында жоқ: [%s]

source: unknown
kk: белгісіз

source: unmanaged
kk: басқарылмайтын

source: unavailable
kk: қолжетімсіз

source: disconnected
kk: ажыратылған

source: connecting (prepare)
kk: қосылуда (дайындау)

source: connecting (configuring)
kk: қосылуда (баптау)

source: connecting (need authentication)
kk: қосылуда (аутентификация қажет)

source: connecting (getting IP configuration)
kk: қосылуда (IP конфигурациясын алу)

source: connecting (checking IP connectivity)
kk: қосылуда (IP қосылымын тексеру)

source: connecting (starting secondary connections)
kk: қосылуда (қосымша қосылымдарды бастау)

source: connected
kk: қосылған

source: deactivating
kk: сөндірілуде

source: connection failed
kk: қосылым сәтсіз аяқталды

source: connecting (externally)
kk: қосылуда (сырттай)

source: connected (externally)
kk: қосылған (сырттай)

source: deactivating (externally)
kk: сөндірілуде (сырттай)

source: yes
kk: иә

source: no
kk: жоқ

source: yes (guessed)
kk: иә (болжалды)

source: no (guessed)
kk: жоқ (болжалды)

source: No reason given
kk: Себебі көрсетілмеген

source: Unknown error
kk: Белгісіз қате

source: Device is now managed
kk: Құрылғы енді басқарылады

source: Device is now unmanaged
kk: Құрылғы енді басқарылмайды

source: The device could not be readied for configuration
kk: Құрылғыны конфигурацияға дайындау мүмкін болмады

source: IP configuration could not be reserved (no available address, timeout, etc.)
kk: IP конфигурациясын резервтеу мүмкін болмады (қолжетімді адрес жоқ, уақыт бітті және т.б.)

source: The IP configuration is no longer valid
kk: IP конфигурациясы енді жарамсыз

source: Secrets were required, but not provided
kk: Құпия кілттер талап етілді, бірақ ұсынылмады

source: 802.1X supplicant disconnected
kk: 802.1X суппликанты ажыратылды

source: 802.1X supplicant configuration failed
kk: 802.1X суппликанты конфигурациясы сәтсіз аяқталды

source: 802.1X supplicant failed
kk: 802.1X суппликанты сәтсіз аяқталды

source: 802.1X supplicant took too long to authenticate
kk: 802.1X суппликанты аутентификациялауға тым көп уақыт жұмсады

source: PPP service failed to start
kk: PPP қызметін іске қосу сәтсіз аяқталды

source: PPP service disconnected
kk: PPP қызметі ажыратылды

source: PPP failed
kk: PPP сәтсіз аяқталды

source: DHCP client failed to start
kk: DHCP клиентін іске қосу сәтсіз аяқталды

source: DHCP client error
kk: DHCP клиентінің қатесі

source: DHCP client failed
kk: DHCP клиенті сәтсіз аяқталды

source: Shared connection service failed to start
kk: Ортақ қосылым қызметін іске қосу сәтсіз аяқталды

source: Shared connection service failed
kk: Ортақ қосылым қызметі сәтсіз аяқталды

source: AutoIP service failed to start
kk: AutoIP қызметін іске қосу сәтсіз аяқталды

source: AutoIP service error
kk: AutoIP қызметінің қатесі

source: AutoIP service failed
kk: AutoIP қызметі сәтсіз аяқталды

source: The line is busy
kk: Желі бос емес

source: No dial tone
kk: Гудок жоқ

source: No carrier could be established
kk: Тасымалдаушыны орнату мүмкін болмады

source: The dialing request timed out
kk: Нөмір теру сұранысының уақыты өтті

source: The dialing attempt failed
kk: Нөмір теру әрекеті сәтсіз аяқталды

source: Modem initialization failed
kk: Модемді инициализациялау сәтсіз аяқталды

source: Failed to select the specified APN
kk: Көрсетілген APN таңдау сәтсіз аяқталды

source: Not searching for networks
kk: Желілер ізделмей жатыр

source: Network registration denied
kk: Желіге тіркелуден бас тартылды

source: Network registration timed out
kk: Желіге тіркелу уақыты өтті

source: Failed to register with the requested network
kk: Сұралған желіге тіркелу сәтсіз аяқталды

source: PIN check failed
kk: PIN тексеру сәтсіз аяқталды

source: Necessary firmware for the device may be missing
kk: Құрылғы үшін қажетті микробағдарлама жоқ болуы мүмкін

source: The device was removed
kk: Құрылғы өшірілді

source: NetworkManager went to sleep
kk: NetworkManager ұйқы режиміне өтті

source: The device's active connection disappeared
kk: Құрылғының белсенді қосылымы жоғалып кетті

source: Device disconnected by user or client
kk: Құрылғыны пайдаланушы немесе клиент ажыратты

source: Carrier/link changed
kk: Тасымалдаушы/қосылым өзгерді

source: The device's existing connection was assumed
kk: Құрылғының бар қосылымы алынды

source: The supplicant is now available
kk: Суппликант енді қолжетімді

source: The modem could not be found
kk: Модем табылмады

source: The Bluetooth connection failed or timed out
kk: Bluetooth қосылымы сәтсіз аяқталды немесе уақыты өтті

source: GSM Modem's SIM card not inserted
kk: GSM модемінің SIM картасы салынбаған

source: GSM Modem's SIM PIN required
kk: GSM модемінің SIM PIN коды қажет

source: GSM Modem's SIM PUK required
kk: GSM модемінің SIM PUK коды қажет

source: GSM Modem's SIM wrong
kk: GSM модемінің SIM картасы қате

source: InfiniBand device does not support connected mode
kk: InfiniBand құрылғысы қосылған режимді қолдамайды

source: A dependency of the connection failed
kk: Қосылым тәуелділігі сәтсіз аяқталды

source: A problem with the RFC 2684 Ethernet over ADSL bridge
kk: ADSL көпірі арқылы RFC 2684 Ethernet мәселесі

source: ModemManager is unavailable
kk: ModemManager қолжетімсіз

source: The Wi-Fi network could not be found
kk: Wi-Fi желісі табылмады

source: A secondary connection of the base connection failed
kk: Негізгі қосылымның қосымша қосылымы сәтсіз аяқталды

source: DCB or FCoE setup failed
kk: DCB немесе FCoE орнату сәтсіз аяқталды

source: teamd control failed
kk: teamd басқаруы сәтсіз аяқталды

source: Modem failed or no longer available
kk: Модем сәтсіз аяқталды немесе енді қолжетімсіз

source: Modem now ready and available
kk: Модем енді дайын және қолжетімді

source: SIM PIN was incorrect
kk: SIM PIN коды қате болды

source: New connection activation was enqueued
kk: Жаңа қосылымды белсендіру кезекке қойылды

source: The device's parent changed
kk: Құрылғының аталық элементі өзгерді

source: The device parent's management changed
kk: Құрылғының аталық элементін басқару өзгерді

source: Open vSwitch database connection failed
kk: Open vSwitch дерекқорына қосылу сәтсіз аяқталды

source: A duplicate IP address was detected
kk: Қайталанатын IP адресі анықталды

source: The selected IP method is not supported
kk: Таңдалған IP әдісіне қолдау жоқ

source: Failed to configure SR-IOV parameters
kk: SR-IOV параметрлерін баптау сәтсіз аяқталды

source: The Wi-Fi P2P peer could not be found
kk: Wi-Fi P2P торабы табылмады

source: The device handler dispatcher returned an error
kk: Құрылғы өңдеушісінің диспетчері қате қайтарды

source: The device is unmanaged because networking is disabled or the system is suspended
kk: Құрылғы басқарылмайды, өйткені желі сөндірулі немесе жүйе ұйықтатылған

source: The device is unmanaged because NetworkManager is quitting
kk: Құрылғы басқарылмайды, өйткені NetworkManager жұмысын аяқтауда

source: The device is unmanaged because the link is not initialized by udev
kk: Құрылғы басқарылмайды, өйткені қосылымды udev инициализацияламаған

source: The device is unmanaged by explicit user decision (e.g. 'nmcli device set $DEV managed no')
kk: Құрылғы пайдаланушының тікелей шешімімен басқарылмайды (мысалы, 'nmcli device set $DEV managed no')

source: The device is unmanaged by user decision via settings plugin ("unmanaged-devices" for keyfile or "NM_CONTROLLED=no" for ifcfg-rh)
kk: Құрылғы баптаулар плагині арқылы пайдаланушы шешімімен басқарылмайды (keyfile үшін "unmanaged-devices" немесе ifcfg-rh үшін "NM_CONTROLLED=no")

source: The device is unmanaged by user decision in NetworkManager.conf ('unmanaged' in a [device*] section)
kk: Құрылғы NetworkManager.conf ішіндегі пайдаланушы шешімімен басқарылмайды ([device*] бөліміндегі 'unmanaged')

source: The device is unmanaged because the device type is unmanaged by default
kk: Құрылғы басқарылмайды, өйткені құрылғы түрі әдепкі бойынша басқарылмайды

source: The device is unmanaged via udev rule
kk: Құрылғы udev ережесі арқылы басқарылмайды

source: The device is unmanaged because it is an external device and is unconfigured (down or without addresses)
kk: Құрылғы басқарылмайды, өйткені ол сыртқы құрылғы және бапталмаған (сөндірулі немесе адрестерсіз)

source: Networking was disabled
kk: Желі сөндірілді

source: The modem didn't have an operator code
kk: Модемде оператор коды болмады

source: Unknown reason
kk: Белгісіз себеп

source: The connection was disconnected
kk: Қосылым ажыратылды

source: Disconnected by user
kk: Пайдаланушы ажыратқан

source: The base network connection was interrupted
kk: Негізгі желілік қосылым үзілді

source: The VPN service stopped unexpectedly
kk: VPN қызметі күтпеген жерден тоқтады

source: The VPN service returned invalid configuration
kk: VPN қызметі жарамсыз конфигурацияны қайтарды

source: The connection attempt timed out
kk: Қосылу әрекетінің уақыты өтті

source: The VPN service did not start in time
kk: VPN қызметі уақытында іске қосылмады

source: The VPN service failed to start
kk: VPN қызметін іске қосу сәтсіз аяқталды

source: No valid secrets
kk: Жарамды құпия кілттер жоқ

source: Invalid secrets
kk: Жарамсыз құпия кілттер

source: The connection was removed
kk: Қосылым өшірілді

source: Master connection failed
kk: Негізгі қосылым сәтсіз аяқталды

source: Could not create a software link
kk: Бағдарламалық қосылымды жасау мүмкін болмады

source: The device disappeared
kk: Құрылғы жоғалып кетті

source: missing colon for "<setting>.<property>:<secret>" format
kk: "<setting>.<property>:<secret>" пішімі үшін қос нүкте жетіспейді

source: missing dot for "<setting>.<property>:<secret>" format
kk: "<setting>.<property>:<secret>" пішімі үшін нүкте жетіспейді

source: missing setting for "<setting>.<property>:<secret>" format
kk: "<setting>.<property>:<secret>" пішімі үшін баптау жетіспейді

source: missing property for "<setting>.<property>:<secret>" format
kk: "<setting>.<property>:<secret>" пішімі үшін қасиет жетіспейді

source: invalid setting name
kk: жарамсыз баптау аты

source: property name is not UTF-8
kk: қасиет аты UTF-8 емес

source: secret is not UTF-8
kk: құпия кілт UTF-8 емес

source: Could not find any session id for uid %d
kk: uid %d үшін ешқандай сессия id табылмады

source: Could not retrieve session id: %s
kk: Сессия id алу мүмкін болмады: %s

source: Preshared-key for %s
kk: %s үшін алдын ала бөлісілген кілт (preshared-key)

source: Username
kk: Пайдаланушы аты

source: Password
kk: Пароль

source: Identity
kk: Идентификатор

source: Private key password
kk: Жеке кілт паролі

source: Key
kk: Кілт

source: Service
kk: Қызмет

source: WireGuard private-key
kk: WireGuard жеке кілті

source: Secrets are required to connect WireGuard VPN '%s'
kk: '%s' WireGuard VPN-ге қосылу үшін құпия кілттер қажет

source: A password is required to connect to '%s'.
kk: '%s' жеріне қосылу үшін пароль қажет.

source: Authentication required by wireless network
kk: Сымсыз желі аутентификацияны талап етеді

source: Push of the WPS button on the router or a password is required to access the wireless network '%s'.
kk: '%s' сымсыз желісіне қол жеткізу үшін роутердегі WPS батырмасын басу немесе пароль қажет.

source: Passwords or encryption keys are required to access the wireless network '%s'.
kk: '%s' сымсыз желісіне қол жеткізу үшін парольдер немесе шифрлау кілттері қажет.

source: Wired 802.1X authentication
kk: Сымды 802.1X аутентификациясы

source: Secrets are required to access the wired network '%s'
kk: '%s' сымды желісіне қол жеткізу үшін құпия кілттер қажет

source: DSL authentication
kk: DSL аутентификациясы

source: Secrets are required for the DSL connection '%s'
kk: '%s' DSL қосылымы үшін құпия кілттер қажет

source: PIN code required
kk: PIN код қажет

source: PIN code is needed for the mobile broadband device
kk: Мобильді кең жолақты құрылғы үшін PIN код қажет

source: Mobile broadband network password
kk: Мобильді кең жолақты желі паролі

source: Secrets are required to access the MACsec network '%s'
kk: '%s' MACsec желісіне қол жеткізу үшін құпия кілттер қажет

source: MACsec PSK authentication
kk: MACsec PSK аутентификациясы

source: MACsec EAP authentication
kk: MACsec EAP аутентификациясы

source: WireGuard VPN secret
kk: WireGuard VPN құпия кілті

source: VPN password required
kk: VPN паролі қажет

source: unknown VPN plugin "%s"
kk: белгісіз VPN плагині "%s"

source: cannot load legacy-only VPN plugin "%s" for "%s"
kk: "%s" үшін тек ескірген түрдегі "%s" VPN плагинін жүктеу мүмкін емес

source: cannot load VPN plugin "%s" due to missing "%s". Missing client plugin?
kk: "%s" жетіспегендіктен "%s" VPN плагинін жүктеу мүмкін емес. Клиент плагині жоқ па?

source: failed to load VPN plugin "%s": %s
kk: "%s" VPN плагинін жүктеу сәтсіз аяқталды: %s

source: Certificate password
kk: Сертификат паролі

source: HTTP proxy password
kk: HTTP прокси паролі

source: Group password
kk: Топ паролі

source: Gateway URL
kk: Шлюз URL адресі

source: Gateway certificate hash
kk: Шлюз сертификатының хэші

source: Gateway DNS resolution ('host:IP')
kk: Шлюз DNS шешімі ('хост:IP')

source: no gateway configured
kk: шлюз бапталмаған

source: exited with status %d
kk: %d күйімен аяқталды

source: exited on signal %d
kk: %d сигналы бойынша аяқталды

source: insufficent secrets returned
kk: жеткіліксіз құпия кілттер қайтарылды

source: field '%s' has to be alone
kk: '%s' өрісі жалғыз болуы керек

source: invalid field '%s%s%s%s%s'; %s%s%s
kk: жарамсыз өріс '%s%s%s%s%s'; %s%s%s

source: invalid prefix '%s'; <0-%d> allowed
kk: жарамсыз префикс '%s'; <0-%d> рұқсат етілген

source: invalid IP address: %s
kk: жарамсыз IP адресі: %s

source: The valid syntax is: 'ip[/prefix] [next-hop] [metric] [attribute=val]... [,ip[/prefix] ...]'
kk: Жарамды синтаксис: 'ip[/prefix] [next-hop] [metric] [attribute=val]... [,ip[/prefix] ...]'

source: the next hop ('%s') must be first
kk: келесі секіріс ('%s') бірінші болуы керек

source: the metric ('%s') must be before attributes
kk: метрика ('%s') атрибуттардан бұрын болуы керек

source: invalid route: %s. %s
kk: жарамсыз бағдар: %s. %s

source: cannot read pac-script from file '%s'
kk: '%s' файлынан pac-скриптін оқу мүмкін емес

source: file '%s' contains non-valid utf-8
kk: '%s' файлында жарамсыз utf-8 бар

source: '%s' does not contain a valid PAC Script
kk: '%s' құрамында жарамды PAC скрипті жоқ

source: Not a valid PAC Script
kk: Жарамды PAC скрипті емес

source: cannot read team config from file '%s'
kk: '%s' файлынан team конфигурациясын оқу мүмкін емес

source: team config file '%s' contains non-valid utf-8
kk: '%s' team конфигурация файлында жарамсыз utf-8 бар

source: auto
kk: авто

source: '%s' is out of range [%
kk: '%s' ауқымнан тыс [%

source: '%s' is not a valid number
kk: '%s' — жарамды сан емес

source: '%s' is out of range [0, %u]
kk: '%s' — [0, %u] ауқымының сыртында

source: '%s' is not a valid Ethernet MAC
kk: '%s' — жарамды Ethernet MAC емес

source: invalid option '%s', use a combination of [%s]
kk: жарамсыз опция '%s', [%s] комбинациясын қолданыңыз

source: %d (key)
kk: %d (кілт)

source: %d (passphrase)
kk: %d (кілттік фраза)

source: %d (unknown)
kk: %d (белгісіз)

source: 0 (none)
kk: 0 (жоқ)

source: agent-owned,
kk: агент иелігінде,

source: not saved,
kk: сақталмаған,

source: not required,
kk: талап етілмейді,

source: '%s' is not valid; use <option>=<value>
kk: '%s' жарамсыз; <option>=<value> қолданыңыз

source: cannot set empty "%s" option
kk: бос "%s" опциясын орнату мүмкін емес

source: '%u' flags are not valid; use combination of %s
kk: '%u' жалаушалары жарамсыз; %s комбинациясын қолданыңыз

source: '%s' is not a valid number (or out of range)
kk: '%s' — жарамды сан емес (немесе ауқымнан тыс)

source: invalid IPv4 or subnet "%s"
kk: жарамсыз IPv4 немесе ішкі желі "%s"

source: not a valid hex-string
kk: жарамды hex-жолы емес

source: '%s' is not a valid hex character
kk: '%s' — жарамды hex таңбасы емес

source: too many arguments. Please only specify a private key file and optionally a password
kk: аргументтер тым көп. Тек жеке кілт файлын және қалауыңызша парольді көрсетіңіз

source: failed to set bond option "%s"
kk: "%s" bond опциясын орнату сәтсіз аяқталды
