Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: The autoconnect priority in range -999 to 999. If the connection is set to autoconnect, connections with higher priority will be preferred. The higher number means higher priority. Defaults to 0. Note that this property only matters if there are more than one candidate profile to select for autoconnect. In case of equal priority, the profile used most recently is chosen.
kk: -999 және 999 ауқымындағы автоматты қосылу басымдығы. Егер қосылым автоматты қосылуға орнатылса, жоғары басымдығы бар қосылымдарға артықшылық беріледі. Сан неғұрлым жоғары болса, басымдық соғұрлым жоғары болады. Әдепкі мәні 0. Бұл қасиет тек автоматты қосылу үшін таңдауға бірнеше үміткер профиль болған жағдайда ғана маңызды екенін ескеріңіз. Басымдық тең болған жағдайда, ең соңғы пайдаланылған профиль таңдалады.

source: The number of times a connection should be tried when autoactivating before giving up. Zero means forever, -1 means the global default (4 times if not overridden). Setting this to 1 means to try activation only once before blocking autoconnect. Note that after a timeout, NetworkManager will try to autoconnect again.
kk: Бас тартпас бұрын автоматты белсендіру кезінде қосылымға тырысу саны. Нөл мәңгілікті білдіреді, -1 глобалды әдепкі мәнді білдіреді (егер қайта анықталмаса, 4 рет). Бұны 1-ге орнату автоматты қосылуды бұғаттамас бұрын белсендіруді тек бір рет көруді білдіреді. Кідірістен кейін NetworkManager автоматты қосылуға қайта тырысатынын ескеріңіз.

source: Whether or not ports of this connection should be automatically brought up when NetworkManager activates this connection. This only has a real effect for controller connections. The properties "autoconnect", "autoconnect-priority" and "autoconnect-retries" are unrelated to this setting. The permitted values are: 0: leave port connections untouched, 1: activate all the port connections with this connection, -1: default. If -1 (default) is set, global connection.autoconnect-slaves is read to determine the real value. If it is default as well, this fallbacks to 0. Deprecated 1.46. Use "autoconnect-ports" instead, this is just an alias.
kk: NetworkManager осы қосылымды белсендіргенде осы қосылымның порттары автоматты түрде іске қосылуы керек пе. Бұл тек контроллер қосылымдарына нақты әсер етеді. "autoconnect", "autoconnect-priority" және "autoconnect-retries" қасиеттері бұл баптауға қатысы жоқ. Рұқсат етілген мәндер: 0: порт қосылымдарын өзгеріссіз қалдыру, 1: осы қосылыммен бірге барлық порт қосылымдарын белсендіру, -1: әдепкі. Егер -1 (әдепкі) орнатылса, нақты мәнді анықтау үшін глобалды connection.autoconnect-slaves оқылады. Егер ол да әдепкі болса, бұл 0-ге ауысады. 1.46 нұсқасында ескірген. Орнына "autoconnect-ports" қолданыңыз, бұл жай ғана бүркеншік ат.

source: Interface name of the controller device or UUID of the controller connection.
kk: Контроллер құрылғысының интерфейс аты немесе контроллер қосылымының UUID коды.

source: Whether DNSOverTls (dns-over-tls) is enabled for the connection. DNSOverTls is a technology which uses TLS to encrypt dns traffic. The permitted values are: "yes" (2) use DNSOverTls and disabled fallback, "opportunistic" (1) use DNSOverTls but allow fallback to unencrypted resolution, "no" (0) don't ever use DNSOverTls. If unspecified "default" depends on the plugin used. Systemd-resolved uses global setting. This feature requires a plugin which supports DNSOverTls. Otherwise, the setting has no effect. One such plugin is dns-systemd-resolved.
kk: Қосылым үшін DNSOverTls (dns-over-tls) іске қосылған ба. DNSOverTls — dns трафигін шифрлау үшін TLS қолданатын технология. Рұқсат етілген мәндер: "yes" (2) DNSOverTls қолдану және резервтік нұсқаны сөндіру, "opportunistic" (1) DNSOverTls қолдану, бірақ шифрланбаған шешімге оралуға рұқсат беру, "no" (0) ешқашан DNSOverTls қолданбау. Егер көрсетілмесе, "default" қолданылған плагинге байланысты болады. Systemd-resolved глобалды баптауды қолданады. Бұл мүмкіндік DNSOverTls қолдайтын плагинді талап етеді. Әйтпесе, баптаудың ешқандай әсері болмайды. Осындай плагиндердің бірі — dns-systemd-resolved.

source: Whether DNSSEC (dnssec) is enabled for the connection. The permitted values are: "yes" (2) use DNSSEC and disable fallback, "allow-downgrade" (1) use DNSSEC but allow fallback if the server does not support it, "no" (0) don't ever use DNSSEC. The effect of "default" (-1) depends on the dns plugin used. Systemd-resolved uses its global setting in this case. This feature requires a plugin which supports DNSSEC. Otherwise, the setting has no effect. One such plugin is systemd-resolved.
kk: Қосылым үшін DNSSEC (dnssec) іске қосылған ба. Рұқсат етілген мәндер: "yes" (2) DNSSEC қолдану және резервтік нұсқаны сөндіру, "allow-downgrade" (1) DNSSEC қолдану, бірақ сервер қолдамаса резервтік нұсқаға рұқсат беру, "no" (0) ешқашан DNSSEC қолданбау. "default" (-1) әсері қолданылған dns плагиніне байланысты. Бұл жағдайда Systemd-resolved өзінің глобалды баптауын қолданады. Бұл мүмкіндік DNSSEC қолдайтын плагинді талап етеді. Әйтпесе, баптаудың ешқандай әсері болмайды. Осындай плагиндердің бірі — systemd-resolved.

source: Whether the connection will be brought down before the system is powered off. The default value is "default" (-1). When the default value is specified, then the global value from NetworkManager configuration is looked up, if not set, it is considered as "no" (0).
kk: Жүйе өшірілмес бұрын қосылым тоқтатыла ма. Әдепкі мәні — "default" (-1). Әдепкі мән көрсетілгенде, NetworkManager конфигурациясынан глобалды мән ізделеді, егер орнатылмаса, ол "no" (0) деп саналады.

source: If greater than zero, delay success of IP addressing until either the timeout is reached, or an IP gateway replies to a ping.
kk: Егер нөлден үлкен болса, күту уақыты аяқталғанша немесе IP шлюзі пингке жауап бергенше IP адрестеудің сәтті аяқталуын кідірту.

source: A human readable unique identifier for the connection, like "Work Wi-Fi" or "T-Mobile 3G".
kk: "Жұмыс Wi-Fi" немесе "T-Mobile 3G" сияқты қосылым үшін адам оқи алатын бірегей идентификатор.

source: The name of the network interface this connection is bound to. If not set, then the connection can be attached to any interface of the appropriate type (subject to restrictions imposed by other settings). For software devices this specifies the name of the created device. For connection types where interface names cannot easily be made persistent (e.g. mobile broadband or USB Ethernet), this property should not be used. Setting this property restricts the interfaces a connection can be used with, and if interface names change or are reordered the connection may be applied to the wrong interface.
kk: Осы қосылым бекітілген желілік интерфейстің аты. Егер орнатылмаса, қосылым сәйкес түрдегі кез келген интерфейске тіркеле алады (басқа баптаулар қойған шектеулерге сәйкес). Бағдарламалық құрылғылар үшін бұл жасалған құрылғының атын көрсетеді. Интерфейс аттарын оңай тұрақты ету мүмкін емес қосылым түрлері үшін (мысалы, мобильді кең жолақты немесе USB Ethernet), бұл қасиетті қолданбау керек. Бұл қасиетті орнату қосылым қолданыла алатын интерфейстерді шектейді және егер интерфейс аттары өзгерсе немесе қайта реттелсе, қосылым қате интерфейске қолданылуы мүмкін.

source: The property specifies a list of target IP addresses for pinging. When multiple targets are set, NetworkManager will start multiple ping processes in parallel. This property can only be set if connection.ip-ping-timeout is set. The ip-ping-timeout is used to delay the success of IP addressing until either the specified timeout (in seconds) is reached, or an target IP address replies to a ping. Configuring "ip-ping-addresses" may delay reaching the systemd's network-online.target due to waiting for the ping operations to complete or timeout.
kk: Қасиет пингтеу үшін мақсатты IP адрестерінің тізімін көрсетеді. Бірнеше мақсат орнатылғанда, NetworkManager параллельді түрде бірнеше пинг процесін бастайды. Бұл қасиетті тек connection.ip-ping-timeout орнатылған жағдайда орнатуға болады. ip-ping-timeout көрсетілген күту уақыты (секундпен) аяқталғанша немесе мақсатты IP адресі пингке жауап бергенше IP адрестеудің сәтті аяқталуын кідірту үшін қолданылады. "ip-ping-addresses" баптау пинг операцияларының аяқталуын немесе уақыттың өтуін күту себебінен systemd-нің network-online.target мақсатына жетуді кідіртуі мүмкін.

source: The property determines whether it is sufficient for any ping check to succeed among "ip-ping-addresses", or if all ping checks must succeed for "ip-ping-addresses".
kk: Бұл қасиет "ip-ping-addresses" ішінде кез келген ping тексерісінің сәтті өтуі жеткілікті ме, әлде барлық ping тексерістері сәтті өтуі керек пе екенін анықтайды.

source: If greater than zero, delay success of IP addressing until either the specified timeout (in seconds) is reached, or a target IP address replies to a ping. The property specifies the timeout for the "ip-ping-addresses". This property is incompatible with "gateway-ping-timeout", you cannot set these two properties at the same time.
kk: Егер нөлден үлкен болса, IP адрестеудің сәтті аяқталуын көрсетілген күту уақыты (секундпен) аяқталғанша немесе мақсатты IP адрес ping-ке жауап бергенше кідіртеді. Бұл қасиет "ip-ping-addresses" үшін күту уақытын көрсетеді. Бұл қасиет "gateway-ping-timeout" қасиетімен үйлесімсіз, сіз бұл екі қасиетті бір уақытта орната алмайсыз.

source: Whether LLDP is enabled for the connection.
kk: Қосылым үшін LLDP іске қосылған ба.

source: Whether Link-Local Multicast Name Resolution (LLMNR) is enabled for the connection. LLMNR is a protocol based on the Domain Name System (DNS) packet format that allows both IPv4 and IPv6 hosts to perform name resolution for hosts on the same local link. The permitted values are: "yes" (2) register hostname and resolving for the connection, "no" (0) disable LLMNR for the interface, "resolve" (1) do not register hostname but allow resolving of LLMNR host names If unspecified, "default" ultimately depends on the DNS plugin (which for systemd-resolved currently means "yes"). This feature requires a plugin which supports LLMNR. Otherwise, the setting has no effect. One such plugin is dns-systemd-resolved.
kk: Қосылым үшін Link-Local Multicast Name Resolution (LLMNR) іске қосылған ба. LLMNR — бұл IPv4 және IPv6 хосттарына бір жергілікті сілтемедегі хосттар үшін атауларды шешуге мүмкіндік беретін Domain Name System (DNS) пакет пішіміне негізделген хаттама. Рұқсат етілген мәндер: "yes" (2) хост атын тіркеу және қосылым үшін шешу, "no" (0) интерфейс үшін LLMNR сөндіру, "resolve" (1) хост атын тіркемеу, бірақ LLMNR хост аттарын шешуге рұқсат ету. Егер көрсетілмесе, "default" түпкілікті DNS плагиніне байланысты (бұл systemd-resolved үшін қазіргі уақытта "yes" дегенді білдіреді). Бұл мүмкіндік LLMNR қолдайтын плагинді қажет етеді. Әйтпесе, баптаудың ешқандай әсері болмайды. Ондай плагиндердің бірі — dns-systemd-resolved.

source: Interface name of the controller device or UUID of the controller connection. Deprecated 1.46. Use "controller" instead, this is just an alias.
kk: Контроллер құрылғысының интерфейс атауы немесе контроллер қосылымының UUID. 1.46 нұсқасында ескірген. Орнына "controller" қолданыңыз, бұл жай ғана бүркеншік ат.

source: Whether mDNS is enabled for the connection. The permitted values are: "yes" (2) register hostname and resolving for the connection, "no" (0) disable mDNS for the interface, "resolve" (1) do not register hostname but allow resolving of mDNS host names and "default" (-1) to allow lookup of a global default in NetworkManager.conf. If unspecified, "default" ultimately depends on the DNS plugin. This feature requires a plugin which supports mDNS. Otherwise, the setting has no effect. Currently the only supported DNS plugin is systemd-resolved. For systemd-resolved, the default is configurable via MulticastDNS= setting in resolved.conf.
kk: Қосылым үшін mDNS іске қосылған ба. Рұқсат етілген мәндер: "yes" (2) хост атын тіркеу және қосылым үшін шешу, "no" (0) интерфейс үшін mDNS сөндіру, "resolve" (1) хост атын тіркемеу, бірақ mDNS хост аттарын шешуге рұқсат ету және "default" (-1) NetworkManager.conf ішіндегі глобалды әдепкі мәнді іздеуге рұқсат ету. Егер көрсетілмесе, "default" түпкілікті DNS плагиніне байланысты. Бұл мүмкіндік mDNS қолдайтын плагинді қажет етеді. Әйтпесе, баптаудың ешқандай әсері болмайды. Қазіргі уақытта қолдау көрсетілетін жалғыз DNS плагині — systemd-resolved. systemd-resolved үшін әдепкі мән resolved.conf ішіндегі MulticastDNS= баптауы арқылы реттеледі.

source: Whether the connection is metered. When updating this property on a currently activated connection, the change takes effect immediately.
kk: Қосылым өлшенетін бе. Қазіргі белсендірілген қосылымда осы қасиетті жаңарту кезінде, өзгеріс бірден күшіне енеді.

source: Whether to configure MPTCP endpoints and the address flags. If MPTCP is enabled in NetworkManager, it will configure the addresses of the interface as MPTCP endpoints. Note that IPv4 loopback addresses (127.0.0.0/8), IPv4 link local addresses (169.254.0.0/16), the IPv6 loopback address (::1), IPv6 link local addresses (fe80::/10), IPv6 unique local addresses (ULA, fc00::/7) and IPv6 privacy extension addresses (rfc3041, ipv6.ip6-privacy) will be excluded from being configured as endpoints. If "disabled" (0x1), MPTCP handling for the interface is disabled and no endpoints are registered. The "enabled" (0x2) flag means that MPTCP handling is enabled. This flag can also be implied from the presence of other flags. Even when enabled, MPTCP handling will by default still be disabled unless "/proc/sys/net/mptcp/enabled" sysctl is on. NetworkManager does not change the sysctl and this is up to the administrator or distribution. To configure endpoints even if the sysctl is disabled, "also-without-sysctl" (0x4) flag can be used. In that case, NetworkManager doesn't look at the sysctl and configures endpoints regardless. Even when enabled, NetworkManager will only configure MPTCP endpoints for a certain address family, if there is a unicast default route (0.0.0.0/0 or ::/0) in the main routing table. The flag "also-without-default-route" (0x8) can override that. When MPTCP handling is enabled then endpoints are configured with the specified address flags "signal" (0x10), "subflow" (0x20), "backup" (0x40), "fullmesh" (0x80), "laminar" (0x100). See ip-mptcp(8) manual for additional information about the flags. If the flags are zero (0x0), the global connection default from NetworkManager.conf is honored. If still unspecified, the fallback is "enabled,subflow". Note that this means that MPTCP is by default done depending on the "/proc/sys/net/mptcp/enabled" sysctl. NetworkManager does not change the MPTCP limits nor enable MPTCP via "/proc/sys/net/mptcp/enabled". That is a host configuration which the admin can change via sysctl and ip-mptcp. Strict reverse path filtering (rp_filter) breaks many MPTCP use cases, so when MPTCP handling for IPv4 addresses on the interface is enabled, NetworkManager would loosen the strict reverse path filtering (1) to the loose setting (2).
kk: MPTCP соңғы нүктелерін және адрес жалаушаларын баптау керек пе. Егер NetworkManager ішінде MPTCP іске қосылған болса, ол интерфейс адрестерін MPTCP соңғы нүктелері ретінде баптайды. Ескеріңіз, IPv4 loopback адрестері (127.0.0.0/8), IPv4 link local адрестері (169.254.0.0/16), IPv6 loopback адресі (::1), IPv6 link local адрестері (fe80::/10), IPv6 бірегей жергілікті адрестері (ULA, fc00::/7) және IPv6 жекелік кеңейту адрестері (rfc3041, ipv6.ip6-privacy) соңғы нүктелер ретінде бапталудан шығарылады. Егер "disabled" (0x1) болса, интерфейс үшін MPTCP өңдеу сөндіріледі және ешқандай соңғы нүкте тіркелмейді. "enabled" (0x2) жалаушасы MPTCP өңдеу іске қосылғанын білдіреді. Бұл жалауша басқа жалаушалардың болуынан да түсінілуі мүмкін. Тіпті іске қосылған кезде де, MPTCP өңдеу "/proc/sys/net/mptcp/enabled" sysctl қосулы болмаса, әдепкі бойынша сөндірулі болады. NetworkManager sysctl-ді өзгертпейді және бұл әкімшіге немесе дистрибутивке байланысты. sysctl сөндірулі болса да соңғы нүктелерді баптау үшін "also-without-sysctl" (0x4) жалаушасын қолдануға болады. Ол жағдайда, NetworkManager sysctl-ге қарамайды және соңғы нүктелерді бәрібір баптайды. Тіпті іске қосылған кезде де, NetworkManager негізгі бағдарлау кестесінде unicast әдепкі бағдары (0.0.0.0/0 немесе ::/0) болса ғана белгілі бір адрес тобы үшін MPTCP соңғы нүктелерін баптайды. "also-without-default-route" (0x8) жалаушасы бұған қайшы келуі мүмкін. MPTCP өңдеу іске қосылған кезде, соңғы нүктелер көрсетілген адрес жалаушаларымен бапталады: "signal" (0x10), "subflow" (0x20), "backup" (0x40), "fullmesh" (0x80), "laminar" (0x100). Жалаушалар туралы қосымша ақпарат алу үшін ip-mptcp(8) нұсқаулығын қараңыз. Егер жалаушалар нөл (0x0) болса, NetworkManager.conf ішіндегі глобалды қосылым әдепкісі ескеріледі. Егер әлі көрсетілмесе, резервтік нұсқа "enabled,subflow" болады. Ескеріңіз, бұл MPTCP әдепкі бойынша "/proc/sys/net/mptcp/enabled" sysctl-ге байланысты орындалатынын білдіреді. NetworkManager MPTCP шектеулерін өзгертпейді және MPTCP-ді "/proc/sys/net/mptcp/enabled" арқылы іске қоспайды. Бұл хост конфигурациясы, оны әкімші sysctl және ip-mptcp арқылы өзгерте алады. Қатаң кері жол сүзгілеуі (rp_filter) көптеген MPTCP қолдану жағдайларын бұзады, сондықтан интерфейстегі IPv4 адрестері үшін MPTCP өңдеу іске қосылған кезде, NetworkManager қатаң кері жол сүзгілеуін (1) бос баптауға (2) жеңілдетеді.

source: If configured, set to a Manufacturer Usage Description (MUD) URL that points to manufacturer-recommended network policies for IoT devices. It is transmitted as a DHCPv4 or DHCPv6 option. The value must be a valid URL starting with "https://". The special value "none" is allowed to indicate that no MUD URL is used. If the per-profile value is unspecified (the default), a global connection default gets consulted. If still unspecified, the ultimate default is "none".
kk: Бапталған болса, IoT құрылғылары үшін өндіруші ұсынған желілік саясаттарға сілтейтін Manufacturer Usage Description (MUD) URL мекенжайына орнатыңыз. Ол DHCPv4 немесе DHCPv6 опциясы ретінде беріледі. Мән "https://" деп басталатын жарамды URL болуы керек. Ешқандай MUD URL қолданылмайтынын көрсету үшін "none" арнайы мәніне рұқсат етіледі. Егер профиль бойынша мән көрсетілмесе (әдепкі), глобалды қосылым әдепкісі қаралады. Егер әлі көрсетілмесе, түпкілікті әдепкі мән "none" болады.

source: Specifies whether the profile can be active multiple times at a particular moment. The value is of type NMConnectionMultiConnect.
kk: Профиль белгілі бір сәтте бірнеше рет белсенді бола ала ма, соны көрсетеді. Мән NMConnectionMultiConnect түрінде.

source: An array of strings defining what access a given user has to this connection. If this is NULL or empty, all users are allowed to access this connection; otherwise users are allowed if and only if they are in this list. When this is not empty, the connection can be active only when one of the specified users is logged into an active session. Each entry is of the form "[type]:[id]:[reserved]"; for example, "user:dcbw:blah". At this time only the "user" [type] is allowed. Any other values are ignored and reserved for future use. [id] is the username that this permission refers to, which may not contain the ":" character. Any [reserved] information present must be ignored and is reserved for future use. All of [type], [id], and [reserved] must be valid UTF-8.
kk: Берілген пайдаланушының осы қосылымға қандай қолжетімділігі бар екенін анықтайтын жолдар массиві. Егер бұл NULL немесе бос болса, барлық пайдаланушыларға осы қосылымға қол жеткізуге рұқсат етіледі; әйтпесе пайдаланушыларға тек олар осы тізімде болса ғана рұқсат етіледі. Бұл бос болмаған кезде, қосылым көрсетілген пайдаланушылардың біреуі белсенді сессияға кіргенде ғана белсенді бола алады. Әр жазба "[түрі]:[id]:[резервтелген]" пішімінде болады; мысалы, "user:dcbw:blah". Қазіргі уақытта тек "user" [түрі] рұқсат етілген. Кез келген басқа мәндер еленбейді және болашақта қолдану үшін резервтелген. [id] — бұл рұқсат қатысты болатын пайдаланушы аты, оның құрамында ":" таңбасы болмауы мүмкін. Бар болған кез келген [резервтелген] ақпарат еленбеуі керек және болашақта қолдану үшін резервтелген. [түрі], [id] және [резервтелген] барлығы жарамды UTF-8 болуы керек.

source: Setting name of the device type of this port's controller connection (eg, "bond"), or NULL if this connection is not a port.
kk: Осы порттың контроллер қосылымының құрылғы түрінің баптау аты (мысалы, "bond") немесе егер бұл қосылым порт болмаса NULL.

source: This property is deprecated and has no meaning.
kk: Бұл қасиет ескірген және мағынасы жоқ.

source: List of connection UUIDs that should be activated when the base connection itself is activated. Currently, only VPN connections are supported.
kk: Негізгі қосылым белсендірілген кезде белсендірілуі керек қосылым UUID тізімі. Қазіргі уақытта тек VPN қосылымдарына қолдау көрсетіледі.

source: Setting name of the device type of this port's controller connection (eg, "bond"), or NULL if this connection is not a port. Deprecated 1.46. Use "port-type" instead, this is just an alias.
kk: Осы порттың контроллер қосылымының құрылғы түрінің баптау аты (мысалы, "bond") немесе егер бұл қосылым порт болмаса NULL. 1.46 нұсқасында ескірген. Орнына "port-type" қолданыңыз, бұл жай ғана бүркеншік ат.
