Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: This represents the identity of the connection used for various purposes. It allows configuring multiple profiles to share the identity. Also, the stable-id can contain placeholders that are substituted dynamically and deterministically depending on the context. The stable-id is used for generating IPv6 stable private addresses with ipv6.addr-gen-mode=stable-privacy. It is also used to seed the generated cloned MAC address for ethernet.cloned-mac-address=stable and wifi.cloned-mac-address=stable. It is also used to derive the DHCP client identifier with ipv4.dhcp-client-id=stable, the DHCPv6 DUID with ipv6.dhcp-duid=stable-[llt,ll,uuid] and the DHCP IAID with ipv4.iaid=stable and ipv6.iaid=stable. Note that depending on the context where it is used, other parameters are also seeded into the generation algorithm. For example, a per-host key is commonly also included, so that different systems end up generating different IDs. Or with ipv6.addr-gen-mode=stable-privacy, also the device's name is included, so that different interfaces yield different addresses. The per-host key is the identity of your machine and stored in /var/lib/NetworkManager/secret_key. See NetworkManager(8) manual about the secret-key and the host identity. The '$' character is treated special to perform dynamic substitutions at activation time. Currently, supported are "${CONNECTION}", "${DEVICE}", "${MAC}", "${NETWORK_SSID}", "${BOOT}", "${RANDOM}". These effectively create unique IDs per-connection, per-device, per-SSID, per-boot, or every time. The "${CONNECTION}" uses the profile's connection.uuid, the "${DEVICE}" uses the interface name of the device and "${MAC}" the permanent MAC address of the device. "${NETWORK_SSID}" uses the SSID for Wi-Fi networks and falls back to "${CONNECTION}" on other networks. Any unrecognized patterns following '$' are treated verbatim, however are reserved for future use. You are thus advised to avoid '$' or escape it as "$$". For example, set it to "${CONNECTION}-${BOOT}-${DEVICE}" to create a unique id for this connection that changes with every reboot and differs depending on the interface where the profile activates. If the value is unset, a global connection default is consulted. If the value is still unset, the default is "default${CONNECTION}" go generate an ID unique per connection profile.
kk: Бұл әртүрлі мақсаттар үшін қолданылатын қосылым сәйкестілігін білдіреді. Ол сәйкестілікті бөлісу үшін бірнеше профильдерді баптауға мүмкіндік береді. Сонымен қатар, stable-id контекстке байланысты динамикалық және детерминистік түрде алмастырылатын толтырғыштарды қамтуы мүмкін. stable-id ipv6.addr-gen-mode=stable-privacy көмегімен IPv6 тұрақты жеке адрестерін жасау үшін қолданылады. Ол сондай-ақ ethernet.cloned-mac-address=stable және wifi.cloned-mac-address=stable үшін жасалған клондалған MAC адресін бастау үшін қолданылады. Ол сондай-ақ ipv4.dhcp-client-id=stable көмегімен DHCP клиент идентификаторын, ipv6.dhcp-duid=stable-[llt,ll,uuid] көмегімен DHCPv6 DUID және ipv4.iaid=stable және ipv6.iaid=stable көмегімен DHCP IAID алу үшін қолданылады. Ескеріңіз, ол қолданылатын контекстке байланысты, жасау алгоритміне басқа параметрлер де енгізіледі. Мысалы, әр хост кілті жиі қосылады, осылайша әртүрлі жүйелер әртүрлі ID-лер жасайды. Немесе ipv6.addr-gen-mode=stable-privacy көмегімен құрылғының аты да қосылады, осылайша әртүрлі интерфейстер әртүрлі адрестер береді. Әр хост кілті — бұл сіздің машинаңыздың сәйкестілігі және /var/lib/NetworkManager/secret_key ішінде сақталады. Құпия кілт және хост сәйкестілігі туралы NetworkManager(8) нұсқаулығын қараңыз. '$' таңбасы белсендіру кезінде динамикалық алмастыруларды орындау үшін арнайы өңделеді. Қазіргі уақытта қолдау көрсетілетіндер: "${CONNECTION}", "${DEVICE}", "${MAC}", "${NETWORK_SSID}", "${BOOT}", "${RANDOM}". Бұлар тиімді түрде әр байланысқа, әр құрылғыға, әр SSID-ге, әр жүктеуге немесе әр жолы бірегей ID-лер жасайды. "${CONNECTION}" профильдің connection.uuid қолданады, "${DEVICE}" құрылғының интерфейс атын қолданады және "${MAC}" құрылғының тұрақты MAC адресін қолданады. "${NETWORK_SSID}" Wi-Fi желілері үшін SSID қолданады және басқа желілерде "${CONNECTION}"-ге ауысады. '$' белгісінен кейінгі кез келген танылмаған үлгілер сөзбе-сөз өңделеді, алайда олар болашақта қолдану үшін резервтелген. Сондықтан '$' таңбасынан аулақ болуға немесе оны "$$" ретінде экрандауға кеңес беріледі. Мысалы, әр қайта жүктеу кезінде өзгеретін және профиль белсендірілетін интерфейске байланысты ерекшеленетін осы қосылым үшін бірегей ID жасау үшін оны "${CONNECTION}-${BOOT}-${DEVICE}" етіп орнатыңыз. Егер мән орнатылмаған болса, глобалды қосылым әдепкісі қаралады. Егер мән әлі де орнатылмаған болса, әдепкі мән қосылым профиліне бірегей ID жасау үшін "default${CONNECTION}" болады.

source: The time, in seconds since the Unix Epoch, that the connection was last _successfully_ fully activated. NetworkManager updates the connection timestamp periodically when the connection is active to ensure that an active connection has the latest timestamp. The property is only meant for reading (changes to this property will not be preserved).
kk: Қосылым соңғы рет _сәтті_ толық белсендірілген Unix дәуірінен бастап секундпен өлшенетін уақыт. NetworkManager белсенді қосылымның ең соңғы уақыт белгісіне ие болуын қамтамасыз ету үшін қосылым белсенді болған кезде қосылым уақыт белгісін мерзімді түрде жаңартып отырады. Қасиет тек оқуға арналған (бұл қасиетке енгізілген өзгерістер сақталмайды).

source: Base type of the connection. For hardware-dependent connections, should contain the setting name of the hardware-type specific setting (ie, "802-3-ethernet" or "802-11-wireless" or "bluetooth", etc), and for non-hardware dependent connections like VPN or otherwise, should contain the setting name of that setting type (ie, "vpn" or "bridge", etc).
kk: Қосылымның негізгі түрі. Аппараттық құралға тәуелді қосылымдар үшін аппараттық құрал түріне тән баптаудың атын (яғни, "802-3-ethernet" немесе "802-11-wireless" немесе "bluetooth", т.б.) қамтуы керек, ал VPN немесе басқа аппараттық құралға тәуелді емес қосылымдар үшін сол баптау түрінің атын (яғни, "vpn" немесе "bridge", т.б.) қамтуы керек.

source: The connection.uuid is the real identifier of a profile. It cannot change and it must be unique. It is therefore often best to refer to a profile by UUID, for example with `nmcli connection up uuid $UUID`. The UUID cannot be changed, except in offline mode. In that case, the special values "new", "generate" and "" are allowed to generate a new random UUID.
kk: connection.uuid — бұл профильдің нақты идентификаторы. Ол өзгере алмайды және бірегей болуы керек. Сондықтан көбінесе профильге UUID бойынша сілтеме жасаған дұрыс, мысалы `nmcli connection up uuid $UUID` көмегімен. Офлайн режимді қоспағанда, UUID өзгертілмейді. Ол жағдайда, жаңа кездейсоқ UUID жасау үшін "new", "generate" және "" арнайы мәндеріне рұқсат етіледі.

source: Time in milliseconds to wait for connection to be considered activated. The wait will start after the pre-up dispatcher event. The value 0 means no wait time. The default value is -1, which currently has the same meaning as no wait time.
kk: Қосылым белсендірілді деп есептелуі үшін күту уақыты (миллисекундпен). Күту pre-up диспетчер оқиғасынан кейін басталады. 0 мәні күту уақыты жоқ дегенді білдіреді. Әдепкі мән -1, ол қазіргі уақытта күту уақыты жоқ деген мағынаны білдіреді.

source: Timeout in milliseconds to wait for device at startup. During boot, devices may take a while to be detected by the driver. This property will cause to delay NetworkManager-wait-online.service and nm-online to give the device a chance to appear. This works by waiting for the given timeout until a compatible device for the profile is available and managed. The value 0 means no wait time. The default value is -1, which currently has the same meaning as no wait time.
kk: Іске қосу кезінде құрылғыны күту уақыты (миллисекундпен). Жүктеу кезінде құрылғылардың драйвер арқылы анықталуына біраз уақыт кетуі мүмкін. Бұл қасиет құрылғының пайда болуына мүмкіндік беру үшін NetworkManager-wait-online.service және nm-online кідіруіне себеп болады. Бұл профиль үшін үйлесімді құрылғы қолжетімді және басқарылатын болғанша берілген күту уақытын күту арқылы жұмыс істейді. 0 мәні күту уақыты жоқ дегенді білдіреді. Әдепкі мән -1, ол қазіргі уақытта күту уақыты жоқ деген мағынаны білдіреді.

source: The trust level of a the connection. Free form case-insensitive string (for example "Home", "Work", "Public"). NULL or unspecified zone means the connection will be placed in the default zone as defined by the firewall. When updating this property on a currently activated connection, the change takes effect immediately.
kk: Қосылымның сенім деңгейі. Еркін пішінді регистрге сезімтал емес жол (мысалы "Home", "Work", "Public"). NULL немесе көрсетілмеген аймақ қосылым брандмауэрмен анықталған әдепкі аймаққа орналастырылатынын білдіреді. Қазіргі белсендірілген қосылымда осы қасиетті жаңарту кезінде, өзгеріс бірден күшіне енеді.

source: If given, specifies the parent interface name or parent connection UUID from which this 6LowPAN interface should be created.
kk: Берілген болса, осы 6LowPAN интерфейсі жасалуы керек негізгі интерфейс атын немесе негізгі қосылым UUID көрсетеді.

source: List of strings to be matched against the altSubjectName of the certificate presented by the authentication server. If the list is empty, no verification of the server certificate's altSubjectName is performed.
kk: Аутентификация сервері ұсынған сертификаттың altSubjectName өрісімен сәйкестендірілетін жолдар тізімі. Егер тізім бос болса, сервер сертификатының altSubjectName өрісі тексерілмейді.

source: Anonymous identity string for EAP authentication methods. Used as the unencrypted identity with EAP types that support different tunneled identity like EAP-TTLS.
kk: EAP аутентификация әдістері үшін анонимді сәйкестік жолы. EAP-TTLS сияқты әртүрлі туннельденген сәйкестікті қолдайтын EAP түрлерімен шифрланбаған сәйкестік ретінде қолданылады.

source: A timeout for the authentication. Zero means the global default; if the global default is not set, the authentication timeout is 25 seconds.
kk: Аутентификация үшін күту уақыты. Нөл глобалды әдепкі мәнді білдіреді; егер глобалды әдепкі мән орнатылмаған болса, аутентификация күту уақыты 25 секундты құрайды.

source: Contains the path to the CA certificate if used by the EAP method specified in the 802-1x.eap property. This property can be unset even if the EAP method supports CA certificates, but this allows man-in-the-middle attacks and is NOT recommended. Note that enabling 802-1x.system-ca-certs will override this setting to use the built-in path, if the built-in path is not a directory.
kk: Егер 802-1x.eap қасиетінде көрсетілген EAP әдісі қолданса, CA сертификатына жолды қамтиды. Бұл қасиет EAP әдісі CA сертификаттарын қолдаса да орнатылмауы мүмкін, бірақ бұл man-in-the-middle шабуылдарына жол береді және ұсынылмайды. Ескеріңіз, 802-1x.system-ca-certs іске қосу, егер кірістірілген жол бума болмаса, кірістірілген жолды қолдану үшін осы баптауды қайта жазады.

source: The password used to access the CA certificate stored in "ca-cert" property. Only makes sense if the certificate is stored on a PKCS#11 token that requires a login.
kk: "ca-cert" қасиетінде сақталған CA сертификатына қол жеткізу үшін қолданылатын пароль. Тек сертификат кіруді қажет ететін PKCS#11 токенінде сақталған жағдайда ғана мағынасы бар.

source: Flags indicating how to handle the "ca-cert-password" property.
kk: "ca-cert-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: UTF-8 encoded path to a directory containing PEM or DER formatted certificates to be added to the verification chain in addition to the certificate specified in the "ca-cert" property. If NMSetting8021x:system-ca-certs is enabled and the built-in CA path is an existing directory, then this setting is ignored.
kk: "ca-cert" қасиетінде көрсетілген сертификатқа қосымша тексеру тізбегіне қосылатын PEM немесе DER пішімделген сертификаттары бар бумаға UTF-8 кодталған жол. Егер NMSetting8021x:system-ca-certs іске қосылған болса және кірістірілген CA жолы бар бума болса, онда бұл баптау еленбейді.

source: Contains the path to the client certificate if used by the EAP method specified in the 802-1x.eap property.
kk: Егер 802-1x.eap қасиетінде көрсетілген EAP әдісі қолданса, клиенттік сертификатқа жолды қамтиды.

source: The password used to access the client certificate stored in "client-cert" property. Only makes sense if the certificate is stored on a PKCS#11 token that requires a login.
kk: "client-cert" қасиетінде сақталған клиенттік сертификатқа қол жеткізу үшін қолданылатын пароль. Тек сертификат кіруді қажет ететін PKCS#11 токенінде сақталған жағдайда ғана мағынасы бар.

source: Flags indicating how to handle the "client-cert-password" property.
kk: "client-cert-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Constraint for server domain name. If set, this list of FQDNs is used as a match requirement for dNSName element(s) of the certificate presented by the authentication server. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using the same comparison. Multiple valid FQDNs can be passed as a ";" delimited list.
kk: Сервер домен атауының шектеуі. Егер орнатылса, бұл FQDN тізімі аутентификация сервері ұсынған сертификаттың dNSName элемент(тер)і үшін сәйкестік талабы ретінде қолданылады. Егер сәйкес dNSName табылса, бұл шектеу орындалады. Егер dNSName мәндері жоқ болса, бұл шектеу сол салыстыру арқылы SubjectName CN-ге қарсы сәйкестендіріледі. Бірнеше жарамды FQDN-дерді ";" арқылы бөлінген тізім ретінде беруге болады.

source: Constraint for server domain name. If set, this FQDN is used as a suffix match requirement for dNSName element(s) of the certificate presented by the authentication server. If a matching dNSName is found, this constraint is met. If no dNSName values are present, this constraint is matched against SubjectName CN using same suffix match comparison. Since version 1.24, multiple valid FQDNs can be passed as a ";" delimited list.
kk: Сервер домен атауының шектеуі. Егер орнатылса, бұл FQDN аутентификация сервері ұсынған сертификаттың dNSName элемент(тер)і үшін суффикс сәйкестік талабы ретінде қолданылады. Егер сәйкес dNSName табылса, бұл шектеу орындалады. Егер dNSName мәндері жоқ болса, бұл шектеу бірдей суффикс сәйкестігін салыстыру арқылы SubjectName CN-ге қарсы сәйкестендіріледі. 1.24 нұсқасынан бастап, бірнеше жарамды FQDN-дерді ";" арқылы бөлінген тізім ретінде беруге болады.

source: The allowed EAP method to be used when authenticating to the network with 802.1x. Valid methods are: "leap", "md5", "tls", "peap", "ttls", "pwd", and "fast". Each method requires different configuration using the properties of this setting; refer to wpa_supplicant documentation for the allowed combinations.
kk: 802.1x көмегімен желіге аутентификациялау кезінде қолданылатын рұқсат етілген EAP әдісі. Жарамды әдістер: "leap", "md5", "tls", "peap", "ttls", "pwd" және "fast". Әр әдіс осы баптаудың қасиеттерін қолдана отырып, әртүрлі конфигурацияны қажет етеді; рұқсат етілген комбинациялар үшін wpa_supplicant құжаттамасын қараңыз.

source: Identity string for EAP authentication methods. Often the user's user or login name.
kk: EAP аутентификация әдістері үшін сәйкестік жолы. Көбінесе пайдаланушының пайдаланушы аты немесе логин аты.

source: Define openssl_ciphers for wpa_supplicant. Openssl sometimes moves ciphers among SECLEVELs, thus compiled-in default value in wpa_supplicant (as modified by some linux distributions) sometimes prevents to connect to old servers that do not support new protocols.
kk: wpa_supplicant үшін openssl_ciphers анықтаңыз. Openssl кейде SECLEVEL арасында шифрларды жылжытады, осылайша wpa_supplicant ішіндегі компиляцияланған әдепкі мән (кейбір Linux дистрибутивтерімен өзгертілгендей) кейде жаңа хаттамаларды қолдамайтын ескі серверлерге қосылуға кедергі келтіреді.

source: Whether the 802.1X authentication is optional. If TRUE, the activation will continue even after a timeout or an authentication failure. Setting the property to TRUE is currently allowed only for Ethernet connections. If set to FALSE, the activation can continue only after a successful authentication.
kk: 802.1X аутентификациясы міндетті емес пе. Егер TRUE болса, белсендіру күту уақытынан немесе аутентификация сәтсіздігінен кейін де жалғасады. Қасиетті TRUE мәніне орнатуға қазіргі уақытта тек Ethernet қосылымдары үшін рұқсат етіледі. Егер FALSE орнатылса, белсендіру тек сәтті аутентификациядан кейін ғана жалғаса алады.

source: UTF-8 encoded file path containing PAC for EAP-FAST.
kk: EAP-FAST үшін PAC қамтитын UTF-8 кодталған файл жолы.

source: UTF-8 encoded password used for EAP authentication methods. If both the "password" property and the "password-raw" property are specified, "password" is preferred.
kk: EAP аутентификация әдістері үшін қолданылатын UTF-8 кодталған пароль. Егер "password" қасиеті де, "password-raw" қасиеті де көрсетілсе, "password" артықшылыққа ие болады.

source: Flags indicating how to handle the "password" property.
kk: "password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Password used for EAP authentication methods, given as a byte array to allow passwords in other encodings than UTF-8 to be used. If both the "password" property and the "password-raw" property are specified, "password" is preferred.
kk: EAP аутентификация әдістері үшін қолданылатын, UTF-8-ден басқа кодтаулардағы парольдерді қолдануға мүмкіндік беретін байт массиві ретінде берілген пароль. Егер "password" қасиеті де, "password-raw" қасиеті де көрсетілсе, "password" артықшылыққа ие болады.

source: Flags indicating how to handle the "password-raw" property.
kk: "password-raw" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Specifies authentication flags to use in "phase 1" outer authentication using NMSetting8021xAuthFlags options. The individual TLS versions can be explicitly disabled. TLS time checks can be also disabled. If a certain TLS disable flag is not set, it is up to the supplicant to allow or forbid it. The TLS options map to tls_disable_tlsv1_x and tls_disable_time_checks settings. See the wpa_supplicant documentation for more details.
kk: NMSetting8021xAuthFlags опцияларын қолдана отырып, "1-кезең" сыртқы аутентификациясында қолданылатын аутентификация жалаушаларын көрсетеді. Жеке TLS нұсқаларын айқын түрде сөндіруге болады. TLS уақыт тексерістерін де сөндіруге болады. Егер белгілі бір TLS сөндіру жалаушасы орнатылмаған болса, оған рұқсат ету немесе тыйым салу суппликантқа байланысты. TLS опциялары tls_disable_tlsv1_x және tls_disable_time_checks баптауларына сәйкес келеді. Толығырақ ақпарат алу үшін wpa_supplicant құжаттамасын қараңыз.

source: Enables or disables in-line provisioning of EAP-FAST credentials when FAST is specified as the EAP method in the "eap" property. Recognized values are "0" (disabled), "1" (allow unauthenticated provisioning), "2" (allow authenticated provisioning), and "3" (allow both authenticated and unauthenticated provisioning). See the wpa_supplicant documentation for more details.
kk: "eap" қасиетінде EAP әдісі ретінде FAST көрсетілген кезде EAP-FAST тіркелгі деректерін желі ішінде қамтамасыз етуді іске қосады немесе сөндіреді. Танылған мәндер: "0" (сөндірулі), "1" (аутентификацияланбаған қамтамасыз етуге рұқсат ету), "2" (аутентификацияланған қамтамасыз етуге рұқсат ету) және "3" (аутентификацияланған және аутентификацияланбаған қамтамасыз етуге рұқсат ету). Толығырақ ақпарат алу үшін wpa_supplicant құжаттамасын қараңыз.

source: Forces use of the new PEAP label during key derivation. Some RADIUS servers may require forcing the new PEAP label to interoperate with PEAPv1. Set to "1" to force use of the new PEAP label. See the wpa_supplicant documentation for more details.
kk: Кілттерді туындату кезінде жаңа PEAP белгісін қолдануға мәжбүрлейді. Кейбір RADIUS серверлері PEAPv1-мен өзара әрекеттесу үшін жаңа PEAP белгісін мәжбүрлеуді қажет етуі мүмкін. Жаңа PEAP белгісін қолдануды мәжбүрлеу үшін "1" мәніне орнатыңыз. Толығырақ ақпарат алу үшін wpa_supplicant құжаттамасын қараңыз.

source: Forces which PEAP version is used when PEAP is set as the EAP method in the "eap" property. When unset, the version reported by the server will be used. Sometimes when using older RADIUS servers, it is necessary to force the client to use a particular PEAP version. To do so, this property may be set to "0" or "1" to force that specific PEAP version.
kk: "eap" қасиетінде EAP әдісі ретінде PEAP орнатылған кезде қай PEAP нұсқасы қолданылатынын мәжбүрлейді. Көрсетілмеген кезде сервер хабарлаған нұсқа қолданылады. Кейде ескі RADIUS серверлерін қолданғанда, клиентті белгілі бір PEAP нұсқасын қолдануға мәжбүрлеу қажет болады. Ол үшін бұл қасиет сол нақты PEAP нұсқасын мәжбүрлеу үшін "0" немесе "1" мәніне орнатылуы мүмкін.

source: List of strings to be matched against the altSubjectName of the certificate presented by the authentication server during the inner "phase 2" authentication. If the list is empty, no verification of the server certificate's altSubjectName is performed.
kk: Ішкі "2-кезең" аутентификациясы кезінде аутентификация сервері ұсынған сертификаттың altSubjectName өрісімен сәйкестендірілетін жолдар тізімі. Егер тізім бос болса, сервер сертификатының altSubjectName өрісі тексерілмейді.

source: Specifies the allowed "phase 2" inner authentication method when an EAP method that uses an inner TLS tunnel is specified in the "eap" property. For TTLS this property selects one of the supported non-EAP inner methods: "pap", "chap", "mschap", "mschapv2" while "phase2-autheap" selects an EAP inner method. For PEAP this selects an inner EAP method, one of: "gtc", "otp", "md5" and "tls". Each "phase 2" inner method requires specific parameters for successful authentication; see the wpa_supplicant documentation for more details. Both "phase2-auth" and "phase2-autheap" cannot be specified.
kk: "eap" қасиетінде ішкі TLS туннелін қолданатын EAP әдісі көрсетілген кезде рұқсат етілген "2-кезең" ішкі аутентификация әдісін көрсетеді. TTLS үшін бұл қасиет қолдау көрсетілетін EAP емес ішкі әдістердің бірін таңдайды: "pap", "chap", "mschap", "mschapv2", ал "phase2-autheap" EAP ішкі әдісін таңдайды. PEAP үшін бұл ішкі EAP әдісін таңдайды, мыналардың бірі: "gtc", "otp", "md5" және "tls". Әр "2-кезең" ішкі әдісі сәтті аутентификация үшін арнайы параметрлерді қажет етеді; толығырақ ақпарат алу үшін wpa_supplicant құжаттамасын қараңыз. "phase2-auth" және "phase2-autheap" екеуі де көрсетілуі мүмкін емес.

source: Specifies the allowed "phase 2" inner EAP-based authentication method when TTLS is specified in the "eap" property. Recognized EAP-based "phase 2" methods are "md5", "mschapv2", "otp", "gtc", and "tls". Each "phase 2" inner method requires specific parameters for successful authentication; see the wpa_supplicant documentation for more details.
kk: "eap" қасиетінде TTLS көрсетілген кезде рұқсат етілген "2-кезең" ішкі EAP негізіндегі аутентификация әдісін көрсетеді. Танылған EAP негізіндегі "2-кезең" әдістері: "md5", "mschapv2", "otp", "gtc" және "tls". Әр "2-кезең" ішкі әдісі сәтті аутентификация үшін арнайы параметрлерді қажет етеді; толығырақ ақпарат алу үшін wpa_supplicant құжаттамасын қараңыз.
