Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Shared DHCP range is not supported for IPv6
kk: Ортақ DHCP ауқымы үшін IPv6 қолдауы жоқ

source: Shared DHCP lease time is not supported for IPv6
kk: Ортақ DHCP жалға алу уақыты үшін IPv6 қолдауы жоқ

source: token is not in canonical form
kk: токен канондық пішімде емес

source: property should be TRUE when method is set to ignore or disabled
kk: әдіс елемеу немесе сөндірулі күйіне орнатылғанда қасиет TRUE болуы керек

source: ipv4 method "%s" is not supported for loopback
kk: loopback үшін ipv4 "%s" әдісіне қолдау жоқ

source: ipv4.link-local cannot be enabled for loopback
kk: loopback үшін ipv4.link-local іске қосу мүмкін емес

source: ipv6 method "%s" is not supported for loopback
kk: loopback үшін ipv6 "%s" әдісіне қолдау жоқ

source: a loopback profile cannot be a port
kk: loopback профилі порт бола алмайды

source: the key is empty
kk: кілт бос

source: the key must be %d characters
kk: кілтте %d таңба болуы керек

source: the key must have an even number of characters between 2 and 64
kk: кілтте 2 және 64 аралығындағы жұп санды таңбалар болуы керек

source: the key contains non-hexadecimal characters
kk: кілтте он алтылық емес таңбалар бар

source: EAP key management requires '%s' setting presence
kk: EAP кілттерін басқару '%s' баптауының болуын талап етеді

source: must be either psk (0) or eap (1)
kk: psk (0) немесе eap (1) болуы керек

source: only valid for psk mode
kk: тек psk режимі үшін жарамды

source: non promiscuous operation is allowed only in passthru mode
kk: promiscuous емес әрекетке тек passthru режимінде рұқсат етіледі

source: is empty
kk: бос

source: SSID length is out of range <1-32> bytes
kk: SSID ұзындығы <1-32> байт ауқымының сыртында

source: '%d' is not a valid channel
kk: '%d' — жарамды арна емес

source: A connection with a '%s' setting must not have a controller.
kk: '%s' баптауы бар қосылымда контроллер болмауы керек.

source: '%s' is not allowed in fail_mode
kk: fail_mode ішінде '%s' мәніне рұқсат жоқ

source: must be a power of two
kk: екінің дәрежесі болуы керек

source: key cannot start with "NM."
kk: кілт "NM." деп басталмауы керек

source: OVS %s can only be added to a profile of type OVS bridge/port/interface or to OVS system interface
kk: OVS %s тек OVS көпірі/порты/интерфейсі түріндегі профильге немесе OVS жүйелік интерфейсіне қосыла алады

source: invalid key "%s": %s
kk: жарамсыз кілт "%s": %s

source: maximum number of entries reached (%u instead of %u)
kk: жазбалардың максималды санына жетті (%u, %u орнына)

source: '%s' is not a valid interface type
kk: '%s' — жарамды интерфейс түрі емес

source: A connection with a '%s' setting needs connection.type explicitly set
kk: '%s' баптауы бар қосылымда connection.type анық орнатылуы керек

source: A connection of type '%s' cannot have ovs-interface.type "system"
kk: '%s' түріндегі қосылымда "system" мәнді ovs-interface.type бола алмайды

source: A connection of type '%s' cannot have an ovs-interface.type "%s"
kk: '%s' түріндегі қосылымда "%s" мәнді ovs-interface.type бола алмайды

source: A connection can not have both '%s' and '%s' settings at the same time
kk: Қосылымда бір уақытта '%s' және '%s' баптаулары бола алмайды

source: A connection with '%s' setting must be of connection.type "ovs-interface" but is "%s"
kk: '%s' баптауы бар қосылым connection.type "ovs-interface" болуы керек, бірақ ол — "%s"

source: A connection with '%s' setting needs to be of '%s' interface type, not '%s'
kk: '%s' баптауы бар қосылым '%s' интерфейс түрінде болуы керек, '%s' емес

source: A connection with ovs-interface.type '%s' setting a 'ovs-patch' setting
kk: ovs-interface.type '%s' қосылымы 'ovs-patch' баптауын орнатуда

source: Missing ovs interface setting
kk: OVS интерфейс баптауы жетіспейді

source: Missing ovs interface type
kk: OVS интерфейс түрі жетіспейді

source: A connection with a '%s' setting must have a controller.
kk: '%s' баптауы бар қосылымда контроллер болуы керек.

source: VLANs must be between 0 and 4095
kk: VLAN мәндері 0 және 4095 арасында болуы керек

source: duplicate VLAN %u
kk: қайталанатын VLAN %u

source: VLANs %u and %u are not sorted in ascending order
kk: %u және %u VLAN желілері өсу ретімен сұрыпталмаған

source: '%s' is not allowed in vlan_mode
kk: vlan_mode ішінде '%s' мәніне рұқсат жоқ

source: the tag id must be in range 0-4094 but is %u
kk: тег ID 0-4094 ауқымында болуы керек, бірақ ол — %u

source: '%s' is not allowed in lacp
kk: lacp ішінде '%s' мәніне рұқсат жоқ

source: '%s' is not allowed in bond_mode
kk: bond_mode ішінде '%s' мәніне рұқсат жоқ

source: '%d' is out of valid range <128-16384>
kk: '%d' — <128-16384> жарамды ауқымының сыртында

source: setting this property requires non-zero '%s' property
kk: бұл қасиетті орнату нөлдік емес '%s' қасиетін талап етеді

source: invalid proxy method
kk: жарамсыз прокси әдісі

source: this property is not allowed for method none
kk: бұл қасиетке none әдісі үшін рұқсат жоқ

source: the script is too large
kk: скрипт тым үлкен

source: the script is not valid utf8
kk: скрипт жарамды utf8 емес

source: the script lacks FindProxyForURL function
kk: скриптте FindProxyForURL функциясы жоқ

source: '%s' is not a valid MAC address
kk: '%s' — жарамды MAC адресі емес

source: VF with index %u, but the total number of VFs is %u
kk: %u индексті VF, бірақ VF-тердің жалпы саны — %u

source: invalid VF %u: %s
kk: жарамсыз VF %u: %s

source: duplicate VF index %u
kk: қайталанатын VF индексі %u

source: VFs %d and %d are not sorted by ascending index
kk: %d және %d VF-тері өсу индексі бойынша сұрыпталмаған

source: kind is missing
kk: түрі жетіспейді

source: '%s' is not a valid kind
kk: '%s' — жарамды түр емес

source: parent handle missing
kk: аталық хендл жетіспейді

source: there are duplicate TC qdiscs
kk: қайталанатын TC qdisc-тері бар

source: there are duplicate TC filters
kk: қайталанатын TC сүзгілері бар

source: %s is out of range [0, %d]
kk: %s мәні [0, %d] ауқымының сыртында

source: Missing target-host in nsna_ping link watcher
kk: nsna_ping қосылым бақылаушысында target-host жетіспейді

source: target-host '%s' contains invalid characters
kk: target-host '%s' ішінде жарамсыз таңбалар бар

source: Missing %s in arp_ping link watcher
kk: arp_ping қосылым бақылаушысында %s жетіспейді

source: source-host '%s' contains invalid characters
kk: source-host '%s' ішінде жарамсыз таңбалар бар

source: vlanid is out of range [-1, 4094]
kk: vlanid мәні [-1, 4094] ауқымының сыртында

source: '%u': invalid mode
kk: '%u': жарамсыз режим

source: '%s': invalid user ID
kk: '%s': жарамсыз пайдаланушы ID

source: '%s': invalid group ID
kk: '%s': жарамсыз топ ID

source: key requires a '.' for a namespace
kk: кілт атаулар кеңістігі үшін '.' талап етеді

source: key cannot contain ".."
kk: кілтте ".." болмауы керек

source: maximum number of user data entries reached
kk: пайдаланушы деректер жазбаларының максималды санына жетті

source: maximum number of user data entries reached (%u instead of %u)
kk: пайдаланушы деректер жазбаларының максималды санына жетті (%u, %u орнына)

source: the vlan id must be in range 0-4094 but is %u
kk: vlan id 0-4094 ауқымында болуы керек, бірақ ол — %u

source: flags are invalid
kk: жалаушалар жарамсыз

source: invalid VLAN protocol %s: must be '802.1Q' or '802.1ad'
kk: жарамсыз VLAN хаттамасы %s: '802.1Q' немесе '802.1ad' болуы керек

source: vlan setting should have a ethernet setting as well
kk: vlan баптауында ethernet баптауы да болуы керек

source: cannot set connection.multi-connect for VPN setting
kk: VPN баптауы үшін connection.multi-connect орнату мүмкін емес

source: setting contained a secret with an empty name
kk: баптауда аты бос құпия кілт болды

source: not a secret property
kk: құпия қасиет емес

source: secret is not of correct type
kk: құпия кілт дұрыс түрде емес

source: secret name cannot be empty
kk: құпия кілт аты бос болмауы керек

source: secret flags property not found
kk: құпия жалаушалар қасиеті табылмады

source: table cannot be zero
kk: кесте нөл бола алмайды

source: '%s' is not a valid IP%s address
kk: '%s' — жарамды IP%s адресі емес

source: %d is greater than local port max %d
kk: %d жергілікті порттың максималды %d мәнінен үлкен

source: '%s' is not a valid Ethernet port value
kk: '%s' — жарамды Ethernet портының мәні емес

source: '%s' is not a valid duplex value
kk: '%s' — жарамды дуплекс мәні емес

source: invalid key '%s'
kk: жарамсыз кілт '%s'

source: invalid value for key '%s'
kk: '%s' кілті үшін жарамсыз мән

source: Wake-on-LAN mode 'default' and 'ignore' are exclusive flags
kk: Wake-on-LAN режимінің 'default' және 'ignore' жалаушалары бір-бірін жоққа шығарады

source: Wake-on-LAN password can only be used with magic packet mode
kk: Wake-on-LAN паролін тек magic packet режимімен пайдалануға болады

source: both speed and duplex should have a valid value or both should be unset
kk: жылдамдық пен дуплекс екеуінің де жарамды мәні болуы керек немесе екеуі де орнатылмауы керек

source: both speed and duplex are required for static link configuration
kk: статикалық қосылым конфигурациясы үшін жылдамдық пен дуплекс талап етіледі

source: missing public-key for peer
kk: торап үшін ашық кілт (public-key) жетіспейді

source: invalid public-key for peer
kk: торап үшін ашық кілт (public-key) жарамсыз

source: invalid preshared-key for peer
kk: торап үшін алдын ала бөлісілген кілт (preshared-key) жарамсыз

source: invalid endpoint for peer
kk: торап үшін соңғы нүкте (endpoint) жарамсыз

source: invalid IP address "%s" for allowed-ip of peer
kk: тораптың allowed-ip үшін "%s" IP адресі жарамсыз

source: invalid preshared-key-flags for peer
kk: торап үшін preshared-key-flags жарамсыз

source: peer #%u has no public-key
kk: #%u торабында ашық кілт (public-key) жоқ

source: peer #%u has invalid public-key
kk: #%u торабында ашық кілт (public-key) жарамсыз

source: peer #%u has invalid endpoint
kk: #%u торабында соңғы нүкте (endpoint) жарамсыз

source: peer #%u has invalid allowed-ips setting
kk: #%u торабында allowed-ips баптауы жарамсыз

source: peer #%u is invalid: %s
kk: #%u торабы жарамсыз: %s

source: method "%s" is not supported for WireGuard
kk: "%s" әдісі WireGuard үшін қолдау көрсетілмейді

source: key must be 32 bytes base64 encoded
kk: кілт 32 байттық base64 кодталған болуы керек

source: invalid peer secrets
kk: торап құпия кілттері жарамсыз

source: peer #%u lacks public-key
kk: #%u торабында ашық кілт (public-key) жоқ

source: non-existing peer '%s'
kk: жоқ '%s' торабы

source: '%s' is not a valid value for '%s' mode connections
kk: '%s' — '%s' режиміндегі қосылымдар үшін жарамды мән емес

source: '%s' security requires '%s=%s'
kk: '%s' қауіпсіздігі '%s=%s' талап етеді

source: '%s' security requires '%s' setting presence
kk: '%s' қауіпсіздігі '%s' баптауының болуын талап етеді

source: '%s' can only be used with '%s=%s' (WEP)
kk: '%s' тек '%s=%s' (WEP) арқылы пайдаланылуы мүмкін

source: '%s' can only be used with 'owe', 'wpa-psk', 'sae', 'wpa-eap' or 'wpa-eap-suite-b-192' key management
kk: '%s' тек 'owe', 'wpa-psk', 'sae', 'wpa-eap' немесе 'wpa-eap-suite-b-192' кілтті басқару әдістерімен пайдаланылуы мүмкін

source: pmf can only be 'default' or 'required' when using 'owe', 'sae' or 'wpa-eap-suite-b-192' key management
kk: 'owe', 'sae' немесе 'wpa-eap-suite-b-192' кілтті басқару әдістерін пайдаланғанда pmf тек 'default' немесе 'required' бола алады

source: '%s' is not a valid Wi-Fi mode
kk: '%s' — жарамды Wi-Fi режимі емес

source: '%s' is not a valid band
kk: '%s' — жарамды диапазоны емес

source: '%s' requires setting '%s' property
kk: '%s' қасиеті '%s' қасиетін орнатуды талап етеді

source: '%s' requires '%s' and '%s' property
kk: '%s' қасиеті '%s' және '%s' қасиетін талап етеді

source: invalid value
kk: жарамсыз мән

source: Wake-on-WLAN mode 'default' and 'ignore' are exclusive flags
kk: Wake-on-WLAN режимінің 'default' және 'ignore' жалаушалары бір-бірін жоққа шығарады

source: Wake-on-WLAN trying to set unknown flag
kk: Wake-on-WLAN белгісіз жалаушаны орнатуға тырысуда

source: AP isolation can be set only in AP mode
kk: AP оқшаулауын тек AP режимінде орнатуға болады

source: a specific channel width can be set only in AP mode
kk: арнайы арна енін тек AP режимінде орнатуға болады

source: a specific channel width can be set only together with a fixed channel
kk: арнайы арна енін тек бекітілген арнамен бірге орнатуға болады

source: 80MHz channels are only supported in the 5GHz and 6GHz bands
kk: 80МГц арналарына тек 5ГГц және 6ГГц диапазондарында қолдау көрсетіледі

source: conflicting value of mac-address-randomization and cloned-mac-address
kk: mac-address-randomization және cloned-mac-address мәндерінің қайшылығы

source: property is deprecated and not implemented
kk: қасиет ескірген және іске асырылмаған

source: page must be defined along with a channel
kk: парақ арнамен бірге анықталуы керек

source: page must be between %d and %d
kk: парақ %d және %d арасында болуы керек

source: channel must not be between %d and %d
kk: арна %d және %d арасында болмауы керек

source: can't set property of type '%s' from value of type '%s'
kk: '%s' түріндегі қасиетті '%s' түріндегі мәннен орнату мүмкін емес

source: value of type '%s' is invalid or out of range for property '%s'
kk: '%s' түріндегі мән жарамсыз немесе '%s' қасиетінің ауқымынан тыс

source: can not set property: %s
kk: қасиетті орнату мүмкін емес: %s

source: duplicate property
kk: қайталанатын қасиет

source: unknown property
kk: белгісіз қасиет

source: failed to set property: %s
kk: қасиетті орнату сәтсіз аяқталды: %s

source: invalid value %d, expected %d-%d
kk: жарамсыз мән %d, күтілгені %d-%d

source: cannot be empty
kk: бос болмауы керек

source: secret not found
kk: құпия кілт табылмады

source: invalid D-Bus property "%s"
kk: жарамсыз D-Bus қасиеті "%s"

source: duplicate D-Bus property "%s"
kk: қайталанатын D-Bus қасиеті "%s"

source: invalid D-Bus property "%s" for "%s"
kk: "%s" үшін жарамсыз D-Bus қасиеті "%s"

source: unknown link-watcher name "%s"
kk: белгісіз қосылым бақылаушысының аты "%s"

source: value out of range
kk: мән ауқымнан тыс

source: invalid runner-tx-hash
kk: жарамсыз runner-tx-hash

source: %s is only allowed for runner %s
kk: %s тек %s раннері үшін рұқсат етілген

source: %s is only allowed for runners %s
kk: %s тек %s раннерлері үшін рұқсат етілген

source: cannot set parameters for lacp and activebackup runners together
kk: lacp және activebackup раннерлері үшін параметрлерді бірге орнату мүмкін емес

source: missing link watcher
kk: қосылым бақылаушысы жетіспейді

source: team config exceeds size limit
kk: team конфигурациясы өлшем шегінен асып кетті

source: team config is not valid UTF-8
kk: team конфигурациясы жарамды UTF-8 емес

source: invalid D-Bus type "%s"
kk: жарамсыз D-Bus түрі "%s"

source: invalid link-watchers: %s
kk: жарамсыз қосылым бақылаушылары: %s

source: Expected value of type "au"
kk: "au" түріндегі мән күтілді

source: Expected value of type "aau"
kk: "aau" түріндегі мән күтілді

source: Expected "address-labels" of type "as"
kk: "as" түріндегі "address-labels" күтілді

source: Incomplete IPv4 address (idx=%u)
kk: Толық емес IPv4 адресі (idx=%u)

source: Incomplete IPv4 route (idx=%u)
kk: Толық емес IPv4 бағдары (idx=%u)

source: Expected value of type "aay"
kk: "aay" түріндегі мән күтілді

source: Invalid IPv6 DNS address length (idx=%u)
kk: IPv6 DNS адресінің ұзындығы жарамсыз (idx=%u)

source: Expected value of type "a(ayuay)"
kk: "a(ayuay)" түріндегі мән күтілді

source: Expected value of type "(ayuay)" (idx=%u)
kk: "(ayuay)" түріндегі мән күтілді (idx=%u)

source: IPv6 address with invalid length (idx=%u)
kk: Ұзындығы жарамсыз IPv6 адресі (idx=%u)

source: IPv6 gateway with invalid length (idx=%u)
kk: Ұзындығы жарамсыз IPv6 шлюзі (idx=%u)

source: Expected value of type "a(ayuayu)"
kk: "a(ayuayu)" түріндегі мән күтілді

source: Expected value of type "(ayuayu)" (idx=%u)
kk: "(ayuayu)" түріндегі мән күтілді (idx=%u)

source: IPv6 dest address with invalid length (idx=%u)
kk: Ұзындығы жарамсыз IPv6 мақсатты адресі (idx=%u)

source: IPv6 next-hop address with invalid length (idx=%u)
kk: Ұзындығы жарамсыз IPv6 келесі секіріс адресі (idx=%u)

source: Expected value of type "aa{sv}"
kk: "aa{sv}" түріндегі мән күтілді

source: IP address requires fields "address" and "prefix" (idx=%u)
kk: IP адресі "address" және "prefix" өрістерін талап етеді (idx=%u)

source: Route requires fields "dest" and "prefix" (idx=%u)
kk: Бағдар "dest" және "prefix" өрістерін талап етеді (idx=%u)

source: '%s' is not a valid handle.
kk: '%s' — жарамды хендл емес.

source: '%s' unexpected: parent already specified.
kk: '%s' күтілмеген: аталық элемент қазірдің өзінде көрсетілген.

source: invalid handle: '%s'
kk: жарамсыз хендл: '%s'

source: parent not specified.
kk: аталық элемент көрсетілмеген.

source: unsupported qdisc option: '%s'.
kk: қолдау көрсетілмейтін qdisc опциясы: '%s'.

source: action name missing.
kk: әрекет атауы жетіспейді.

source: unsupported action option: '%s'.
kk: қолдау көрсетілмейтін әрекет опциясы: '%s'.

source: invalid action:
kk: жарамсыз әрекет:

source: unsupported tfilter option: '%s'.
kk: қолдау көрсетілмейтін tfilter опциясы: '%s'.

source: failed stat file %s: %s
kk: %s stat файлы сәтсіз аяқталды: %s

source: not a file (%s)
kk: файл емес (%s)

source: invalid file owner %d for %s
kk: %d файл иесі жарамсыз (%s үшін)

source: file permissions for %s
kk: %s үшін файл рұқсаттары

source: reject %s
kk: %s қайтару

source: path is not absolute (%s)
kk: жол абсолютті емес (%s)

source: Plugin file does not exist (%s)
kk: Плагин файлы жоқ (%s)

source: Plugin is not a valid file (%s)
kk: Плагин жарамды файл емес (%s)

source: libtool archives are not supported (%s)
kk: libtool архивтеріне қолдау көрсетілмейді (%s)

source: Could not find "%s" binary
kk: "%s" бинарлық файлы табылмады

source: unknown secret flags
kk: белгісіз құпия жалаушалар

source: conflicting secret flags
kk: қайшы келетін құпия жалаушалар

source: secret flags must not be "not-required"
kk: құпия жалаушалар "not-required" болмауы керек

source: unsupported secret flags
kk: қолдау көрсетілмейтін құпия жалаушалар

source: can't be simultaneously disabled and enabled
kk: бір уақытта сөндірілген және іске қосылған болуы мүмкін емес

source: WPS is required
kk: WPS талап етіледі

source: not a valid ethernet MAC address for mask at position %lld
kk: %lld орнындағы маска үшін жарамды ethernet MAC адресі емес

source: not a valid ethernet MAC address #%u at position %lld
kk: #%u (%lld орнындағы) жарамды ethernet MAC адресі емес

source: not valid utf-8
kk: жарамды utf-8 емес

source: is not a JSON object
kk: JSON объекті емес

source: value is NULL
kk: мән — NULL

source: value is empty
kk: мән бос

source: invalid JSON at position %d (%s)
kk: %d орнында жарамсыз JSON (%s)

source: unterminated escape sequence
kk: аяқталмаған escape тізбегі

source: unknown attribute '%s'
kk: белгісіз атрибут '%s'

source: missing key-value separator '%c' after '%s'
kk: кілт-мән ажыратқышы '%c' ('%s' кейін) жетіспейді

source: invalid uint32 value '%s' for attribute '%s'
kk: '%s' атрибуты үшін жарамсыз uint32 мәні '%s'

source: invalid int32 value '%s' for attribute '%s'
kk: '%s' атрибуты үшін жарамсыз int32 мәні '%s'

source: invalid uint64 value '%s' for attribute '%s'
kk: '%s' атрибуты үшін жарамсыз uint64 мәні '%s'

source: invalid uint8 value '%s' for attribute '%s'
kk: '%s' атрибуты үшін жарамсыз uint8 мәні '%s'

source: invalid boolean value '%s' for attribute '%s'
kk: '%s' атрибуты үшін жарамсыз логикалық мән '%s'

source: unsupported attribute '%s' of type '%s'
kk: '%s' түріндегі қолдау көрсетілмейтін атрибут '%s'

source: Bridge VLANs %d and %d are not sorted by ascending vid
kk: Көпір VLAN %d және %d vid өсуі бойынша сұрыпталмаған

source: duplicate bridge VLAN vid %u
kk: қайталанатын көпір VLAN vid %u

source: only one VLAN can be the PVID
kk: тек бір VLAN PVID бола алады

source: unknown flags 0x%x
kk: белгісіз жалаушалар 0x%x

source: 'fqdn-no-update' and 'fqdn-serv-update' flags cannot be set at the same time
kk: 'fqdn-no-update' және 'fqdn-serv-update' жалаушаларын бір уақытта орнату мүмкін емес

source: 'fqdn-clear-flags' flag is incompatible with other FQDN flags
kk: 'fqdn-clear-flags' жалаушасы басқа FQDN жалаушаларымен үйлесімсіз

source: DHCPv6 does not support the E (encoded) FQDN flag
kk: DHCPv6 E (кодталған) FQDN жалаушасына қолдау көрсетпейді

source: This function needs to be called by root
kk: Бұл функцияны root шақыруы керек

source: Failure creating the temporary file
kk: Уақытша файлды жасау қатесі

source: cannot load plugin "%s": %s
kk: "%s" плагинін жүктеу мүмкін емес: %s

source: failed to load nm_vpn_editor_plugin_factory() from %s (%s)
kk: nm_vpn_editor_plugin_factory() %s ішінен жүктеу сәтсіз аяқталды (%s)

source: unknown error initializing plugin %s
kk: %s плагинін инициализациялау кезінде белгісіз қате

source: cannot load VPN plugin in '%s': missing plugin name
kk: '%s' ішінде VPN плагинін жүктеу мүмкін емес: плагин аты жетіспейді

source: cannot load VPN plugin in '%s': invalid service name
kk: '%s' ішінде VPN плагинін жүктеу мүмкін емес: қызмет аты жарамсыз

source: the plugin does not support import capability
kk: плагин импорттау мүмкіндігіне қолдау көрсетпейді

source: the plugin does not support export capability
kk: плагин экспорттау мүмкіндігіне қолдау көрсетпейді

source: missing filename
kk: файл аты жетіспейді

source: filename must be an absolute path (%s)
kk: файл аты абсолюттік жол болуы керек (%s)

source: filename has invalid format (%s)
kk: файл атының пішімі жарамсыз (%s)

source: there exists a conflicting plugin (%s) that has the same %s.%s value
kk: бірдей %s.%s мәні бар қайшы келетін плагин (%s) бар

source: there exists a conflicting plugin with the same name (%s)
kk: бірдей аты бар қайшы келетін плагин (%s) бар

source: missing "plugin" setting
kk: "plugin" баптауы жетіспейді

source: %s: don't retry loading plugin which already failed previously
kk: %s: алдында сәтсіз аяқталған плагинді қайта жүктеуге тырыспаңыз

source: missing filename to load VPN plugin info
kk: VPN плагині ақпаратын жүктеу үшін файл аты жетіспейді

source: missing name for VPN plugin info
kk: VPN плагині ақпараты үшін атау жетіспейді

source: missing service for VPN plugin info
kk: VPN плагині ақпараты үшін қызмет жетіспейді

source: Failed to initialize the crypto engine.
kk: Криптоқозғалтқышты инициализациялау сәтсіз аяқталды.

source: Unsupported key cipher for decryption
kk: Шифрды ашу үшін қолдау көрсетілмейтін кілт шифры

source: Invalid IV length (must be at least %u).
kk: IV ұзындығы жарамсыз (кем дегенде %u болуы керек).

source: Failed to initialize the decryption cipher context: %s (%s)
kk: Шифрды ашу контекстін инициализациялау сәтсіз аяқталды: %s (%s)

source: Failed to decrypt the private key: %s (%s)
kk: Жеке кілттің шифрын ашу сәтсіз аяқталды: %s (%s)

source: Failed to decrypt the private key: unexpected padding length.
kk: Жеке кілттің шифрын ашу сәтсіз аяқталды: толтыру ұзындығы күтпеген

source: Failed to decrypt the private key.
kk: Жеке кілттің шифрын ашу сәтсіз аяқталды.

source: Unsupported key cipher for encryption
kk: Шифрлау үшін қолдау көрсетілмейтін кілт шифры

source: Failed to initialize the encryption cipher context: %s (%s)
kk: Шифрлау контекстін инициализациялау сәтсіз аяқталды: %s (%s)

source: Failed to encrypt the data: %s (%s)
kk: Деректерді шифрлау сәтсіз аяқталды: %s (%s)

source: Error initializing certificate data: %s
kk: Сертификат деректерін инициализациялау қатесі: %s

source: Couldn't decode certificate: %s
kk: Сертификаттың кодын ашу мүмкін болмады: %s

source: Couldn't initialize PKCS#12 decoder: %s
kk: PKCS#12 декодерін инициализациялау мүмкін болмады: %s

source: Couldn't decode PKCS#12 file: %s
kk: PKCS#12 файлының кодын ашу мүмкін болмады: %s
