Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Key management used for the connection. One of "none" (WEP or no password protection), "ieee8021x" (Dynamic WEP), "owe" (Opportunistic Wireless Encryption), "wpa-psk" (WPA2 + WPA3 personal), "sae" (WPA3 personal only), "wpa-eap" (WPA2 + WPA3 enterprise) or "wpa-eap-suite-b-192" (WPA3 enterprise only). This property must be set for any Wi-Fi connection that uses security.
kk: Қосылым үшін қолданылатын кілт басқару. "none" (WEP немесе парольді қорғау жоқ), "ieee8021x" (Динамикалық WEP), "owe" (Opportunistic Wireless Encryption), "wpa-psk" (WPA2 + WPA3 жеке), "sae" (тек WPA3 жеке), "wpa-eap" (WPA2 + WPA3 кәсіпорын) немесе "wpa-eap-suite-b-192" (тек WPA3 кәсіпорын) біреуі. Бұл қасиет қауіпсіздікті қолданатын кез келген Wi-Fi қосылымы үшін орнатылуы керек.

source: The login password for legacy LEAP connections (ie, key-mgmt = "ieee8021x" and auth-alg = "leap").
kk: Ескі LEAP қосылымдары үшін кіру паролі (яғни, key-mgmt = "ieee8021x" және auth-alg = "leap").

source: Flags indicating how to handle the "leap-password" property.
kk: "leap-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: The login username for legacy LEAP connections (ie, key-mgmt = "ieee8021x" and auth-alg = "leap").
kk: Ескі LEAP қосылымдары үшін кіру пайдаланушы аты (яғни, key-mgmt = "ieee8021x" және auth-alg = "leap").

source: A list of pairwise encryption algorithms which prevents connections to Wi-Fi networks that do not utilize one of the algorithms in the list. For maximum compatibility leave this property empty. Each list element may be one of "tkip" or "ccmp".
kk: Тізімдегі алгоритмдердің бірін қолданбайтын Wi-Fi желілеріне қосылымдарға жол бермейтын жұптық шифрлау алгоритмдерінің тізімі. Максималды үйлесімділік үшін бұл қасиетті бос қалдырыңыз. Әр тізім элементі "tkip" немесе "ccmp" біреуі болуы мүмкін.

source: Indicates whether Protected Management Frames (802.11w) must be enabled for the connection. One of "default" (0) (use global default value), "disable" (1) (disable PMF), "optional" (2) (enable PMF if the supplicant and the access point support it) or "required" (3) (enable PMF and fail if not supported). When set to "default" (0) and no global default is set, PMF will be optionally enabled.
kk: Қосылым үшін Қорғалған Басқару Кадрлары (802.11w) іске қосылуы керек пе екенін көрсетеді. "default" (0) (глобалды әдепкі мәнді қолдану), "disable" (1) (PMF сөндіру), "optional" (2) (суппликант және қол жеткізу нүктесі қолдаса PMF іске қосу) немесе "required" (3) (PMF іске қосу және қолдау көрсетілмесе сәтсіз аяқтау) біреуі. "default" (0) мәніне орнатылған кезде және глобалды әдепкі орнатылмаған болса, PMF міндетті емес түрде іске қосылады.

source: List of strings specifying the allowed WPA protocol versions to use. Each element may be one "wpa" (allow WPA) or "rsn" (allow WPA2/RSN). If not specified, both WPA and RSN connections are allowed.
kk: Қолдануға рұқсат етілген WPA хаттама нұсқаларын көрсететін жолдар тізімі. Әр элемент "wpa" (WPA рұқсат ету) немесе "rsn" (WPA2/RSN рұқсат ету) біреуі болуы мүмкін. Егер көрсетілмесе, WPA және RSN қосылымдарына да рұқсат етіледі.

source: Pre-Shared-Key for WPA networks. For WPA-PSK, it's either an ASCII passphrase of 8 to 63 characters that is (as specified in the 802.11i standard) hashed to derive the actual key, or the key in form of 64 hexadecimal character. The WPA3-Personal networks use a passphrase of any length for SAE authentication.
kk: WPA желілері үшін Алдын-Ала-Бөлісілген-Кілт. WPA-PSK үшін бұл нақты кілтті алу үшін хэштелетін (802.11i стандартында көрсетілгендей) 8-ден 63 таңбаға дейінгі ASCII кілттік фразасы немесе 64 он алтылық таңба түріндегі кілт. WPA3-Personal желілері SAE аутентификациясы үшін кез келген ұзындықтағы кілттік фразаны қолданады.

source: Flags indicating how to handle the "psk" property.
kk: "psk" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: Flags indicating how to handle the "wep-key0", "wep-key1", "wep-key2", and "wep-key3" properties.
kk: "wep-key0", "wep-key1", "wep-key2" және "wep-key3" қасиеттерін қалай өңдеу керектігін көрсететін жалаушалар.

source: Controls the interpretation of WEP keys. Allowed values are "key" (1), in which case the key is either a 10- or 26-character hexadecimal string, or a 5- or 13-character ASCII password; or "passphrase" (2), in which case the passphrase is provided as a string and will be hashed using the de-facto MD5 method to derive the actual WEP key.
kk: WEP кілттерін түсіндіруді басқарады. Рұқсат етілген мәндер "key" (1), бұл жағдайда кілт 10 немесе 26 таңбалы он алтылық жол немесе 5 немесе 13 таңбалы ASCII паролі болып табылады; немесе "passphrase" (2), бұл жағдайда кілттік фраза жол ретінде беріледі және нақты WEP кілтін алу үшін de-facto MD5 әдісі арқылы хэштеледі.

source: Index 0 WEP key. This is the WEP key used in most networks. See the "wep-key-type" property for a description of how this key is interpreted.
kk: 0 индексіндегі WEP кілті. Бұл көптеген желілерде қолданылатын WEP кілті. Бұл кілттің қалай түсіндірілетінін сипаттау үшін "wep-key-type" қасиетін қараңыз.

source: Index 1 WEP key. This WEP index is not used by most networks. See the "wep-key-type" property for a description of how this key is interpreted.
kk: 1 индексіндегі WEP кілті. Бұл WEP индексі көптеген желілерде қолданылмайды. Бұл кілттің қалай түсіндірілетінін сипаттау үшін "wep-key-type" қасиетін қараңыз.

source: Index 2 WEP key. This WEP index is not used by most networks. See the "wep-key-type" property for a description of how this key is interpreted.
kk: 2 индексіндегі WEP кілті. Бұл WEP индексі көптеген желілерде қолданылмайды. Бұл кілттің қалай түсіндірілетінін сипаттау үшін "wep-key-type" қасиетін қараңыз.

source: Index 3 WEP key. This WEP index is not used by most networks. See the "wep-key-type" property for a description of how this key is interpreted.
kk: 3 индексіндегі WEP кілті. Бұл WEP индексі көптеген желілерде қолданылмайды. Бұл кілттің қалай түсіндірілетінін сипаттау үшін "wep-key-type" қасиетін қараңыз.

source: When static WEP is used (ie, key-mgmt = "none") and a non-default WEP key index is used by the AP, put that WEP key index here. Valid values are 0 (default key) through 3. Note that some consumer access points (like the Linksys WRT54G) number the keys 1 - 4.
kk: Статикалық WEP қолданылған кезде (яғни, key-mgmt = "none") және AP әдепкі емес WEP кілт индексін қолданған кезде, сол WEP кілт индексін осында қойыңыз. Жарамды мәндер 0 (әдепкі кілт) мен 3 аралығында. Ескеріңіз, кейбір тұтынушылық қол жеткізу нүктелері (Linksys WRT54G сияқты) кілттерді 1 - 4 деп нөмірлейді.

source: Flags indicating which mode of WPS is to be used if any. There's little point in changing the default setting as NetworkManager will automatically determine whether it's feasible to start WPS enrollment from the Access Point capabilities. WPS can be disabled by setting this property to a value of 1.
kk: WPS-тің қай режимі қолданылатынын көрсететін жалаушалар (егер бар болса). Әдепкі баптауды өзгертудің қажеті шамалы, өйткені NetworkManager Қол жеткізу Нүктесі мүмкіндіктерінен WPS тіркелуін бастаудың мүмкін екенін автоматты түрде анықтайды. WPS-ті бұл қасиетті 1 мәніне орнату арқылы сөндіруге болады.

source: IEEE 802.15.4 channel. A positive integer or -1, meaning "do not set, use whatever the device is already set to".
kk: IEEE 802.15.4 арнасы. Оң бүтін сан немесе -1, бұл "орнатпау, құрылғыда орнатылғанды қолдану" дегенді білдіреді.

source: If specified, this connection will only apply to the IEEE 802.15.4 (WPAN) MAC layer device whose permanent MAC address matches.
kk: Егер көрсетілсе, бұл қосылым тек тұрақты MAC адресі сәйкес келетін IEEE 802.15.4 (WPAN) MAC деңгейінің құрылғысына қолданылады.

source: IEEE 802.15.4 channel page. A positive integer or -1, meaning "do not set, use whatever the device is already set to".
kk: IEEE 802.15.4 арна беті. Оң бүтін сан немесе -1, бұл "орнатпау, құрылғыда орнатылғанды қолдану" дегенді білдіреді.

source: IEEE 802.15.4 Personal Area Network (PAN) identifier.
kk: IEEE 802.15.4 Жеке Аймақ Желісі (PAN) идентификаторы.

source: Short IEEE 802.15.4 address to be used within a restricted environment.
kk: Шектеулі ортада қолданылатын қысқа IEEE 802.15.4 адресі.

source: The port priority for bond active port re-selection during failover. A higher number means a higher priority in selection. The primary port has the highest priority. This option is only compatible with active-backup, balance-tlb and balance-alb modes.
kk: Қайта ауысу кезінде bond белсенді портын қайта таңдау үшін порт басымдығы. Жоғарырақ сан таңдауда жоғарырақ басымдықты білдіреді. Негізгі порт ең жоғары басымдыққа ие. Бұл опция тек active-backup, balance-tlb және balance-alb режимдерімен үйлесімді.

source: The queue ID of this bond port. The maximum value of queue ID is the number of TX queues currently active in device.
kk: Осы bond портының кезек ID. Кезек ID максималды мәні — құрылғыда қазіргі уақытта белсенді TX кезектерінің саны.

source: Whether the system hostname can be determined from DHCP on this connection. When set to "default" (-1), the value from global configuration is used. If the property doesn't have a value in the global configuration, NetworkManager assumes the value to be "true" (1).
kk: Жүйелік хост атын осы қосылымда DHCP арқылы анықтауға бола ма. "default" (-1) мәніне орнатылған кезде, глобалды конфигурациядан алынған мән қолданылады. Егер глобалды конфигурацияда қасиеттің мәні болмаса, NetworkManager мәнді "true" (1) деп есептейді.

source: Whether the system hostname can be determined from reverse DNS lookup of addresses on this device. When set to "default" (-1), the value from global configuration is used. If the property doesn't have a value in the global configuration, NetworkManager assumes the value to be "true" (1).
kk: Жүйелік хост атын осы құрылғыдағы адрестердің кері DNS іздеуінен анықтауға бола ма. "default" (-1) мәніне орнатылған кезде, глобалды конфигурациядан алынған мән қолданылады. Егер глобалды конфигурацияда қасиеттің мәні болмаса, NetworkManager мәнді "true" (1) деп есептейді.

source: If set to "true" (1), NetworkManager attempts to get the hostname via DHCPv4/DHCPv6 or reverse DNS lookup on this device only when the device has the default route for the given address family (IPv4/IPv6). If set to "false" (0), the hostname can be set from this device even if it doesn't have the default route. When set to "default" (-1), the value from global configuration is used. If the property doesn't have a value in the global configuration, NetworkManager assumes the value to be "false" (0).
kk: Егер "true" (1) мәніне орнатылса, NetworkManager осы құрылғыда тек берілген адрес отбасы (IPv4/IPv6) үшін әдепкі бағдар болған кезде ғана DHCPv4/DHCPv6 немесе кері DNS іздеу арқылы хост атын алуға тырысады. Егер "false" (0) мәніне орнатылса, хост атын осы құрылғыдан оның әдепкі бағдары болмаса да орнатуға болады. "default" (-1) мәніне орнатылған кезде, глобалды конфигурациядан алынған мән қолданылады. Егер глобалды конфигурацияда қасиеттің мәні болмаса, NetworkManager мәнді "false" (0) деп есептейді.

source: The relative priority of this connection to determine the system hostname. A lower numerical value is better (higher priority). A connection with higher priority is considered before connections with lower priority. If the value is zero, it can be overridden by a global value from NetworkManager configuration. If the property doesn't have a value in the global configuration, the value is assumed to be 100. Negative values have the special effect of excluding other connections with a greater numerical priority value; so in presence of at least one negative priority, only connections with the lowest priority value will be used to determine the hostname.
kk: Жүйелік хост атын анықтау үшін осы қосылымның салыстырмалы басымдығы. Төменгі сандық мән жақсырақ (жоғары басымдық). Жоғары басымдығы бар қосылым төмен басымдығы бар қосылымдардан бұрын қарастырылады. Егер мән нөл болса, ол NetworkManager конфигурациясынан глобалды мәнмен қайта жазылуы мүмкін. Егер глобалды конфигурацияда қасиеттің мәні болмаса, мән 100 деп есептеледі. Теріс мәндер жоғары сандық басымдық мәні бар басқа қосылымдарды алып тастаудың арнайы әсеріне ие; сондықтан кем дегенде бір теріс басымдық болған кезде, хост атын анықтау үшін тек ең төменгі басымдық мәні бар қосылымдар қолданылады.

source: The maximum size of a packet built by the Generic Receive Offload stack for this device. The value must be between 0 and 4294967295. When set to -1, the existing value is preserved.
kk: Осы құрылғы үшін Generic Receive Offload стегі құрастырған пакеттің максималды өлшемі. Мән 0 мен 4294967295 арасында болуы керек. -1 мәніне орнатылған кезде, бар мән сақталады.

source: The maximum segments of a Generic Segment Offload packet the device should accept. The value must be between 0 and 4294967295. When set to -1, the existing value is preserved.
kk: Құрылғы қабылдауы керек Generic Segment Offload пакетінің максималды сегменттері. Мән 0 мен 4294967295 арасында болуы керек. -1 мәніне орнатылған кезде, бар мән сақталады.

source: The maximum size of a Generic Segment Offload packet the device should accept. The value must be between 0 and 4294967295. When set to -1, the existing value is preserved.
kk: Құрылғы қабылдауы керек Generic Segment Offload пакетінің максималды өлшемі. Мән 0 мен 4294967295 арасында болуы керек. -1 мәніне орнатылған кезде, бар мән сақталады.

source: The size of the transmit queue for the device, in number of packets. The value must be between 0 and 4294967295. When set to -1, the existing value is preserved.
kk: Құрылғы үшін тарату кезегінің өлшемі, пакеттер санымен. Мән 0 мен 4294967295 арасында болуы керек. -1 мәніне орнатылған кезде, бар мән сақталады.

source: A dictionary of key/value pairs with external-ids for OVS.
kk: OVS үшін external-ids бар кілт/мән жұптарының сөздігі.

source: A dictionary of key/value pairs with other_config settings for OVS. See also "other_config" in the "ovs-vswitchd.conf.db" manual for the keys that OVS supports.
kk: OVS үшін other_config баптаулары бар кілт/мән жұптарының сөздігі. OVS қолдайтын кілттер үшін "ovs-vswitchd.conf.db" нұсқаулығындағы "other_config" қараңыз.

source: The subnet ID to use on the interface from the prefix delegation received via an upstream interface. Set to a value between 0 and 0xffffffff (2^32 - 1) to indicate a specific subnet ID; or set to -1 to automatically choose an available subnet ID.
kk: Жоғары ағын интерфейсі арқылы алынған префикс делегациясынан интерфейсте қолданылатын ішкі желі ID. Нақты ішкі желі ID көрсету үшін 0 мен 0xffffffff (2^32 - 1) арасындағы мәнге орнатыңыз; немесе қолжетімді ішкі желі ID автоматты түрде таңдау үшін -1 мәніне орнатыңыз.

source: This property specifies the peer interface name of the veth. This property is mandatory.
kk: Бұл қасиет veth серіктес интерфейс атын көрсетеді. Бұл қасиет міндетті.

source: OK
kk: ОК

source: Could not create temporary file: %s
kk: Уақытша файлды құру мүмкін емес: %s

source: Could not write to temporary file: %s
kk: Уақытша файлға жазу мүмкін емес: %s

source: Editor failed: %s
kk: Редактор сәтсіз аяқталды: %s

source: Could not re-read file: %s
kk: Файлды қайта оқу мүмкін емес: %s

source: Connecting
kk: Қосылуда

source: Error: timeout creating NMClient object
kk: Қате: NMClient объектісін жасау мерзімі өтті

source: Error: Could not create NMClient object: %s
kk: Қате: NMClient объектісін жасау мүмкін емес: %s

source: Don't print anything
kk: Ештеңе басып шығармау

source: Wait for NetworkManager startup instead of a connection
kk: Қосылымның орнына NetworkManager іске қосылуын күту

source: Time to wait for a connection, in seconds (without the option, default value is 30). Maximum value is 2073600 seconds.
kk: Қосылымды күту уақыты, секундпен (опциясыз, әдепкі мән 30). Максималды мән 2073600 секунд.

source: Exit immediately if NetworkManager is not running or connecting
kk: Егер NetworkManager жұмыс істеп тұрмаса немесе қосылмаса, бірден шығу

source: Waits for NetworkManager to finish activating startup network connections.
kk: NetworkManager іске қосу желілік қосылымдарын белсендіруді аяқтағанша күтеді.

source: Invalid option. Please use --help to see a list of valid options.
kk: Жарамсыз опция. Жарамды опциялар тізімін көру үшін --help қолданыңыз.

source: Usage: nmcli agent { COMMAND | help } COMMAND := { secret | polkit | all }
kk: Қолданылуы: nmcli agent { КОМАНДА | help } КОМАНДА := { secret | polkit | all }

source: Usage: nmcli agent secret { help } Runs nmcli as NetworkManager secret agent. When NetworkManager requires a password it asks registered agents for it. This command keeps nmcli running and if a password is required asks the user for it.
kk: Қолданылуы: nmcli agent secret { help } nmcli-ді NetworkManager құпия агенті ретінде іске қосады. NetworkManager парольді талап еткен кезде, ол тіркелген агенттерден сұрайды. Бұл команда nmcli жұмысын жалғастырады және егер пароль қажет болса, оны пайдаланушыдан сұрайды.

source: Usage: nmcli agent polkit { help } Registers nmcli as a polkit action for the user session. When a polkit daemon requires an authorization, nmcli asks the user and gives the response back to polkit.
kk: Қолданылуы: nmcli agent polkit { help } nmcli-ді пайдаланушы сессиясы үшін polkit әрекеті ретінде тіркейді. Polkit қызметі авторизацияны талап еткен кезде, nmcli пайдаланушыдан сұрайды және жауапты polkit-ке қайтарады.

source: Usage: nmcli agent all { help } Runs nmcli as both NetworkManager secret and a polkit agent.
kk: Қолданылуы: nmcli agent all { help } nmcli-ді NetworkManager құпия және polkit агенті ретінде іске қосады.

source: nmcli successfully registered as a NetworkManager's secret agent.
kk: nmcli NetworkManager-дің құпия агенті ретінде сәтті тіркелді.

source: Error: secret agent initialization failed
kk: Қате: құпия агентті инициализациялау сәтсіз аяқталды

source: nmcli successfully registered as a polkit agent.
kk: nmcli polkit агенті ретінде сәтті тіркелді.

source: Error: polkit agent initialization failed: %s
kk: Қате: polkit агентін инициализациялау сәтсіз аяқталды: %s

source: GROUP
kk: ТОП

source: Error: openconnect failed: %s
kk: Қате: openconnect сәтсіз аяқталды: %s

source: Warning: password for '%s' not given in 'passwd-file' and nmcli cannot ask without '--ask' option.
kk: Ескерту: '%s' үшін пароль 'passwd-file' ішінде берілмеген және nmcli '--ask' опциясынсыз сұрай алмайды.

source: Error: Could not create NMClient object: %s.
kk: Қате: NMClient объектісін жасау мүмкін емес: %s.

source: Error: command doesn't support --offline mode.
kk: Қате: команда --offline режимін қолдамайды.

source: Error: NetworkManager is not running.
kk: Қате: NetworkManager жұмыс істеп тұрған жоқ.

source: Error: argument '%s' not understood. Try passing --help instead.
kk: Қате: '%s' аргументі түсінілмеді. Орнына --help беріп көріңіз.

source: Error: missing argument. Try passing --help.
kk: Қате: аргумент жетіспейді. --help беріп көріңіз.

source: access denied
kk: қол жеткізуге тыйым салынды

source: NetworkManager is not running
kk: NetworkManager жұмыс істеп тұрған жоқ

source: none
kk: жоқ

source: portal
kk: портал

source: limited
kk: шектеулі

source: full
kk: толық

source: Setting name?
kk: Баптау аты?

source: Property name?
kk: Қасиет аты?

source: Enter connection type:
kk: Қосылым түрін енгізіңіз:

source: Connection (name, UUID, or path):
kk: Қосылым (аты, UUID немесе жолы):

source: VPN connection (name, UUID, or path):
kk: VPN қосылымы (аты, UUID немесе жолы):

source: Connection(s) (name, UUID, or path):
kk: Қосылым(дар) (аты, UUID немесе жолы):

source: Connection(s) (name, UUID, path or apath):
kk: Қосылым(дар) (аты, UUID, жолы немесе apath):

source: activating
kk: белсендірілуде

source: activated
kk: белсендірілген

source: deactivated
kk: сөндірілген

source: VPN connecting (prepare)
kk: VPN қосылуда (дайындау)

source: VPN connecting (need authentication)
kk: VPN қосылуда (аутентификация қажет)

source: VPN connecting
kk: VPN қосылуда

source: VPN connecting (getting IP configuration)
kk: VPN қосылуда (IP конфигурациясын алу)

source: VPN connected
kk: VPN қосылды

source: VPN connection failed
kk: VPN қосылымы сәтсіз аяқталды

source: VPN disconnected
kk: VPN ажыратылды

source: Error: Error writing connection: %s
kk: Қате: Қосылымды жазу қатесі: %s

source: WiMax is no longer supported
kk: WiMax-қа бұдан былай қолдау көрсетілмейді

source: WEP encryption is known to be insecure
kk: WEP шифрлауы қауіпсіз емес екені белгілі

source: never
kk: ешқашан

source: Usage: nmcli connection { COMMAND | help } COMMAND := { show | up | down | add | modify | clone | edit | delete | monitor | reload | load | import | export } show [--active] [--order <order spec>] show [--active] [id | uuid | path | apath] <ID> ... up [[id | uuid | path] <ID>] [ifname <ifname>] [ap <BSSID>] [passwd-file <file with passwords>] down [id | uuid | path | apath] <ID> ... add COMMON_OPTIONS TYPE_SPECIFIC_OPTIONS PORT_OPTIONS IP_OPTIONS [-- ([+|-]<setting>.<property> <value>)+] modify [--temporary] [id | uuid | path] <ID> ([+|-]<setting>.<property> <value>)+ clone [--temporary] [id | uuid | path ] <ID> <new name> edit [id | uuid | path] <ID> edit [type <new_con_type>] [con-name <new_con_name>] delete [id | uuid | path] <ID> monitor [id | uuid | path] <ID> ... reload load <filename> [ <filename>... ] import [--temporary] type <type> file <file to import> export [id | uuid | path] <ID> [<output file>]
kk: Қолданылуы: nmcli connection { КОМАНДА | help } КОМАНДА := { show | up | down | add | modify | clone | edit | delete | monitor | reload | load | import | export } show [--active] [--order <тәртіп спецификациясы>] show [--active] [id | uuid | path | apath] <ID> ... up [[id | uuid | path] <ID>] [ifname <интерфейс аты>] [ap <BSSID>] [passwd-file <парольдер бар файл>] down [id | uuid | path | apath] <ID> ... add ОРТАҚ_ОПЦИЯЛАР ТҮРГЕ_ТӘН_ОПЦИЯЛАР ПОРТ_ОПЦИЯЛАРЫ IP_ОПЦИЯЛАРЫ [-- ([+|-]<баптау>.<қасиет> <мән>)+] modify [--temporary] [id | uuid | path] <ID> ([+|-]<баптау>.<қасиет> <мән>)+ clone [--temporary] [id | uuid | path ] <ID> <жаңа аты> edit [id | uuid | path] <ID> edit [type <жаңа_қосылым_түрі>] [con-name <жаңа_қосылым_атауы>] delete [id | uuid | path] <ID> monitor [id | uuid | path] <ID> ... reload load <файл аты> [ <файл аты>... ] import [--temporary] type <түрі> file <импортталатын файл> export [id | uuid | path] <ID> [<шығыс файл>]
