Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: Enter a list of bonding options formatted as: option = <value>, option = <value>,... Valid options are: %s 'mode' can be provided as a name or a number: balance-rr = 0 active-backup = 1 balance-xor = 2 broadcast = 3 802.3ad = 4 balance-tlb = 5 balance-alb = 6 Example: mode=2,miimon=120
kk: Келесі пішімдегі bonding опцияларының тізімін енгізіңіз: option = <value>, option = <value>,... Жарамды опциялар: %s 'mode' аты немесе саны ретінде берілуі мүмкін: balance-rr = 0 active-backup = 1 balance-xor = 2 broadcast = 3 802.3ad = 4 balance-tlb = 5 balance-alb = 6 Мысалы: mode=2,miimon=120

source: Can not change the connection type
kk: Қосылым түрін өзгерту мүмкін емес

source: invalid permission "%s"
kk: жарамсыз рұқсат "%s"

source: the value '%s' is not a valid UUID
kk: '%s' мәні — жарамды UUID емес

source: 0 (disabled)
kk: 0 (сөндірулі)

source: enabled,
kk: іске қосылған,

source: advertise,
kk: жарнамалау,

source: willing,
kk: дайын,

source: '%s' is not a valid DCB flag
kk: '%s' — жарамды DCB жалаушасы емес

source: must contain 8 comma-separated numbers
kk: үтірмен ажыратылған 8 санды қамтуы керек

source: '%s' not a number between 0 and %u (inclusive) or %u
kk: '%s' — 0 және %u (қоса алғанда) арасындағы сан немесе %u емес

source: '%s' not a number between 0 and %u (inclusive)
kk: '%s' — 0 және %u (қоса алғанда) арасындағы сан емес

source: changes will have no effect until '%s' includes 1 (enabled)
kk: өзгерістер '%s' 1 (іске қосылған) қамтымайынша күшіне енбейді

source: bandwidth percentages must total 100%%
kk: өткізу қабілетінің пайыздары жалпы 100%% болуы керек

source: SIM operator ID must be a 5 or 6 number MCCMNC code
kk: SIM оператор ID 5 немесе 6 санды MCCMNC коды болуы керек

source: '%s' is not a valid IBoIP P_Key
kk: '%s' — жарамды IBoIP P_Key емес

source: default
kk: әдепкі

source: invalid gateway address '%s'
kk: жарамсыз шлюз адресі '%s'

source: '%s' is not a valid channel; use <1-13>
kk: '%s' — жарамды арна емес; <1-13> қолданыңыз

source: The valid syntax is: vf [attribute=value]... [,vf [attribute=value]...]
kk: Жарамды синтаксис: vf [attribute=value]... [,vf [attribute=value]...]

source: The valid syntax is: '[root | parent <handle>] [handle <handle>] <kind>'
kk: Жарамды синтаксис: '[root | parent <handle>] [handle <handle>] <kind>'

source: The valid syntax is: '<value>' or '<start>-<end>
kk: Жарамды синтаксис: '<value>' немесе '<start>-<end>

source: The valid syntax is: '<vid>[-<vid>] [pvid] [untagged]'
kk: Жарамды синтаксис: '<vid>[-<vid>] [pvid] [untagged]'

source: invalid priority map '%s'
kk: жарамсыз басымдық картасы '%s'

source: '%s' is not valid; 2 or 3 strings should be provided
kk: '%s' жарамсыз; 2 немесе 3 жол берілуі керек

source: Enter a list of S/390 options formatted as: option = <value>, option = <value>,... Valid options are: %s
kk: Келесі пішімдегі S/390 опцияларының тізімін енгізіңіз: option = <value>, option = <value>,... Жарамды опциялар: %s

source: '%s' is not a valid channel
kk: '%s' — жарамды арна емес

source: '%ld' is not a valid channel
kk: '%ld' — жарамды арна емес

source: '%s' not compatible with %s '%s', please change the key or set the right %s first.
kk: '%s' %s '%s' мәнімен үйлесімді емес, кілтті өзгертіңіз немесе алдымен дұрыс %s орнатыңыз.

source: WEP key is guessed to be of %s
kk: WEP кілті %s деп болжануда

source: WEP key index set to '%d'
kk: WEP кілт индексі '%d' етіп орнатылды

source: '%s' is not compatible with '%s' type, please change or delete the key.
kk: '%s' '%s' түрімен үйлесімді емес, кілтті өзгертіңіз немесе өшіріңіз.

source: on
kk: қосулы

source: off
kk: өшірулі

source: '%s' is not valid; use 'on', 'off', or 'ignore'
kk: '%s' жарамсыз; 'on', 'off' немесе 'ignore' қолданыңыз

source: Bonding primary interface
kk: Bonding негізгі интерфейсі

source: Bonding monitoring mode
kk: Bonding бақылау режимі

source: LACP rate (slow/fast)
kk: LACP жылдамдығы (slow/fast)

source: nmcli can accepts both direct JSON configuration data and a file name containing the configuration. In the latter case the file is read and the contents is put into this property. Examples: set team.config { "device": "team0", "runner": {"name": "roundrobin"}, "ports": {"eth1": {}, "eth2": {}} } set team.config /etc/my-team.conf
kk: nmcli тікелей JSON конфигурация деректерін де, конфигурацияны қамтитын файл атын да қабылдай алады. Соңғы жағдайда файл оқылады және мазмұны осы қасиетке қойылады. Мысалдар: set team.config { "device": "team0", "runner": {"name": "roundrobin"}, "ports": {"eth1": {}, "eth2": {}} } set team.config /etc/my-team.conf

source: Enter a list of link watchers formatted as dictionaries where the keys are teamd properties. Dictionary pairs are in the form: key=value and pairs are separated by ' '. Dictionaries are separated with ','. The keys allowed/required in the dictionary change on the basis of the link watcher type, while the only property common to all the link watchers is 'name'*, which defines the link watcher to be specified. Properties available for the 'ethtool' link watcher: 'delay-up', 'delay-down' Properties available for the 'nsna_ping' link watcher: 'init-wait', 'interval', 'missed-max', 'target-host'* Properties available for the 'arp_ping' include all the ones for 'nsna_ping' and: 'source-host'*, 'validate-active', 'validate-inactive', 'send-always'. Properties flagged with a '*' are mandatory. Example: name=arp_ping source-host=172.16.1.1 target-host=172.16.1.254, name=ethtool delay-up=3
kk: teamd қасиеттері кілттер болып табылатын сөздіктер түрінде пішімделген қосылым бақылаушыларының тізімін енгізіңіз. Сөздік жұптары мына түрде: key=value және жұптар ' ' арқылы бөлінеді. Сөздіктер ',' арқылы бөлінеді. Сөздікте рұқсат етілген/талап етілетін кілттер қосылым бақылаушысының түріне қарай өзгереді, ал барлық қосылым бақылаушыларына ортақ жалғыз қасиет — көрсетілетін қосылым бақылаушысын анықтайтын 'name'*. 'ethtool' қосылым бақылаушысы үшін қолжетімді қасиеттер: 'delay-up', 'delay-down' 'nsna_ping' қосылым бақылаушысы үшін қолжетімді қасиеттер: 'init-wait', 'interval', 'missed-max', 'target-host'* 'arp_ping' үшін қолжетімді қасиеттерге 'nsna_ping' үшін барлық қасиеттер және мыналар кіреді: 'source-host'*, 'validate-active', 'validate-inactive', 'send-always'. '*' белгісі бар қасиеттер міндетті болып табылады. Мысалы: name=arp_ping source-host=172.16.1.1 target-host=172.16.1.254, name=ethtool delay-up=3

source: IEEE 802.15.4 (WPAN) parent device or connection UUID
kk: IEEE 802.15.4 (WPAN) аталық құрылғысы немесе қосылым UUID

source: Enter bytes as a list of hexadecimal values. Two formats are accepted: (a) a string of hexadecimal digits, where each two digits represent one byte (b) space-separated list of bytes written as hexadecimal digits (with optional 0x/0X prefix, and optional leading 0). Examples: ab0455a6ea3a74C2 ab 4 55 0xa6 ea 3a 74 C2
kk: Байттарды он алтылық мәндер тізімі ретінде енгізіңіз. Екі пішім қабылданады: (a) әрбір екі цифр бір байтты білдіретін он алтылық цифрлар жолы (b) он алтылық цифрлар ретінде жазылған (міндетті емес 0x/0X префиксімен және міндетті емес бастапқы 0-мен) бос орынмен бөлінген байттар тізімі. Мысалдар: ab0455a6ea3a74C2 ab 4 55 0xa6 ea 3a 74 C2

source: Password [none]
kk: Пароль [жоқ]

source: Bluetooth device address
kk: Bluetooth құрылғысының адресі

source: Queue ID
kk: Кезек ID

source: Port Priority
kk: Порт басымдығы

source: MAC [none]
kk: MAC [жоқ]

source: Enable STP
kk: STP іске қосу

source: STP priority
kk: STP басымдығы

source: Forward delay
kk: Қайта бағыттау кідірісі

source: Hello time
kk: Hello уақыты

source: Max age
kk: Максималды жас

source: MAC address ageing time
kk: MAC адресінің ескіру уақыты

source: Group forward mask
kk: Топтық қайта бағыттау маскасы

source: Enable IGMP snooping
kk: IGMP snooping іске қосу

source: Bridge port priority
kk: Көпір портының басымдығы

source: Bridge port STP path cost
kk: Көпір портының STP жол құны

source: Username [none]
kk: Пайдаланушы аты [жоқ]

source: Enter a list of user permissions. This is a list of user names formatted as: [user:]<user name 1>, [user:]<user name 2>,... The items can be separated by commas or spaces. Example: alice bob charlie
kk: Пайдаланушы рұқсаттарының тізімін енгізіңіз. Бұл келесі пішімдегі пайдаланушы аттарының тізімі: [user:]<user name 1>, [user:]<user name 2>,... Элементтерді үтір немесе бос орын арқылы бөлуге болады. Мысалы: alice bob charlie

source: Controller
kk: Контроллер

source: Enter secondary connections that should be activated when this connection is activated. Connections can be specified either by UUID or ID (name). nmcli transparently translates names to UUIDs. Note that NetworkManager only supports VPNs as secondary connections at the moment. The items can be separated by commas or spaces. Example: private-openvpn, fe6ba5d8-c2fc-4aae-b2e3-97efddd8d9a7
kk: Осы қосылым белсендірілгенде іске қосылуы керек қосымша қосылымдарды енгізіңіз. Қосылымдарды UUID немесе ID (аты) бойынша көрсетуге болады. nmcli аттарды UUID-терге автоматты түрде аударады. Ескеріңіз, NetworkManager қазіргі уақытта қосымша қосылымдар ретінде тек VPN-дерді қолдайды. Элементтерді үтір немесе бос орын арқылы бөлуге болады. Мысалы: private-openvpn, fe6ba5d8-c2fc-4aae-b2e3-97efddd8d9a7

source: Enter a value which indicates whether the connection is subject to a data quota, usage costs or other limitations. Accepted options are: 'true','yes','on' to set the connection as metered 'false','no','off' to set the connection as not metered 'unknown' to let NetworkManager choose a value using some heuristics
kk: Қосылымның деректер квотасына, пайдалану құнына немесе басқа шектеулерге бағынатынын көрсететін мәнді енгізіңіз. Қабылданған опциялар: 'true','yes','on' - қосылымды өлшенетін етіп орнату 'false','no','off' - қосылымды өлшенбейтін етіп орнату 'unknown' - NetworkManager-ге кейбір эвристиканы пайдаланып мәнді таңдауға мүмкіндік беру

source: hsr port1
kk: hsr порт1

source: hsr port2
kk: hsr порт2

source: hsr multicast spec
kk: hsr мультикаст ерекшелігі

source: P_KEY [none]
kk: P_KEY [жоқ]

source: Parent interface [none]
kk: Аталық интерфейс [жоқ]

source: Enter a list of IPv4 addresses of DNS servers. Example: 8.8.8.8, 8.8.4.4
kk: DNS серверлерінің IPv4 адрестерінің тізімін енгізіңіз. Мысалы: 8.8.8.8, 8.8.4.4

source: IPv4 address (IP[/plen]) [none]
kk: IPv4 адресі (IP[/plen]) [жоқ]

source: Enter a list of IPv4 addresses formatted as: ip[/prefix], ip[/prefix],... Missing prefix is regarded as prefix of 32. Example: 192.168.1.5/24, 10.0.0.11/24
kk: Келесі пішімдегі IPv4 адрестерінің тізімін енгізіңіз: ip[/prefix], ip[/prefix],... Жетіспейтін префикс 32 префиксі ретінде қарастырылады. Мысалы: 192.168.1.5/24, 10.0.0.11/24

source: IPv4 gateway [none]
kk: IPv4 шлюзі [жоқ]

source: Enter a list of IPv4 routes formatted as: ip[/prefix] [next-hop] [metric],... Missing prefix is regarded as a prefix of 32. Missing next-hop is regarded as 0.0.0.0. Missing metric means default (NM/kernel will set a default value). Examples: 192.168.2.0/24 192.168.2.1 3, 10.1.0.0/16 10.0.0.254 10.1.2.0/24
kk: Келесі пішімдегі IPv4 бағдарларының тізімін енгізіңіз: ip[/prefix] [next-hop] [metric],... Жетіспейтін префикс 32 префиксі ретінде қарастырылады. Жетіспейтін келесі секіріс 0.0.0.0 ретінде қарастырылады. Жетіспейтін метрика әдепкі мәнді білдіреді (NM/ядро әдепкі мәнді орнатады). Мысалдар: 192.168.2.0/24 192.168.2.1 3, 10.1.0.0/16 10.0.0.254 10.1.2.0/24

source: Enter a list of IPv4 routing rules formatted as: priority [prio] [from [src]] [to [dst]], ,...
kk: Келесі пішімдегі IPv4 бағдарлау ережелерінің тізімін енгізіңіз: priority [prio] [from [src]] [to [dst]], ,...

source: Enter a list of IPv6 addresses of DNS servers. If the IPv6 configuration method is 'auto' these DNS servers are appended to those (if any) returned by automatic configuration. DNS servers cannot be used with the 'shared' or 'link-local' IPv6 configuration methods, as there is no upstream network. In all other IPv6 configuration methods, these DNS servers are used as the only DNS servers for this connection. Example: 2607:f0d0:1002:51::4, 2607:f0d0:1002:51::1
kk: DNS серверлерінің IPv6 адрестерінің тізімін енгізіңіз. Егер IPv6 конфигурациялау әдісі 'auto' болса, бұл DNS серверлері автоматты конфигурация қайтарған серверлерге (егер бар болса) қосылады. DNS серверлерін 'shared' немесе 'link-local' IPv6 конфигурациялау әдістерімен пайдалану мүмкін емес, өйткені жоғары ағынды желі жоқ. Барлық басқа IPv6 конфигурациялау әдістерінде бұл DNS серверлері осы қосылым үшін жалғыз DNS серверлері ретінде пайдаланылады. Мысалы: 2607:f0d0:1002:51::4, 2607:f0d0:1002:51::1

source: IPv6 address (IP[/plen]) [none]
kk: IPv6 адресі (IP[/plen]) [жоқ]

source: Enter a list of IPv6 addresses formatted as: ip[/prefix], ip[/prefix],... Missing prefix is regarded as prefix of 128. Example: 2607:f0d0:1002:51::4/64, 1050:0:0:0:5:600:300c:326b
kk: Келесі пішімдегі IPv6 адрестерінің тізімін енгізіңіз: ip[/prefix], ip[/prefix],... Жетіспейтін префикс 128 префиксі ретінде қарастырылады. Мысалы: 2607:f0d0:1002:51::4/64, 1050:0:0:0:5:600:300c:326b

source: IPv6 gateway [none]
kk: IPv6 шлюзі [жоқ]

source: Enter a list of IPv6 routes formatted as: ip[/prefix] [next-hop] [metric],... Missing prefix is regarded as a prefix of 128. Missing next-hop is regarded as "::". Missing metric means default (NM/kernel will set a default value). Examples: 2001:db8:beef:2::/64 2001:db8:beef::2, 2001:db8:beef:3::/64 2001:db8:beef::3 2 abbe::/64 55
kk: Келесі пішімдегі IPv6 бағдарларының тізімін енгізіңіз: ip[/prefix] [next-hop] [metric],... Жетіспейтін префикс 128 префиксі ретінде қарастырылады. Жетіспейтін келесі секіріс "::" ретінде қарастырылады. Жетіспейтін метрика әдепкі мәнді білдіреді (NM/ядро әдепкі мәнді орнатады). Мысалдар: 2001:db8:beef:2::/64 2001:db8:beef::2, 2001:db8:beef:3::/64 2001:db8:beef::3 2 abbe::/64 55

source: Enter a list of IPv6 routing rules formatted as: priority [prio] [from [src]] [to [dst]], ,...
kk: Келесі пішімдегі IPv6 бағдарлау ережелерінің тізімін енгізіңіз: priority [prio] [from [src]] [to [dst]], ,...

source: Parent device [none]
kk: Аталық құрылғы [жоқ]

source: Local endpoint [none]
kk: Жергілікті соңғы нүкте [жоқ]

source: Remote
kk: Қашықтағы

source: IPVLAN parent device or connection UUID
kk: IPVLAN аталық құрылғысы немесе қосылым UUID

source: MACsec parent device or connection UUID
kk: MACsec аталық құрылғысы немесе қосылым UUID

source: Enable encryption
kk: Шифрлауды іске қосу

source: SCI port
kk: SCI порты

source: MACVLAN parent device or connection UUID
kk: MACVLAN аталық құрылғысы немесе қосылым UUID

source: OLPC Mesh channel
kk: OLPC Mesh арнасы

source: DHCP anycast MAC address [none]
kk: DHCP anycast MAC адресі [жоқ]

source: PPPoE parent device
kk: PPPoE аталық құрылғысы

source: Service [none]
kk: Қызмет [жоқ]

source: PPPoE username
kk: PPPoE пайдаланушы аты

source: Browser only
kk: Тек браузер

source: PAC script
kk: PAC скрипті

source: Team JSON configuration [none]
kk: Team JSON конфигурациясы [жоқ]

source: User ID [none]
kk: Пайдаланушы ID [жоқ]

source: Group ID [none]
kk: Топ ID [жоқ]

source: Enable PI
kk: PI іске қосу

source: Enable VNET header
kk: VNET тақырыптамасын іске қосу

source: Enable multi queue
kk: Көп кезекті іске қосу

source: veth peer
kk: veth торабы

source: VLAN parent device or connection UUID
kk: VLAN аталық құрылғысы немесе қосылым UUID

source: VLAN flags (<0-7>) [none]
kk: VLAN жалаушалары (<0-7>) [жоқ]

source: Ingress priority maps [none]
kk: Кіріс басымдық карталары [жоқ]

source: Egress priority maps [none]
kk: Шығыс басымдық карталары [жоқ]

source: Table
kk: Кесте

source: Local address [none]
kk: Жергілікті адрес [жоқ]

source: Minimum source port
kk: Минималды қайнар көз порты

source: Maximum source port
kk: Максималды қайнар көз порты

source: Destination port
kk: Мақсатты порт

source: Peer
kk: Торап

source: WiMAX NSP name
kk: WiMAX NSP аты

source: Cloned MAC [none]
kk: Клондалған MAC [жоқ]

source: Enter a list of subchannels (comma or space separated). Example: 0.0.0e20 0.0.0e21 0.0.0e22
kk: Ішкі арналар тізімін енгізіңіз (үтір немесе бос орынмен ажыратылған). Мысалы: 0.0.0e20 0.0.0e21 0.0.0e22

source: Enter the type of WEP keys. The accepted values are: 0 or unknown, 1 or key, and 2 or passphrase.
kk: WEP кілттерінің түрін енгізіңіз. Қабылданатын мәндер: 0 немесе unknown (белгісіз), 1 немесе key (кілт), және 2 немесе passphrase (кілттік фраза).

source: Short address (<0x0000-0xffff>)
kk: Қысқа адрес (<0x0000-0xffff>)

source: PAN Identifier (<0x0000-0xffff>)
kk: PAN идентификаторы (<0x0000-0xffff>)

source: Page (<default|0-31>)
kk: Парақ (<default|0-31>)

source: Channel (<default|0-26>)
kk: Арна (<default|0-26>)

source: 6LOWPAN settings
kk: 6LOWPAN баптаулары

source: 802-1x settings
kk: 802-1x баптаулары

source: bluetooth connection
kk: bluetooth қосылымы

source: Bond device
kk: Bond құрылғысы

source: Bond port
kk: Bond порты

source: Bridge device
kk: Көпір құрылғысы

source: Bridge port
kk: Көпір порты

source: CDMA mobile broadband connection
kk: CDMA мобильді кең жолақты қосылымы

source: General settings
kk: Жалпы баптаулар

source: DCB settings
kk: DCB баптаулары

source: Dummy settings
kk: Dummy баптаулары

source: Ethtool settings
kk: Ethtool баптаулары

source: Generic settings
kk: Жалпылама баптаулар

source: GSM mobile broadband connection
kk: GSM мобильді кең жолақты қосылымы

source: Hostname settings
kk: Хост атының баптаулары

source: HSR settings
kk: HSR баптаулары

source: IPv4 protocol
kk: IPv4 хаттамасы

source: IPv6 protocol
kk: IPv6 хаттамасы

source: IP-tunnel settings
kk: IP-туннель баптаулары

source: IPVLAN settings
kk: IPVLAN баптаулары

source: Link settings
kk: Қосылым баптаулары

source: Loopback settings
kk: Loopback баптаулары

source: MACsec connection
kk: MACsec қосылымы

source: macvlan connection
kk: macvlan қосылымы

source: Match
kk: Сәйкестік

source: OLPC Mesh connection
kk: OLPC Mesh қосылымы

source: Open vSwitch bridge settings
kk: Open vSwitch көпір баптаулары

source: Open vSwitch DPDK interface settings
kk: Open vSwitch DPDK интерфейс баптаулары

source: OVS Other Config
kk: OVS басқа конфигурация

source: OVS External IDs
kk: OVS сыртқы ID-лері

source: Open vSwitch interface settings
kk: Open vSwitch интерфейс баптаулары

source: Open vSwitch patch interface settings
kk: Open vSwitch patch интерфейс баптаулары

source: Open vSwitch port settings
kk: Open vSwitch порт баптаулары

source: PPP settings
kk: PPP баптаулары

source: Prefix delegation settings
kk: Префиксті делегациялау баптаулары

source: Proxy
kk: Прокси

source: Serial settings
kk: Сериялық баптаулар

source: SR-IOV settings
kk: SR-IOV баптаулары

source: Traffic controls
kk: Трафикті басқару

source: Team device
kk: Team құрылғысы

source: Team port
kk: Team порты

source: Tun device
kk: Tun құрылғысы

source: User settings
kk: Пайдаланушы баптаулары

source: Wi-Fi P2P connection
kk: Wi-Fi P2P қосылымы

source: WiMAX connection
kk: WiMAX қосылымы

source: Wired Ethernet
kk: Сымды Ethernet

source: WireGuard VPN settings
kk: WireGuard VPN баптаулары

source: Wi-Fi connection
kk: Wi-Fi қосылымы

source: Wi-Fi security settings
kk: Wi-Fi қауіпсіздік баптаулары

source: WPAN settings
kk: WPAN баптаулары

source: name
kk: аты

source: <hidden>
kk: <жасырын>

source: Protocol
kk: Хаттама

source: ADSL encapsulation
kk: ADSL инкапсуляциясы

source: Connection type
kk: Қосылым түрі

source: Interface name
kk: Интерфейс аты

source: VPN type
kk: VPN түрі

source: Master
kk: Мастер

source: Transport mode
kk: Тасымалдау режимі

source: Bluetooth type
kk: Bluetooth түрі

source: Bonding mode
kk: Bonding режимі

source: Wi-Fi mode
kk: Wi-Fi режимі

source: Tun mode
kk: Tun режимі

source: IP Tunnel mode
kk: IP туннель режимі

source: IPVLAN mode
kk: IPVLAN режимі

source: MACVLAN mode
kk: MACVLAN режимі

source: MACsec mode
kk: MACsec режимі

source: Proxy method
kk: Прокси әдісі

source: The number of retries for the authentication. Zero means to try indefinitely; -1 means to use a global default. If the global default is not set, the authentication retries for 3 times before failing the connection. Connections using a pre-shared key to authenticate will only prompt for a new key during the last authentication attempt.
kk: Аутентификациялау әрекеттерінің саны. Нөл шексіз әрекетті білдіреді; -1 глобалды әдепкі мәнді қолдануды білдіреді. Егер глобалды әдепкі мән орнатылмаса, қосылым сәтсіз аяқталмас бұрын аутентификация 3 рет қайталанады. Аутентификациялау үшін алдын ала бөлісілген кілтті (preshared key) пайдаланатын қосылымдар тек соңғы аутентификациялау әрекеті кезінде жаңа кілтті сұрайды.

source: Whether or not the connection should be automatically connected by NetworkManager when the resources for the connection are available. TRUE to automatically activate the connection, FALSE to require manual intervention to activate the connection. Autoconnect happens when the circumstances are suitable. That means for example that the device is currently managed and not active. Autoconnect thus never replaces or competes with an already active profile. Note that autoconnect is not implemented for VPN profiles. See "secondaries" as an alternative to automatically connect VPN profiles. If multiple profiles are ready to autoconnect on the same device, the one with the better "connection.autoconnect-priority" is chosen. If the priorities are equal, then the most recently connected profile is activated. If the profiles were not connected earlier or their "connection.timestamp" is identical, the choice is undefined. Depending on "connection.multi-connect", a profile can (auto)connect only once at a time or multiple times.
kk: Қосылым ресурстары қолжетімді болғанда NetworkManager қосылымды автоматты түрде қосуы керек пе. Қосылымды автоматты түрде белсендіру үшін TRUE, қосылымды белсендіру үшін қолмен араласуды талап ету үшін FALSE. Автоматты қосылу жағдайлар қолайлы болғанда орын алады. Бұл мысалы, құрылғы қазіргі уақытта басқарылатынын және белсенді емес екенін білдіреді. Осылайша, автоматты қосылу ешқашан бұрыннан белсенді профильді алмастырмайды немесе онымен бәсекелеспейді. VPN профильдері үшін автоматты қосылу іске асырылмағанын ескеріңіз. VPN профильдерін автоматты түрде қосудың баламасы ретінде "secondaries" қараңыз. Егер бір құрылғыда бірнеше профиль автоматты қосылуға дайын болса, "connection.autoconnect-priority" жақсырақы таңдалады. Егер басымдықтар тең болса, ең соңғы қосылған профиль белсендіріледі. Егер профильдер бұрын қосылмаған болса немесе олардың "connection.timestamp" бірдей болса, таңдау анықталмаған. "connection.multi-connect" баптауына қосылымды профиль бір уақытта тек бір рет немесе бірнеше рет (авто)қосыла алады.

source: Whether or not ports of this connection should be automatically brought up when NetworkManager activates this connection. This only has a real effect for controller connections. The properties "autoconnect", "autoconnect-priority" and "autoconnect-retries" are unrelated to this setting. The permitted values are: 0: leave port connections untouched, 1: activate all the port connections with this connection, -1: default. If -1 (default) is set, global connection.autoconnect-ports is read to determine the real value. If it is default as well, this fallbacks to 0.
kk: NetworkManager осы қосылымды белсендіргенде осы қосылымның порттары автоматты түрде іске қосылуы керек пе. Бұл тек контроллер қосылымдарына нақты әсер етеді. "autoconnect", "autoconnect-priority" және "autoconnect-retries" қасиеттері бұл баптауға қатысы жоқ. Рұқсат етілген мәндер: 0: порт қосылымдарын өзгеріссіз қалдыру, 1: осы қосылыммен бірге барлық порт қосылымдарын белсендіру, -1: әдепкі. Егер -1 (әдепкі) орнатылса, нақты мәнді анықтау үшін глобалды connection.autoconnect-ports оқылады. Егер ол да әдепкі болса, бұл 0-ге ауысады.
