Repository: jhnc-oss/NetworkManager
Catalog: po/*.po
Languages: kk

source: An array of 8 uint values, where the array index corresponds to the User Priority (0 - 7) and the value indicates the percentage of bandwidth of the priority's assigned group that the priority may use. The sum of all percentages for priorities which belong to the same group must total 100 percents.
kk: 8 uint мәнінің массиві, мұндағы массив индексі Пайдаланушы Басымдығына (0 - 7) сәйкес келеді және мән басымдық қолдана алатын басымдықтың тағайындалған тобының өткізу қабілеттілігінің пайызын көрсетеді. Бір топқа жататын басымдықтар үшін барлық пайыздардың қосындысы 100 пайызды құрауы керек.

source: An array of 8 boolean values, where the array index corresponds to the User Priority (0 - 7) and the value indicates whether or not the corresponding priority should transmit priority pause.
kk: 8 логикалық мәннің массиві, мұндағы массив индексі Пайдаланушы Басымдығына (0 - 7) сәйкес келеді және мән сәйкес басымдықтың басымдық кідірісін жіберуі керек пе, жоқ па екенін көрсетеді.

source: Specifies the NMSettingDcbFlags for DCB Priority Flow Control (PFC). Flags may be any combination of "enable" (0x1), "advertise" (0x2), and "willing" (0x4).
kk: DCB Басымдық Ағынын Басқару (PFC) үшін NMSettingDcbFlags көрсетеді. Жалаушалар "enable" (0x1), "advertise" (0x2) және "willing" (0x4) кез келген комбинациясы болуы мүмкін.

source: An array of 8 uint values, where the array index corresponds to the Priority Group ID (0 - 7) and the value indicates the percentage of link bandwidth allocated to that group. Allowed values are 0 - 100, and the sum of all values must total 100 percents.
kk: 8 uint мәнінің массиві, мұндағы массив индексі Басымдық Тобының ID-іне (0 - 7) сәйкес келеді және мән сол топқа бөлінген қосылым өткізу қабілеттілігінің пайызын көрсетеді. Рұқсат етілген мәндер 0 - 100 және барлық мәндердің қосындысы 100 пайызды құрауы керек.

source: Specifies the NMSettingDcbFlags for DCB Priority Groups. Flags may be any combination of "enable" (0x1), "advertise" (0x2), and "willing" (0x4).
kk: DCB Басымдық Топтары үшін NMSettingDcbFlags көрсетеді. Жалаушалар "enable" (0x1), "advertise" (0x2) және "willing" (0x4) кез келген комбинациясы болуы мүмкін.

source: An array of 8 uint values, where the array index corresponds to the User Priority (0 - 7) and the value indicates the Priority Group ID. Allowed Priority Group ID values are 0 - 7 or 15 for the unrestricted group.
kk: 8 uint мәнінің массиві, мұндағы массив индексі Пайдаланушы Басымдығына (0 - 7) сәйкес келеді және мән Басымдық Тобының ID-ін көрсетеді. Рұқсат етілген Басымдық Тобының ID мәндері 0 - 7 немесе шектелмеген топ үшін 15.

source: An array of 8 boolean values, where the array index corresponds to the User Priority (0 - 7) and the value indicates whether or not the priority may use all of the bandwidth allocated to its assigned group.
kk: 8 логикалық мәннің массиві, мұндағы массив индексі Пайдаланушы Басымдығына (0 - 7) сәйкес келеді және мән басымдықтың өзінің тағайындалған тобына бөлінген барлық өткізу қабілеттілігін қолдана алу мүмкіндігін көрсетеді.

source: An array of 8 uint values, where the array index corresponds to the User Priority (0 - 7) and the value indicates the traffic class (0 - 7) to which the priority is mapped.
kk: 8 uint мәнінің массиві, мұндағы массив индексі Пайдаланушы Басымдығына (0 - 7) сәйкес келеді және мән басымдық салыстырылатын трафик класын (0 - 7) көрсетеді.

source: Name of the device handler that will be invoked to add and delete the device for this connection. The name can only contain ASCII alphanumeric characters and '-', '_', '.'. It cannot start with '.'. See the NetworkManager-dispatcher(8) man page for more details about how to write the device handler. By setting this property the generic connection becomes "virtual", meaning that it can be activated without an existing device; the device will be created at the time the connection is started by invoking the device-handler.
kk: Осы қосылым үшін құрылғыны қосу және өшіру үшін шақырылатын құрылғы өңдеушісінің аты. Аты тек ASCII әріптік-сандық таңбаларын және '-', '_', '.' қамтуы мүмкін. Ол '.' белгісімен бастала алмайды. Құрылғы өңдеушісін қалай жазу керектігі туралы толығырақ ақпарат алу үшін NetworkManager-dispatcher(8) нұсқаулығын қараңыз. Осы қасиетті орнату арқылы жалпы қосылым "виртуалды" болады, яғни оны бар құрылғысыз белсендіруге болады; құрылғы қосылым басталған кезде құрылғы өңдеушісін шақыру арқылы жасалады.

source: The GPRS Access Point Name specifying the APN used when establishing a data session with the GSM-based network. The APN often determines how the user will be billed for their network usage and whether the user has access to the Internet or just a provider-specific walled-garden, so it is important to use the correct APN for the user's mobile broadband plan. The APN may only be composed of the characters a-z, 0-9, ., and - per GSM 03.60 Section 14.9. If the APN is unset (the default) then it may be detected based on "auto-config" setting. The property can be explicitly set to the empty string to prevent that and use no APN.
kk: GSM негізіндегі желімен деректер сессиясын орнату кезінде қолданылатын APN көрсететін GPRS Қолжетімділік Нүктесінің Аты. APN көбінесе пайдаланушыға желілік қолданысы үшін қалай есепшот ұсынылатынын және пайдаланушының Интернетке қолжетімділігі бар ма, әлде тек провайдерге тән шектеулі аймаққа ма екенін анықтайды, сондықтан пайдаланушының мобильді кең жолақты жоспары үшін дұрыс APN қолдану маңызды. APN тек a-z, 0-9, ., және - таңбаларынан тұруы мүмкін (GSM 03.60, 14.9 бөліміне сәйкес). Егер APN орнатылмаған болса (әдепкі), онда ол "auto-config" баптауы негізінде анықталуы мүмкін. Мұны болдырмау және ешқандай APN қолданбау үшін қасиетті бос жолға айқын түрде орнатуға болады.

source: When TRUE, the settings such as APN, username, or password will default to values that match the network the modem will register to in the Mobile Broadband Provider database.
kk: TRUE болғанда, APN, пайдаланушы аты немесе пароль сияқты баптаулар Модем Мобильді Кең Жолақты Провайдер дерекқорында тіркелетін желіге сәйкес келетін мәндерге әдепкі болады.

source: The device unique identifier (as given by the WWAN management service) which this connection applies to. If given, the connection will only apply to the specified device.
kk: Осы қосылым қолданылатын құрылғының бірегей идентификаторы (WWAN басқару қызметі берген). Егер берілсе, қосылым тек көрсетілген құрылғыға қолданылады.

source: The device UID (as given by the WWAN management service) which this connection applies to. In contrast to "device-id", which is an inherent property of the connected device, this setting refers to a property set by a UDEV-rule. Refer to the "Common udev tags" -> "ID_MM_PHYSDEV_UID" documentation of ModemManager. If given, the connection will only apply to the specified device.
kk: Осы қосылым қолданылатын құрылғы UID (WWAN басқару қызметі берген). Қосылған құрылғының тән қасиеті болып табылатын "device-id" қасиетіне қарағанда, бұл баптау UDEV ережесі орнатқан қасиетке сілтеме жасайды. ModemManager құжаттамасының "Common udev tags" -> "ID_MM_PHYSDEV_UID" бөлімін қараңыз. Егер берілсе, қосылым тек көрсетілген құрылғыға қолданылады.

source: When TRUE, only connections to the home network will be allowed. Connections to roaming networks will not be made.
kk: TRUE болған кезде, тек үй желісіне қосылымдарға рұқсат етіледі. Роумингтік желілерге қосылымдар жасалмайды.

source: For LTE modems, this sets the APN for the initial EPS bearer that is set up when attaching to the network. Setting this parameter implies initial-eps-bearer-configure to be TRUE.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін APN орнатады. Бұл параметрді орнату initial-eps-bearer-configure TRUE болуын білдіреді.

source: For LTE modems, this setting determines whether the initial EPS bearer shall be configured when bringing up the connection. It is inferred TRUE if initial-eps-bearer-apn is set.
kk: LTE модемдері үшін бұл баптау қосылымды көтеру кезінде бастапқы EPS тасымалдаушысының бапталуы керек пе екенін анықтайды. Егер initial-eps-bearer-apn орнатылса, ол TRUE деп есептеледі.

source: For LTE modems, this sets NOAUTH authentication method for the initial EPS bearer that is set up when attaching to the network. If TRUE, do not require the other side to authenticate itself to the client. If FALSE, require authentication from the remote side. In almost all cases, this should be TRUE.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін NOAUTH аутентификация әдісін орнатады. Егер TRUE болса, екінші жақтың клиентке өзін аутентификациялауын талап етпеңіз. Егер FALSE болса, қашықтағы жақтан аутентификацияны талап етіңіз. Барлық жағдайларда дерлік бұл TRUE болуы керек.

source: For LTE modems, this sets the password for the initial EPS bearer that is set up when attaching to the network. Setting this parameter implies initial-eps-bearer-configure to be TRUE.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін парольді орнатады. Бұл параметрді орнату initial-eps-bearer-configure TRUE болуын білдіреді.

source: Flags indicating how to handle the "initial-eps-bearer-password" property.
kk: "initial-eps-bearer-password" қасиетін қалай өңдеу керектігін көрсететін жалаушалар.

source: For LTE modems, this disables CHAP authentication method for the initial EPS bearer that is set up when attaching to the network.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін CHAP аутентификация әдісін сөндіреді.

source: For LTE modems, this disables EAP authentication method for the initial EPS bearer that is set up when attaching to the network.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін EAP аутентификация әдісін сөндіреді.

source: For LTE modems, this disables MSCHAP authentication method for the initial EPS bearer that is set up when attaching to the network.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін MSCHAP аутентификация әдісін сөндіреді.

source: For LTE modems, this disables MSCHAPV2 authentication method for the initial EPS bearer that is set up when attaching to the network.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін MSCHAPV2 аутентификация әдісін сөндіреді.

source: For LTE modems, this disables PAP authentication method for the initial EPS bearer that is set up when attaching to the network.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін PAP аутентификация әдісін сөндіреді.

source: For LTE modems, this sets the username for the initial EPS bearer that is set up when attaching to the network. Setting this parameter implies initial-eps-bearer-configure to be TRUE.
kk: LTE модемдері үшін бұл желіге қосылу кезінде орнатылатын бастапқы EPS тасымалдаушысы үшін пайдаланушы атын орнатады. Бұл параметрді орнату initial-eps-bearer-configure TRUE болуын білдіреді.

source: The Network ID (GSM LAI format, ie MCC-MNC) to force specific network registration. If the Network ID is specified, NetworkManager will attempt to force the device to register only on the specified network. This can be used to ensure that the device does not roam when direct roaming control of the device is not otherwise possible.
kk: Нақты желіні тіркеуді мәжбүрлеу үшін Желі ID (GSM LAI пішімі, яғни MCC-MNC). Егер Желі ID көрсетілсе, NetworkManager құрылғыны тек көрсетілген желіде тіркелуге мәжбүрлеуге тырысады. Бұл құрылғыны тікелей роумингтік басқару мүмкін болмаған жағдайда құрылғының роумингке шықпауын қамтамасыз ету үшін қолданылуы мүмкін.

source: Legacy setting that used to help establishing PPP data sessions for GSM-based modems.
kk: GSM негізіндегі модемдер үшін PPP деректер сессияларын орнатуға көмектесетін ескі баптау.

source: If the SIM is locked with a PIN it must be unlocked before any other operations are requested. Specify the PIN here to allow operation of the device.
kk: Егер SIM PIN кодымен құлыпталған болса, кез келген басқа операциялар сұралмас бұрын оның құлпын ашу керек. Құрылғының жұмыс істеуіне мүмкіндік беру үшін PIN кодын осында көрсетіңіз.

source: The SIM card unique identifier (as given by the WWAN management service) which this connection applies to. If given, the connection will apply to any device also allowed by "device-id" which contains a SIM card matching the given identifier.
kk: Осы қосылым қолданылатын SIM картасының бірегей идентификаторы (WWAN басқару қызметі берген). Егер берілсе, қосылым берілген идентификаторға сәйкес келетін SIM картасы бар "device-id" арқылы рұқсат етілген кез келген құрылғыға қолданылады.

source: A MCC/MNC string like "310260" or "21601" identifying the specific mobile network operator which this connection applies to. If given, the connection will apply to any device also allowed by "device-id" and "sim-id" which contains a SIM card provisioned by the given operator.
kk: Осы қосылым қолданылатын нақты мобильді желі операторын анықтайтын "310260" немесе "21601" сияқты MCC/MNC жолы. Егер берілсе, қосылым берілген оператор қамтамасыз еткен SIM картасы бар "device-id" және "sim-id" арқылы рұқсат етілген кез келген құрылғыға қолданылады.

source: The optional interlink port name of the HSR interface.
kk: HSR интерфейсінің міндетті емес interlink порт атауы.

source: The last byte of supervision address.
kk: Қадағалау адресінің соңғы байты.

source: The port1 interface name of the HSR. This property is mandatory.
kk: HSR port1 интерфейс атауы. Бұл қасиет міндетті.

source: The port2 interface name of the HSR. This property is mandatory.
kk: HSR port2 интерфейс атауы. Бұл қасиет міндетті.

source: Configures the protocol version to be used for the HSR/PRP interface. "default" (-1) sets the protocol version to the default version for the protocol. "hsr-2010" (0) sets the protocol version to HSRv0 (IEC 62439-3:2010). "hsr-2012" (1) sets the protocol version to HSRv1 (IEC 62439-3:2012).
kk: HSR/PRP интерфейсі үшін қолданылатын хаттама нұсқасын баптайды. "default" (-1) хаттама нұсқасын хаттаманың әдепкі нұсқасына орнатады. "hsr-2010" (0) хаттама нұсқасын HSRv0 (IEC 62439-3:2010) етіп орнатады. "hsr-2012" (1) хаттама нұсқасын HSRv1 (IEC 62439-3:2012) етіп орнатады.

source: The protocol used by the interface, whether it is PRP or HSR.
kk: Интерфейс қолданатын хаттама, PRP немесе HSR.

source: If specified, this connection will only apply to the IPoIB device whose permanent MAC address matches. This property does not change the MAC address of the device (i.e. MAC spoofing).
kk: Егер көрсетілсе, бұл қосылым тек тұрақты MAC адресі сәйкес келетін IPoIB құрылғысына қолданылады. Бұл қасиет құрылғының MAC адресін өзгертпейді (яғни, MAC spoofing).

source: The InfiniBand p-key to use for this device. A value of -1 means to use the default p-key (aka "the p-key at index 0"). Otherwise, it is a 16-bit unsigned integer, whose high bit 0x8000 is set if it is a "full membership" p-key. The values 0 and 0x8000 are not allowed. With the p-key set, the interface name is always "$parent.$p_key". Setting "connection.interface-name" to another name is not supported. Note that kernel will internally always set the full membership bit, although the interface name does not reflect that. Usually the user would want to configure a full membership p-key with 0x8000 flag set.
kk: Осы құрылғы үшін қолданылатын InfiniBand p-key. -1 мәні әдепкі p-key (яғни "0 индексіндегі p-key") қолдануды білдіреді. Әйтпесе, бұл 16 биттік таңбасыз бүтін сан, оның 0x8000 жоғары биті "толық мүшелік" p-key болса орнатылады. 0 және 0x8000 мәндеріне рұқсат етілмейді. p-key орнатылған кезде, интерфейс атауы әрқашан "$parent.$p_key" болады. "connection.interface-name" қасиетін басқа атауға орнатуға қолдау көрсетілмейді. Ескеріңіз, ядро ішкі жағынан әрқашан толық мүшелік битін орнатады, бірақ интерфейс атауы мұны көрсетпейді. Әдетте пайдаланушы 0x8000 жалаушасы орнатылған толық мүшелік p-key баптағысы келеді.

source: The interface name of the parent device of this device. Normally NULL, but if the "p_key" property is set, then you must specify the base device by setting either this property or "mac-address".
kk: Осы құрылғының негізгі құрылғысының интерфейс атауы. Әдетте NULL, бірақ егер "p_key" қасиеті орнатылса, осы қасиетті немесе "mac-address" орнату арқылы негізгі құрылғыны көрсетуіңіз керек.

source: The IP-over-InfiniBand transport mode. Either "datagram" or "connected".
kk: IP-over-InfiniBand тасымалдау режимі. "datagram" немесе "connected".

source: A list of IPv4 addresses and their prefix length. Multiple addresses can be separated by comma. For example "192.168.1.5/24, 10.1.0.5/24". The addresses are listed in decreasing priority, meaning the first address will be the primary address.
kk: IPv4 адрестерінің және олардың префикс ұзындығының тізімі. Бірнеше адрестерді үтірмен бөлуге болады. Мысалы "192.168.1.5/24, 10.1.0.5/24". Адрестер кему басымдығымен тізімделген, яғни бірінші адрес негізгі адрес болады.

source: VPN connections will default to add the route automatically unless this setting is set to FALSE. For other connection types, adding such an automatic route is currently not supported and setting this to TRUE has no effect.
kk: Бұл баптау FALSE мәніне орнатылмаса, VPN қосылымдары бағдарды автоматты түрде қосады. Басқа қосылым түрлері үшін мұндай автоматты бағдарды қосуға қазіргі уақытта қолдау көрсетілмейді және мұны TRUE мәніне орнатудың ешқандай әсері жоқ.

source: Controls the CLAT (Customer-side translator) functionality. CLAT is used to implement the client part of 464XLAT (RFC 6877), an architecture that provides IPv4 connectivity to hosts on IPv6-only networks. When CLAT is enabled, NetworkManager discovers the NAT64 prefix from IPv6 Router Advertisements; if a NAT64 prefix is announced, NetworkManager installs a BPF program to perform the stateless translation of packets between IPv4 and IPv6. Setting "no" (0) completely disables CLAT. "auto" (1) enables CLAT only when the IPv4 method is 'auto' and the device doesn't have a native IPv4 gateway. "force" (2) enables CLAT even if the IPv4 method is not 'auto' and even if the device has a native IPv4 gateway. When set to "default" (-1), the actual value is looked up in the global configuration; if not specified it defaults to "no" (0). In the future the default fall back value will change to "auto" (1).
kk: CLAT (Тұтынушы жағындағы аудармашы) функционалдығын басқарады. CLAT 464XLAT (RFC 6877) клиенттік бөлігін жүзеге асыру үшін қолданылады, бұл архитектура IPv6-тек желілеріндегі хосттарға IPv4 қосылымын қамтамасыз етеді. CLAT іске қосылған кезде, NetworkManager IPv6 Маршрутизатор Хабарландыруларынан NAT64 префиксін табады; егер NAT64 префиксі жарияланса, NetworkManager IPv4 және IPv6 арасындағы пакеттерді күйсіз аударуды орындау үшін BPF бағдарламасын орнатады. "no" (0) орнату CLAT-ты толығымен сөндіреді. "auto" (1) CLAT-ты тек IPv4 әдісі 'auto' болғанда және құрылғыда жергілікті IPv4 шлюзі болмағанда ғана іске қосады. "force" (2) CLAT-ты IPv4 әдісі 'auto' болмаса да және құрылғыда жергілікті IPv4 шлюзі болса да іске қосады. "default" (-1) мәніне орнатылған кезде, нақты мән глобалды конфигурациядан ізделеді; егер көрсетілмесе, ол әдепкі бойынша "no" (0) болады. Болашақта әдепкі резервтік мән "auto" (1) болып өзгереді.

source: Maximum timeout in milliseconds used to check for the presence of duplicate IP addresses on the network. If an address conflict is detected, the activation will fail. The property is currently implemented only for IPv4. A zero value means that no duplicate address detection is performed, -1 means the default value (either the value configured globally in NetworkManger.conf or 200ms). A value greater than zero is a timeout in milliseconds. Note that the time intervals are subject to randomization as per RFC 5227 and so the actual duration can be between half and the full time specified in this property.
kk: Желіде қайталанатын IP адрестердің бар-жоғын тексеру үшін қолданылатын максималды күту уақыты (миллисекундпен). Егер адрес қақтығысы анықталса, белсендіру сәтсіз аяқталады. Қасиет қазіргі уақытта тек IPv4 үшін жүзеге асырылған. Нөлдік мән қайталанатын адресті анықтау орындалмайтынын білдіреді, -1 әдепкі мәнді білдіреді (NetworkManger.conf ішінде глобалды бапталған мән немесе 200мс). Нөлден үлкен мән — миллисекундтағы күту уақыты. Ескеріңіз, уақыт аралықтары RFC 5227 сәйкес рандомизацияға ұшырайды, сондықтан нақты ұзақтық осы қасиетте көрсетілген уақыттың жартысы мен толық уақыты арасында болуы мүмкін.
